//==================================================================================================
//
// 单元旁路的编译宏，头文件
//
//
//   2013-01-16   10:26:07
//
//==================================================================================================


#ifndef __M_CELL_BYPASS_H__
#define __M_CELL_BYPASS_H__



#include "main.h"
#include "m_interfaceModify.h"



//=====================================================================
#if (!DEBUG_PRG_IN_RAM) && (HW_HD90 == INV_TYPE)   // 程序放在Flash中，HD90才有旁路
#define CELL_BYPASS         1       // 单元旁路，1-开启，0-关闭
#define CELL_BYPASS_MECH    0       // 手动更改T1_T2接线，实现旁路逻辑，1-开启，0-关闭
                                    // 旁路使能A9-00要开启
#elif 1                 // 程序放在RAM中调试
#define CELL_BYPASS         0       // 单元旁路，1-开启，0-关闭
#define CELL_BYPASS_MECH    0       // 手动更改T1_T2接线，实现旁路逻辑，1-开启，0-关闭
#endif
//=====================================================================

#endif  //__M_CELL_BYPASS_H__


