//==================================================================================================
//
// 模拟风机负载计算的编译宏，头文件
//
//
// 
//
//==================================================================================================


#ifndef __M_TORQUEDEBUGCALC_H__
#define __M_TORQUEDEBUGCALC_H__



#include "m_interface.h"




//=====================================================================
#if !DEBUG_PRG_IN_RAM   // 程序放在Flash中
#define DEBUG_TORQUE_CALC             1
#elif 1                 // 程序放在RAM中调试
#define DEBUG_TORQUE_CALC             0
#endif
//=====================================================================




#endif  //__M_TORQUEDEBUGCALC_H__


