
#ifndef __F_PUBLIC_DEFINE_H__
#define __F_PUBLIC_DEFINE_H__

//======================不同机型的宏定义======================//

//==============================//
//
// HD92-R宏定义
//
//==============================//
#define HD90_AFE                0   // HD92-R 专用


//==============================//
//
// 凯撒 两象限和四象限都需要开启CM3000为1
// 四象限 逆变再开启 CM3000_4_QUADRANT_INVT为1
// 四象限 整流再开启 CM3000_4_QUADRANT_AFE为1
//
//==============================//
#define CM3000                  1       // CM3000 凯撒两象限整机

#define CM3000_4_QUADRANT_INVT  0       // CM3000 凯撒四象限的逆变程序 

#define CM3000_4_QUADRANT_AFE   0       // CM3000 凯撒四象限的整流程序

//==============================//
// 岸用电源
//==============================//
#define HD72                    0       // 岸电程序  仅整合了交互接口，该宏暂时不能开


//=============================END============================//



//===========================================================//
//
// 以下为功能性的宏定义
//
//===========================================================//
#define HD92_TAKEUP             0       // 提升机专用

#define RS2_MASTER_ENABLE       1       // ARM作为RS2的主站

#define PRECHARGE_CONTACTOR_TRIGGER_MODE    0   // 云南曲靖小窑沟 和山西均为 1: 触发式合真空接触器 

#define FUNC_SPI_DEBUG 	        0

#define SD_DEBUG                0

#define LVRT_PRECHARGE_DEBUG    0


#define INV_1140    0
#define INV_3300    1
#define INV_MODEL   INV_3300 // 0: 1140; 1: 3300;


#endif











