//==================================================================================================
//
// 测试
//
//
//
// Time-stamp: <2011-3-10 15:01:23  author, 0000>
//
//==================================================================================================


#ifndef __TEST_H__
#define __TEST_H__



#include "main.h"




#define TEST_K      0       // 1-开启









//----------------------
// 测试使用的函数和变量
void TestIQmath(void);
void TestMath1(void);
void TestMv(void);
int16 GetCellCount(int16);
//-------------------------












#endif  //__TEST_H__


