/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                      */
/*											2017 ~													*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		EtherCAT14_ContrlMode.c : EtherCAT 控制模式                        					    	*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "Main.h"


UCHAR EtherCAT_ControlMode = 0;

/****************************************************************************************************/
/*Function_Name:EtherCAT_ControlModeSel()                                                           */
/*Description  :EtherCAT 控制模式选择                                                                  */
/****************************************************************************************************/
void EtherCAT_ControlModeSel(void)
{
	CinV.f.Sv.OTCheck = 0;  
    switch( s8ModeofOP )
    {
        /*------------------------------------------------------------------------------------------*/
        case 1:                                                 /* 位置轮廓模式( 1 )                */
            s8ModeofOPDis = 1;
            EtherCAT_ControlMode = 1;
            break;
        /*------------------------------------------------------------------------------------------*/
        case 3:                                                 /* 速度轮廓模式( 3 )                */
            s8ModeofOPDis = 3;
            EtherCAT_ControlMode = 0;
            EtherCAT_SpdAccDec();
            SpdCoeffUpdate();
            AbsPosRecord = 0;
            break;
        /*------------------------------------------------------------------------------------------*/
        case 4:                                                 /* 转矩轮廓模式( 4 )                */
            s8ModeofOPDis = 4;
            EtherCAT_ControlMode = 2;
            AbsPosRecord = 0;
            break;
        /*------------------------------------------------------------------------------------------*/            
        case 6:                                                 /* 回零模式( 6 )                    */
            s8ModeofOPDis = 6;
            EtherCAT_ControlMode = 1;
            CinV.f.Sv.OTCheck = 1;                              /* 超程检测                         */
            if(BinV.f.BaseEnable)
            {
                if(Prm.b_prm0_06 & 0x0001 ==0x0001)
                {
                    if(CinV.f.Sv.PotIn==1)
                    {
                        KPI_WARNINGSET(WRN_POT);
                    }
                    else if(CinV.f.Sv.NotIn==1)
                    {
                        KPI_WARNINGSET(WRN_NOT);
                    }
                }
            }
            break;
        /*------------------------------------------------------------------------------------------*/            
        case 8:                                                 /* 周期同步位置模式( 8 )            */
            s8ModeofOPDis = 8;
            EtherCAT_ControlMode = 1;
            AbsPosRecord = 0;
            break;
        /*------------------------------------------------------------------------------------------*/            
        case 9:                                                 /* 周期同步速度模式( 9 )            */
            s8ModeofOPDis = 9;
            EtherCAT_ControlMode = 0;
            AbsPosRecord = 0;
            break;
        /*------------------------------------------------------------------------------------------*/            
        case 10:                                                /* 周期同步转矩模式( 10 )           */
            s8ModeofOPDis = 10;
            EtherCAT_ControlMode = 2;
            AbsPosRecord = 0;
            break;
    /*------------------------------------------------------------------------------------------*/
       case 5:                                                /* 力位混合控制模式( 5 )           */
           s8ModeofOPDis = 5;
           EtherCAT_ControlMode = 7;
           AbsPosRecord = 0;
           break;
        /*------------------------------------------------------------------------------------------*/            
        default:
            EtherCAT_ControlMode = 0;
            s8ModeofOPDis = s8ModeofOP;                         /* 其它模式(异常)                   */
            break;
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /*  非位置控制模式时,位置相关变量清零或者更新处理                                               */
    /*----------------------------------------------------------------------------------------------*/
    if( EtherCAT_ControlMode != 1 )
    {
        EtherCATPosDeal(  );
    }

}

