/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                     */
/*											2017 ~													*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		EtherCAT15_ContWord.c : CanOpen402 状态机                         					    	*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "Main.h"

UCHAR   ErrRstStatus = 0;
UCHAR   HomeModeStatus = 0;
UCHAR   HaltEndFlag = 0;

void Eth_Orig_Status(void);
/****************************************************************************************************/
/*Function_Name:Ds402Status_ControlWordDeal                                                         */
/*Description  :伺服系统根据【控制字】来处理【状态字】                                                        */
/****************************************************************************************************/
UCHAR EtherCAT_ControlStatus = 0;
void Ds402Status_ControlWordDeal(void)
{
ULONG lkx;
UCHAR EAControlStatus = 0;
    /*----------------------------------------------------------------------------------------------*/
    /* 使能按钮按钮关联控制字0x3F                                                                    */
    /*----------------------------------------------------------------------------------------------*/
    if((CinV.f.Seq.ServoOn) && (CAN_EXFUNC1_2_EN))
    {
        ODDatArr[Control_Word].all = 0x3F;
        if(CiA402StatusMachine == 1)
        {
            CanOpen_ControlStatus = 5;
        }
        else
        {
            CanOpen_ControlStatus = 4;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 急停按钮关联控制字0x0B                                                                        */
    /*----------------------------------------------------------------------------------------------*/
    if((CinV.f.Sv.EmcyStop) && CAN_EXFUNC0_12_EN )
    {
        u16ControlWord = 0x0B;
    }
	/*----------------------------------------------------------------------------------------------*/
	/* 2. 获取当前的控制字的值																		    */
	/*----------------------------------------------------------------------------------------------*/
	ControlWord.w = u16ControlWord;					//控制字
	StatusWord.w  = u16StatusWord;					//状态字
if(!CiA402StatusMachine)
{
	/*----------------------------------------------------------------------------------------------*/
	/* 3. 状态机处理																				    */
	/*----------------------------------------------------------------------------------------------*/
	switch(EtherCAT_ControlStatus)
	{
		/*------------------------------------------------------------------------------------------*/
		case 0:										//【未准备好接通电源】
			StatusWord.w = 0;
			EtherCAT_ControlStatus = 1;						//状态转换1
			break;
		/*------------------------------------------------------------------------------------------*/
		case 1:										//【不可接通电源】
			/*--------------------------------------------------------------------------------------*/
			StatusWord.w &= 0x8000;
			StatusWord.f.SwitchOnDisable = 1;
            StatusWord.f.OperationEnable = 0;
			/*--------------------------------------------------------------------------------------*/
			if(((ControlWord.w & 0x0007) == 0x0006) && CoutV.f.Seq.MainPowerOn == 1 )
				EtherCAT_ControlStatus = 2;					//状态转换2
			/*--------------------------------------------------------------------------------------*/
			break;
		/*------------------------------------------------------------------------------------------*/
		case 2:										//【准备好接通电源】--->关闭
			/*--------------------------------------------------------------------------------------*/
			StatusWord.w &= 0x8000;
			StatusWord.f.Rdy2SwitchOn = 1;
			StatusWord.f.QuickStop = 1;
            StatusWord.f.OperationEnable = 0;
			/*--------------------------------------------------------------------------------------*/
			if((ControlWord.w & 0x000F) == 0x0007 )// || (ControlWord.w & 0x000F) == 0x000F)
				EtherCAT_ControlStatus = 3;					//状态转换3
			/*--------------------------------------------------------------------------------------*/
			if(ControlWord.f.EnableVoltage == 0 || (ControlWord.w & 0x0006) == 0x0002)
				EtherCAT_ControlStatus = 1;					//状态转换7
			/*--------------------------------------------------------------------------------------*/
			break;
		/*------------------------------------------------------------------------------------------*/
		case 3:										//【开始供电】
			/*--------------------------------------------------------------------------------------*/
			StatusWord.w &= 0x8000;
			StatusWord.f.Rdy2SwitchOn = 1;
			StatusWord.f.SwitchOn = 1;
			StatusWord.f.QuickStop = 1;
//			StatusWord.f.VoltEnabled = 1;
            StatusWord.f.OperationEnable = 0;
			/*--------------------------------------------------------------------------------------*/			
			if((ControlWord.w & 0x000F) == 0x000F)
			{
				EtherCAT_ControlStatus = 4;					//状态转换4
			}
			/*--------------------------------------------------------------------------------------*/
			if((ControlWord.f.EnableVoltage == 0x0 ) || (ControlWord.w & 0x0006) == 0x0002)
				EtherCAT_ControlStatus = 1;					//状态转换10
			/*--------------------------------------------------------------------------------------*/
			break;
		/*------------------------------------------------------------------------------------------*/
		case 4:										        //【开始运行】
			/*--------------------------------------------------------------------------------------*/
			StatusWord.w &= 0x9000;                         /* 预防PP模式下Bit12被清零                  */
			StatusWord.f.Rdy2SwitchOn = 1;
			StatusWord.f.SwitchOn = 1;
			StatusWord.f.OperationEnable = 1;
			StatusWord.f.QuickStop = 1;
			/*--------------------------------------------------------------------------------------*/
			if((ControlWord.w & 0x000F) == 0x0007)
			{
				EtherCAT_ControlStatus = 3;					//状态转换5
			}
			/*--------------------------------------------------------------------------------------*/
			if((ControlWord.w & 0x0007) == 0x0006)
			{
				EtherCAT_ControlStatus = 2;					//状态转换8
			}
			/*--------------------------------------------------------------------------------------*/
			if(ControlWord.f.EnableVoltage == 0x0)
			{
				EtherCAT_ControlStatus = 1;					//状态转换9
			}
			/*--------------------------------------------------------------------------------------*/
			if((ControlWord.w & 0x0006) == 0x0002)
			{
				EtherCAT_ControlStatus = 5;					//状态转换11
			}
			/*--------------------------------------------------------------------------------------*/
			if( Alm.f.AlmFlag == 1 )
			{
	            StatusWord.f.Rdy2SwitchOn = 0;
	            StatusWord.f.SwitchOn = 0;
	            StatusWord.f.OperationEnable = 0;
	            StatusWord.f.QuickStop = 0;
			}
			break;
		/*------------------------------------------------------------------------------------------*/
		case 5:										        //【急停状态】
			/*--------------------------------------------------------------------------------------*/
			StatusWord.w &= 0x8000;
			StatusWord.f.Rdy2SwitchOn = 1;
			StatusWord.f.SwitchOn = 1;
			StatusWord.f.OperationEnable = 1;
//			StatusWord.f.VoltEnabled = 1;
			/*--------------------------------------------------------------------------------------*/
			if((ControlWord.w & 0x000F) == 0x000F)
            {
				EtherCAT_ControlStatus = 4;					//状态转换8
            }
			/*--------------------------------------------------------------------------------------*/
			if(ControlWord.f.EnableVoltage == 0x0)
            {
				EtherCAT_ControlStatus = 1;					//状态转换12
            }
			/*--------------------------------------------------------------------------------------*/
            if((ControlWord.w & 0x000F) == 0x0006)
            {
				EtherCAT_ControlStatus = 1;					//状态转换8
            }
			break;
		/*------------------------------------------------------------------------------------------*/
		case 6:										        //【出错】
			/*--------------------------------------------------------------------------------------*/
			StatusWord.w &= 0x8000;
			StatusWord.f.Fault = 1;
            StatusWord.f.OperationEnable = 0;
			/*--------------------------------------------------------------------------------------*/
			if(ControlWord.f.FaultReset == 0x1 || DIDOVar.DISt.AlmReset)
			{
				EtherCAT_ControlStatus = 1;					//状态转换15
			}
			/*--------------------------------------------------------------------------------------*/
			break;
		/*------------------------------------------------------------------------------------------*/
		case 7:										        // 【错误反应】
        case 8:
            StatusWord.w &= 0x8000;
//            StatusWord.f.QuickStop = 0;                   // bit5 快速停机
            StatusWord.f.SwitchOnDisable = 1;               // bit6 伺服不可运行
            if((ControlWord.w & 0x0007) == 0x0006)
                EtherCAT_ControlStatus = 2;
            break;
		default:
			/*--------------------------------------------------------------------------------------*/
			StatusWord.w &= 0x8000;
			StatusWord.w |= 0x0F;
			/*--------------------------------------------------------------------------------------*/
			EtherCAT_ControlStatus = 6;						//状态转换14
			break;
	
	}
}

else if(CiA402StatusMachine)
{
	EAControlStatus = CiA402_StatusMachine(EtherCAT_ControlStatus);
	EtherCAT_ControlStatus = EAControlStatus;
}
    /*----------------------------------------------------------------------------------------------*/
    /*  当前母线电压的状态                                                                               */
    /*----------------------------------------------------------------------------------------------*/
    StatusWord.f.VoltEnabled = CoutV.f.Seq.MainPowerOn;
    
	/*----------------------------------------------------------------------------------------------*/
	/* 4. 故障复位																					    */
	/*----------------------------------------------------------------------------------------------*/
	if(ControlWord.f.FaultReset == 0x1 || DIDOVar.DISt.AlmReset)
	{
        EtherCAT_ControlStatus = 1;					//状态转换15
	}
    /*----------------------------------------------------------------------------------------------*/
    /* 5.快速停机 SDZ                                                                                 */
    /*----------------------------------------------------------------------------------------------*/
//    if(ControlWord.f.QuickStop == 0)
 //       EtherCAT_ControlStatus = 8;
    
	/*----------------------------------------------------------------------------------------------*/
	/* 6. 更新状态字																				    */
	/*----------------------------------------------------------------------------------------------*/
	StatusWord.f.Remote = 1;
    
    /*----------------------------------------------------------------------------------------------*/
    /* 7.故障信息 (Bit4)                                                                              */
    /*----------------------------------------------------------------------------------------------*/
    StatusWord.f.Fault      = Alm.f.AlmFlag;
    /*----------------------------------------------------------------------------------------------*/
    /* 8.位置 or 速度到达 (Bit10)                                                                      */
    /*----------------------------------------------------------------------------------------------*/
    if( s8ModeofOPDis == 3 || s8ModeofOPDis == 9 )
    {
        StatusWord.f.TargetReach = CoutV.f.Ctrl.ReachSpd;
    }
    /*----------------------------------------------------------------------------------------------*/
    else if( s8ModeofOPDis == 1 || s8ModeofOPDis == 8 )
    {
        StatusWord.f.TargetReach = BoutV.f.Ctrl.Coin;
        /*------------------------------------------------------------------------------------------*/
        /* 若有错误码或快速停机，则位置未到达                                                       */
        /*------------------------------------------------------------------------------------------*/
        if( ( u16ErrCode > 0x0000 && u16ErrCode <= 0x08FF ) ||
            ( u16ErrCode > 0x0A00 ) ||
            ( EtherCAT_ControlStatus == 8))
        {
            StatusWord.f.TargetReach = 0;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    else if( s8ModeofOPDis == 4  || s8ModeofOPDis == 10)
    {
        StatusWord.f.TargetReach = ETorFlag;
    }
    /*----------------------------------------------------------------------------------------------*/
    else if( s8ModeofOPDis == 6 )
    {
        /*------------------------------------------------------------------------------------------*/
        if( BinV.f.BaseEnable == 1 )
        {
            if( HaltEndFlag == 1 )
            {
                StatusWord.f.TargetReach = 1;
            }
            else
            {
                if( EthPosV.OB6040Bit4Status == 0x03 )
                {
                    StatusWord.f.TargetReach = OrgControlBit.bit.OrgOkFlag;
                }
                else
                {
                    StatusWord.f.TargetReach = 1;
                }
            }            
        }
        else
        {
            StatusWord.f.TargetReach = 0;
            OrgControlBit.bit.OrgOkFlag = 0;
        }
    }
    
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        StatusWord.f.TargetReach = 0;
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /* 限位开关 (Bit11)                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    if( s8ModeofOPDis == 6 )
    {
        switch( s8HomingMethod )
        {
            case 3:
            case 4:
            case 5:
            case 6:
            case 20:
            case 21:
            case 22:
            case 33:
            case 34:
            case 35:
                if( CoutV.f.Sv.Pot == 0 && CoutV.f.Sv.Not == 0 )
                {
                    StatusWord.f.InternalLimitActive = 0;
                }
                else
                {
                    StatusWord.f.InternalLimitActive = 1;
                }
                StatusWord.f.Warning = Alm.f.WrnFlag;
            break;
            default:
                StatusWord.f.InternalLimitActive = 0;
                StatusWord.f.Warning = 0;
            break;
        }
    }
    else
    {  
        if( CoutV.f.Sv.Pot == 0 && CoutV.f.Sv.Not == 0 )
        {
            StatusWord.f.InternalLimitActive = 0;
        }
        else
        {
            StatusWord.f.InternalLimitActive = 1;
        }
        StatusWord.f.Warning = Alm.f.WrnFlag;
    }    

    /*----------------------------------------------------------------------------------------------*/
    /* 零速度信号 (Bit12)                                                                           */
    /*----------------------------------------------------------------------------------------------*/
    if( s8ModeofOPDis == 6 )
    {
        StatusWord.f.ZeroSpd = OrgControlBit.bit.OrgOkFlag;
    }
    /*----------------------------------------------------------------------------------------------*/
    else if( s8ModeofOPDis == 8 || s8ModeofOPDis == 9 || s8ModeofOPDis == 10)
    {
          StatusWord.f.ZeroSpd = BinV.f.BaseEnable;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 在速度模式下,移动标志位与其它几家的定义相反,进行相应的优化处理 @2021.03.01                   */
    /*----------------------------------------------------------------------------------------------*/
    else if( s8ModeofOPDis == 3 )
    {
#if 0
        StatusWord.f.ZeroSpd = CoutV.f.Ctrl.MotorMoving;
#else
        StatusWord.f.ZeroSpd = !CoutV.f.Ctrl.MotorMoving;
#endif
        if( BinV.f.BaseEnable == 0 )
        {
            StatusWord.f.ZeroSpd = 0;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        ;
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /* 退出回零模式时,状态字中Bit12需要清零,防止对轮廓位置模式的影响  @2022.04.19                   */
    /*----------------------------------------------------------------------------------------------*/
    HomeModeStatus = ( HomeModeStatus << 1 ) & 0x03;
    if( s8ModeofOPDis == 6 )
    {
        HomeModeStatus |= 0x01;
    }
    if( HomeModeStatus == 0x02 )
    {
        StatusWord.f.ZeroSpd = 0;
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归失败(Bit13)                                                                          */
    /*----------------------------------------------------------------------------------------------*/
    if( s8ModeofOPDis == 1 || s8ModeofOPDis == 8 )                      /* 轮廓位置和周期同步       */
    {
        StatusWord.f.OperationModeSpeckfic = BoutV.f.PosFollowErFlg;
    }
    else if( s8ModeofOPDis == 6 )                                       /* 原点回归模式             */
    {
        StatusWord.f.OperationModeSpeckfic = BoutV.f.PosFollowErFlg;
    }
    else
    {
    
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归完成(Bit15)                                                                          */
    /*----------------------------------------------------------------------------------------------*/
#if 0
    StatusWord.f.HomeFind = OrgControlBit.bit.OrgDone;
#endif   
    /*----------------------------------------------------------------------------------------------*/
    /*  更新对象字典                                                                                */
    /*----------------------------------------------------------------------------------------------*/
	u16StatusWord = StatusWord.w;
	if( CAN_EXFUNC1_0_EN )
	{
	    Eth_Orig_Status();
	}
    
    /*----------------------------------------------------------------------------------------------*/
    /*                                 EtherCat 控制伺服使能                                           */
    /*----------------------------------------------------------------------------------------------*/
	if( (( Prm.b_prm0_0 & 0x000F ) == 0x0007) || (Prm.Testpassword == 3322) )
	{
	    ;
	}
	else
	{
        if( StatusWord.f.OperationEnable )
        {
            Prm.b_prm0_1 |= 0x0001;                                     /* 伺服使能 ON              */
        }
        else
        {
            Prm.b_prm0_1 &= 0xFFFE;                                     /* 伺服 OFF                 */
        }
	}
    /*----------------------------------------------------------------------------------------------*/
    /*                                警报复位清除                                                  */
    /*----------------------------------------------------------------------------------------------*/
    ErrRstStatus &= 0x03;
    ErrRstStatus = ErrRstStatus << 1;
    if( ControlWord.f.FaultReset || DIDOVar.DISt.AlmReset )
        ErrRstStatus |= 0x01;
    
    if( ErrRstStatus == 0x01)                                           /* 故障清除                 */
    {

        //清 Er.810 故障
#ifdef CPU1
        if( (Prm.absEncuse & 0x00F0) == 0x0000 && ((EtherCATErrorAddCode == 0x0810) ||  (EtherCATErrorAddCode == 0x0830) \
            || (EtherCATErrorAddCode == 0x0860) || (EtherCATErrorAddCode == 0x0C21) || (EtherCATErrorAddCode == 0x0820) \
            || (EtherCATErrorAddCode == 0x0840)))
        {
            Prm.EncErrClr = 1;
        }
#endif

        KpiResetAlarmTable();
        DIDOVar.DISt.AlmReset = 0;
    }
    if(ControlWord.f.SoftReset == 0x1 && Alm.f.AlmFlag )               //软复位
    {
        Prm.password = 0x33AA;
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /* 对象字典【0x6040】 Bit4控制位的沿信号检测处理（避免模式切换时误触发）                        */
    /*----------------------------------------------------------------------------------------------*/
    if( BinV.f.BaseEnable | CoutV.f.Sv.Ot)
    {
        EthPosV.OB6040Bit4Status = EthPosV.OB6040Bit4Status << 1;
        EthPosV.OB6040Bit4Status &= 0x03;
        if( ( u16ControlWord & 0x0010 )  == 0x0010)
        {
            EthPosV.OB6040Bit4Status |= 0x01;
        }
    }
    else
    {
        EthPosV.OB6040Bit4Status = 0x00;
    }
    /*----------------------------------------------------------------------------------------------*/
    
    if( EthPosV.OB6040Bit4Status == 2 )
    {
        OrgControlBit.bit.OrgOkFlag = 0;
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /*  数字量输入信号                                                                              */
    /*----------------------------------------------------------------------------------------------*/
    if( ( Prm.EtherCatType & 0x000F )== 0x0000 )
        u32DigitalInput =  ( BinV.f.Sv.ORGS << 2 ) | (CinV.f.Sv.Pot  << 1 ) | CinV.f.Sv.Not;
    else
        u32DigitalInput =  ( ((ULONG)CinV.f.Sv.EmcyStop) << 25) | 
                             (((ULONG)DIDOVar.DigitStatus.f.SI4) << 17) |
                             (((ULONG)DIDOVar.DigitStatus.f.SI5) << 18) |
                             ( BinV.f.Sv.ORGS << 2 ) | (CinV.f.Sv.Pot  << 1 ) | CinV.f.Sv.Not;
    
    /*----------------------------------------------------------------------------------------------*/
    lkx = DIDOVar.DigitStatusMon.dw;
    
    u32DigitalInput &= 0xFFFF0007;
    
    u32DigitalInput |= (lkx << 15);
    
    /*----------------------------------------------------------------------------------------------*/
    /* 数字量输出信号                                                                               */
    /*----------------------------------------------------------------------------------------------*/
    u32DigitOutput.aEntries[0]  = (1^CoutV.f.Seq.BrkReleasing);
}

/****************************************************************************************************/
/*Function_Name:Eth_Orig_Status                                                         */
/*Description  :EtherCAT 6041 bit15原点回归状态判定                                                       */
/****************************************************************************************************/
void Eth_Orig_Status(void)
{
    if( CAN_EXFUNC1_0_EN )
    {
        if( (Prm.orgstatus & 0x01) == 1)
        {
            u16StatusWord   |= 0x8000;           //找到参考点，bit15置1（Ethercat）
        }
    }
}

