/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                   */
/*											2017 ~													*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		Pos_OrigSearch.c : 原点搜索                          					    	            */
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "Main.h"
#include "Pos_OrigSearch.h"

USHORT DISignReach = 0;                 //原点信号
USHORT PosLimit = 0;                    //正限位信号
USHORT NegLimit = 0;                    //负限位信号

USHORT DISignOld = 0;                   //前一次原点回归信号
USHORT PosLimitOld = 0;                 //前一次正限位信号
USHORT NegLimitOld = 0;                 //前一次负限位信号
USHORT Z_FlgOld = 0;                    //前一次Z信号

USHORT Start_OrgSwitch=0;//判断初始运动时原点开关是否打开20211013
USHORT Flag_OrgSwithEdge=0; //记录开关上升沿  0-正方向上升沿为原点信号   1-负方向上升沿为原点信号
USHORT Flag_Dec=0; //0-不减速  1-减速 20211018

USHORT Flag_High_Low_Dec=0; //20211020
USHORT  Dec_Flag=0;
USHORT  Last_Flag=0;//20211026

USHORT Pulse_Type_High_Low_Dec=0; //20211027

/****************************************************************************************************/
/* 原点回归控制变量表   参见Excel中定义                                                             */
/****************************************************************************************************/
USHORT OrgCtlBitTable[35] =
{/*0      1        2       3      4        5       6      */
0x0003, 0x012E, 0x00E2, 0x0061, 0x0031, 0x002D, 0x007D,   /* 6  */  //0x0003,这个不是控制回零模式1的？
0x20E1, 0x00B1, 0x10F9, 0x30A9, 0x212D, 0x017D, 0x1135,   /* 13 */
0x3165, 0x0003, 0x0003, 0x010E, 0x0082, 0x0001, 0x0011,   /* 20 */
0x000D, 0x001D, 0x2081, 0x0091, 0x1099, 0x3089, 0x210D,   /* 27 */
0x011D, 0x1115, 0x3105, 0x0003, 0x0003, 0x00E4, 0x00A0    /* 34 */
};

//USHORT OrgCtlBitTable[35] =
//{/*0      1        2       3      4        5       6      */
//0x0003, 0x012E, 0x00E2, 0x0061, 0x0031, 0x002D, 0x007D,   /* 6  */
//0x00E1, 0x00B1, 0x00F9, 0x00A9, 0x012D, 0x017D, 0x0135,   /* 13 */
//0x0165, 0x0003, 0x0003, 0x010E, 0x0082, 0x0001, 0x0011,   /* 20 */
//0x000D, 0x001D, 0x0081, 0x0091, 0x0099, 0x0089, 0x010D,   /* 27 */
//0x011D, 0x0115, 0x0105, 0x0003, 0x0003, 0x00E4, 0x00A0    /* 34 */
//};


//USHORT OrgCtlBitTable[35] =
//{/*0      1        2       3      4        5       6      */
//0x0003, 0x012E, 0x0162, 0x0061, 0x0031, 0x002D, 0x007D,   /* 6  */
//0x00E1, 0x00B1, 0x00F9, 0x00A9, 0x00AD, 0x00FD, 0x00B5,   /* 13 */
//0x00E5, 0x0003, 0x0003, 0x010E, 0x0102, 0x0001, 0x0011,   /* 20 */
//0x000D, 0x001D, 0x0081, 0x0091, 0x0099, 0x0089, 0x008D,   /* 27 */
//0x009D, 0x0095, 0x0085, 0x0003, 0x0003, 0x00E4, 0x00A0    /* 34 */
//};

OrgStruct OrgStr = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
OrgStruct OrgStrDefault = {0,0,0,0,0,0,0,0,0,0,0};
union OrgCtlBitUni OrgControlBit = {0U};     //原点回归控制变量
OrgPrSignStr OrgPrCtlBit;
/****************************************************************************************************/
/*Function Name: OrgStartStateCheck(void)                                                           */
/*Description  : 根据原点信号源选择、原点信号到达、信号沿确定原点回归运行状态                       */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void OrgStartStateCheck(void)
{
	Dec_Flag=0;
    
    PosOut = 0;
    /*----------------------------------------------------------------------------------------------*/
    /* 以DI为原点开关处理                                                                           */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgSwithType == DI_SIGN)    
    {
        /*------------------------------------------------------------------------------------------*/
        /* 判断DI信号是否到达  到达情况下直接切换到低速反向找原点状态                               */
        /*------------------------------------------------------------------------------------------*/
      if(DISignReach)
      {        
/*------------------------------------------------------------------------------------------*/
/* 判断初始运行时原点开关为ON时初始运行方向：1、初始运行方向与定义方向相反（原点回归模式9、10、13、14）*/
/*                                                                                 25、26、29、30  */
/*                                        2、初始运行方向与定义方向相同，除以上8种剩余的其他*/
/*------------------------------------------------------------------------------------------*/        
        if(OrgControlBit.bit.OrgStart!=ORG_START_DIR_UNCHANGE)
        {
            if(OrgControlBit.bit.OrgStartDir == POS_DIR)
            {
                OrgControlBit.bit.OrgStartDir=NEG_DIR;
            }
        }

       
          if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS) //以正方向上升沿为原点信号
                Flag_OrgSwithEdge=0;
          else
                Flag_OrgSwithEdge=1;
          
            Start_OrgSwitch=1;  //初始运动时原点开关打开标志位
            OrgStr.OrgStep = ORG_SPDL;
        }
        else                                     //原点信号未到达 切换到高速找原点
        {
            if(OrgControlBit.bit.OrgWarnFlg!=0) //20211018
            {
              Flag_Dec=1;
            }
            
            OrgStr.OrgStep = ORG_SPDH;           //切换到高速
        }       
    }
    /*----------------------------------------------------------------------------------------------*/
    else if(OrgControlBit.bit.OrgSwithType == OV_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 判断原点回归起始方向                                                                     */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgStartDir == POS_DIR)   //正方向
        {
            /*--------------------------------------------------------------------------------------*/
            /* 正方向运行  判断正限位信号是否到达                                                   */
            /*--------------------------------------------------------------------------------------*/
            if(PosLimit == 1)
                OrgStr.OrgStep = ORG_SPDL;       //切换到低速（这是不是该理解为：正限位信号到达时变为低速运行）
            else
                OrgStr.OrgStep = ORG_SPDH;       //切换到高速（这是不是该理解为：正限位信号还没到达时依然以高速运行）
        }
        /*------------------------------------------------------------------------------------------*/
        else
        {
            //负方向 判断负限位信号到达
            if(NegLimit == 1)
                OrgStr.OrgStep = ORG_SPDL;       //切换到低速
            else
                OrgStr.OrgStep = ORG_SPDH;       //切换到高速
        }
        
          if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS) //以正方向上升沿为原点信号
              Flag_OrgSwithEdge=0;
          else
              Flag_OrgSwithEdge=1;
    }
    /*----------------------------------------------------------------------------------------------*/    
    else if(OrgControlBit.bit.OrgSwithType == Z_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
       if(OrgControlBit.bit.Canopen_Pulse == Pulse_Type)                          
            OrgStr.OrgStep = ORG_OFFSET_SEC;
       else
        	OrgStr.OrgStep = ORG_OFFSET;            //直接找Z脉冲的位置
    }
    /*----------------------------------------------------------------------------------------------*/        
    else                                        //选择的原点回归方式不存在
    {
        OrgStr.OrgStep = ORG_FAIL;              //切换到错误状态
        KPI_ALARMSET( ALM_EET_HomeErr );
    }
}

/****************************************************************************************************/
/*Function Name: OrigSearch_ParamUpdate(void)                                                       */
/*Description  : 原点搜索初始化						                                                */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void OrigSearch_ParamUpdate( void )
{
    USHORT OrgType = 0;                                     /* 原点回归类型                         */
    OrgControlBit.bit.OrgDone = 0;                          /* 原点回归完成标志位清零               */
    OrgControlBit.bit.OrgFail = 0;                          /* 原点回归失败标志清零                 */
    
    OrgStr.OrgCmdOutQ15  = 0;
    OrgStr.RemainPulsQ15 = 0;
    ULLONG Kx = 0;
    
    u16StatusWord &= 0xEFFF;                                //6041h的bit12清0
    
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归使能参数初始化 状态过渡到高速原点搜索                                                */
    /* 基于125us规划                                                                                */
    /*----------------------------------------------------------------------------------------------*/
    /* 加减速基值计算                                                                               */
    /*----------------------------------------------------------------------------------------------*/
ULONG MaxAcc;

    if( u32HomingAcc > u32MaxAcc )
    {
        MaxAcc = u32MaxAcc;
    }
    else
    {
        MaxAcc = u32HomingAcc;
    }
    
    Kx = ((ULLONG)MaxAcc << 3) / 15625;
    
    if( Kx == 0 ) Kx = 1;
	OrgStr.OrgAccDecBaseQ15 = Kx;
    /*----------------------------------------------------------------------------------------------*/
    /* 回原点高速速度值给定                                                                         */
    /*----------------------------------------------------------------------------------------------*/
    if( HomingSpeed.aEntries[0] == 0 ) HomingSpeed.aEntries[0] = 1;
    if( HomingSpeed.aEntries[1] == 0 ) HomingSpeed.aEntries[1] = 1;
    
    OrgStr.OrgSpdHQ15 = ( (ULLONG)HomingSpeed.aEntries[0] << 15 ) / 8000; 
    OrgStr.OrgSpdLQ15 = ( (ULLONG)HomingSpeed.aEntries[1] << 15 ) / 8000;

    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归控制参数初始化                                                                        */
    /*----------------------------------------------------------------------------------------------*/
    OrgType = s8HomingMethod;                                   /* 回零方式                         */
    if(OrgType > 35 || OrgType == 0)
    {
        OrgStr.OrgStep = ORG_FAIL;
        KPI_ALARMSET( ALM_EET_HomeErr );
        return;
    }
    if(OrgType == 35)
    {
        OrgStr.OrgStep = ORG_OK;
        return;
    }
    OrgControlBit.all = OrgCtlBitTable[OrgType];
    
    
    /*----------------------------------------------------------------------------------------------*/
    /* 初始化原点回归状态切换                                                                       */
    /*----------------------------------------------------------------------------------------------*/
    OrgStartStateCheck();

}

/****************************************************************************************************/
/*Function Name: HighSpdSearch(void)                                                                */
/*Description  : 高速找原点		                                                                    */
/****************************************************************************************************/
void HighSpdSearch(void)
{
    /*----------------------------------------------------------------------------------------------*/
    /* 判断高速运行方向 确定速度给定正反                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgStartDir == POS_DIR)
    {
        OrgStr.OrgSpdQ15 = OrgStr.OrgSpdHQ15;
    }
    else
    {
        OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdHQ15;
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /* 以DI原点信号做完原点时 查找信号沿                                                                    */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgSwithType == DI_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 正向运行 信号沿检测                                                                           */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgStartDir == POS_DIR)
        {
            /*--------------------------------------------------------------------------------------*/
            /* 信号沿判断   以正方向上升沿为信号沿处理                                                        */
            /*--------------------------------------------------------------------------------------*/
            if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号上升沿判断                                                                     */
                /*----------------------------------------------------------------------------------*/
                if(OrgPrCtlBit.OrgSignUp)
                {
                    OrgStr.OrgStep = ORG_SPDH_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
                Flag_OrgSwithEdge=0; // 0-正方向上升沿为原点信号20211013
            }
            /*--------------------------------------------------------------------------------------*/
            /* 以负方向上升沿为信号沿处理                                                           */
            /*--------------------------------------------------------------------------------------*/
            else
            {
              if(OrgControlBit.bit.Canopen_Pulse != Pulse_Type)
              {
                /*----------------------------------------------------------------------------------*/
                /* DI信号下降沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
                if(OrgPrCtlBit.OrgSignDown)
                {   
                  if(Flag_Dec==1)
                    {
                         OrgStr.OrgStep = ORG_SPDH_SPDL_DEC;
                         OrgStr.OrgSpdQ15 = 0;
                    }
                    else
                    {
                        OrgStr.OrgStep = ORG_SPDH_DEC;
                         OrgStr.OrgSpdQ15 = 0;
                    }
                }
                
                if(OrgPrCtlBit.OrgSignUp)
                {   
                  if(Flag_Dec==1)
                    {
                         OrgStr.OrgStep = ORG_SPDH_SPDL_DEC;
                         OrgStr.OrgSpdQ15 = 0;
                    }
                    else
                    {
                        OrgStr.OrgStep = ORG_SPDH_DEC;
                         OrgStr.OrgSpdQ15 = 0;
                    }
                }
                  Flag_OrgSwithEdge=1; // 1-负方向上升沿为原点信号20211013
              }
              else
              {
                if(OrgPrCtlBit.OrgSignUp) 
                {
                   if((Pulse_Type_High_Low_Dec==1)&&(OrgControlBit.bit.OrgSwithEndState == SWITCH_STA_ON))
                   {
                         OrgStr.OrgStep = ORG_SPDH_SPDL_DEC;
                         OrgStr.OrgSpdQ15 = 0;
                         Flag_OrgSwithEdge=1;
                    }
                    else
                    {
                       OrgStr.OrgStep = ORG_SPDH_DEC;
                       OrgStr.OrgSpdQ15 = 0;
                       Flag_OrgSwithEdge=0;
                    }
                 }
              }
            }              
            /*--------------------------------------------------------------------------------------*/
            /* 正向运行碰到限位开关处理                                                             */
            /*--------------------------------------------------------------------------------------*/
            if(PosLimit == 1)
            {
                /*----------------------------------------------------------------------------------*/
                /* 碰得到限位开关报警或是碰到正限位报警，结束原点回归                                  */
                /*----------------------------------------------------------------------------------*/
                if(OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_POT)
                {
                    OrgStr.OrgStep = ORG_FAIL;  //原点回归碰到限位  原点回归失败
                    return;
                }
                /*----------------------------------------------------------------------------------*/
                /* 碰到正限位开关反向，继续找原点                                                     */
                /*----------------------------------------------------------------------------------*/
                else
                {   
                    OrgControlBit.bit.OrgStartDir = NEG_DIR;   //原点回归反向
                    OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdHQ15;     //原点回归速度反向
                    Pulse_Type_High_Low_Dec=1;
					Dec_Flag=0;
                }
            }
        }
        /*------------------------------------------------------------------------------------------*/
        /* 负向运行 信号沿检测                                                                      */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            /*--------------------------------------------------------------------------------------*/
            /* 信号沿判断   以正方向上升沿为信号沿处理                                              */
            /*--------------------------------------------------------------------------------------*/
            if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号下降沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
              if(OrgControlBit.bit.Canopen_Pulse != Pulse_Type)
              {
                if(OrgPrCtlBit.OrgSignUp)  //20211018
                {
                    if(Flag_Dec==1)
                    {
                         OrgStr.OrgStep = ORG_SPDH_SPDL_DEC;
                         OrgStr.OrgSpdQ15 = 0;
                    }
                    else
                    {
                        OrgStr.OrgStep = ORG_SPDH_DEC;
                         OrgStr.OrgSpdQ15 = 0;
                    }
                }

                Flag_OrgSwithEdge=0; // 0-正方向上升沿为原点信号20211013
               }
             else
             {
                 if(OrgPrCtlBit.OrgSignUp)
                 {
                   if((Pulse_Type_High_Low_Dec==1)&&(OrgControlBit.bit.OrgSwithEndState == SWITCH_STA_ON))
                   {
                         OrgStr.OrgStep = ORG_SPDH_SPDL_DEC;
                         OrgStr.OrgSpdQ15 = 0;
                         Flag_OrgSwithEdge=0;
                    }
                    else
                    {
                       OrgStr.OrgStep = ORG_SPDH_DEC;
                       OrgStr.OrgSpdQ15 = 0;
                       Flag_OrgSwithEdge=1;
                    }
                  }
              }
                
            }
            /*--------------------------------------------------------------------------------------*/
            /* 以负方向上升沿为信号沿处理                                                           */
            /*--------------------------------------------------------------------------------------*/
            else
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号上升沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
                if(OrgPrCtlBit.OrgSignDown)
                {
                    OrgStr.OrgStep = ORG_SPDH_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
                if(OrgPrCtlBit.OrgSignUp)
                {
                    OrgStr.OrgStep = ORG_SPDH_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
                Flag_OrgSwithEdge=1; // 1-负方向上升沿为原点信号20211013
            } 
            /*--------------------------------------------------------------------------------------*/
            /* 正向运行碰到限位开关处理 。                                                            */
            /*--------------------------------------------------------------------------------------*/
            if(NegLimit == 1)
            {
                /*----------------------------------------------------------------------------------*/
                /* 碰得到限位开关报警或是碰到负限位报警，结束原点回归                                  */
                /*----------------------------------------------------------------------------------*/
                if(OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_NOT)
                {
                    OrgStr.OrgStep = ORG_FAIL;  //原点回归碰到限位  原点回归失败
//                    KPI_WARNINGSET(WRN_NOT);    //负限位报警
                    return;
                }
                /*----------------------------------------------------------------------------------*/
                /* 碰到限位开关 反向继续找原点                                                      */
                /*----------------------------------------------------------------------------------*/
                else
                {
                    OrgControlBit.bit.OrgStartDir = POS_DIR;   //原点回归反向
                    OrgStr.OrgSpdQ15 = OrgStr.OrgSpdHQ15;      //原点回归速度反向
                    Pulse_Type_High_Low_Dec=1;
					Dec_Flag=0;
                }
            }
        }
    }
    
    /************************************************************************************************/    
    /************************************************************************************************/
    /* 以限位信号作为原点信号                                                                       */
    /************************************************************************************************/
    /************************************************************************************************/
    else if(OrgControlBit.bit.OrgSwithType == OV_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 正方向运行  找正限位开关                                                                 */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgStartDir == POS_DIR)
        {
            /*--------------------------------------------------------------------------------------*/
            /* 判断正限位是否到达                                                                   */
            /*--------------------------------------------------------------------------------------*/
            if(PosLimit == 1)
            {
                OrgStr.OrgStep = ORG_SPDH_DEC;
                OrgStr.OrgSpdQ15 = 0;
            }
            /*--------------------------------------------------------------------------------------*/
            /* 遇到负限位报警，不停机                                                                */
            /*--------------------------------------------------------------------------------------*/
            if(NegLimit == 1)
            {
//                KPI_WARNINGSET(WRN_NOT);                        //负限位报警
            }   
        }
        /*------------------------------------------------------------------------------------------*/
        /* 反向运行  找负限位开关                                                                   */
        /*------------------------------------------------------------------------------------------*/        
        else
        {
            /*--------------------------------------------------------------------------------------*/
            /* 负限位上升沿判断                                                                     */
            /*--------------------------------------------------------------------------------------*/
            if(NegLimit == 1)
            {
                OrgStr.OrgStep = ORG_SPDH_DEC;
                OrgStr.OrgSpdQ15 = 0;
            }
            /*--------------------------------------------------------------------------------------*/
            /* 遇到正限位报警，不停机                                                                */
            /*--------------------------------------------------------------------------------------*/
            if(PosLimit == 1)
            {
//                KPI_WARNINGSET(WRN_POT);                        //正限位报警
            } 
        }
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /*                              正常搜索时脉冲输出计算                                          */
    /*----------------------------------------------------------------------------------------------*/
    
    /*----------------------------------------------------------------------------------------------*/
    /* 正向加速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    if(Dec_Flag==0)
    {
        if( OrgStr.OrgSpdQ15 > 0 )
        {
            OrgStr.OrgCmdOutQ15 += OrgStr.OrgAccDecBaseQ15;
            if( OrgStr.OrgCmdOutQ15 > OrgStr.OrgSpdQ15 )
            {
                OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdQ15;
                Dec_Flag=1;
            }
        }
        /*------------------------------------------------------------------------------------------*/
        /* 反向加速                                                                                 */
        /*------------------------------------------------------------------------------------------*/
        else
        {
               OrgStr.OrgCmdOutQ15 -= OrgStr.OrgAccDecBaseQ15;
               if( OrgStr.OrgCmdOutQ15 < OrgStr.OrgSpdQ15 )
               {
                  OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdQ15;                
                  Dec_Flag=1;
               }
        }
    }
    /*----------------------------------------------------------------------------------------------*/
}

/****************************************************************************************************/
/*Function Name: HighLowSpdDec(void)     //20211018                                                             */
/*Description  : 高速变低速找原点信号进入减速阶段	（用以解决由高速变为低速时，高速速度不是减为0再加速到低速这一问题）                                        */
/****************************************************************************************************/
void HighLowSpdDec(void)   
{
    /*----------------------------------------------------------------------------------------------*/
    /* 正向减速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
   Dec_Flag=0;
   Pulse_Type_High_Low_Dec=0;
   if( OrgStr.OrgCmdOutQ15 > 0 )
    {
        OrgStr.OrgCmdOutQ15 -= OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 < OrgStr.OrgSpdLQ15 )
        {
            OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdLQ15;
            Flag_High_Low_Dec=1;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 反向减速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        OrgStr.OrgCmdOutQ15 += OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 > (-OrgStr.OrgSpdLQ15) )
        {
            OrgStr.OrgCmdOutQ15 = -OrgStr.OrgSpdLQ15;
            Flag_High_Low_Dec=1;
        }
    }
    /*----------------------------------------------------------------------------------------------*/  
    /* 正向减速运行碰到  正方向限位开关处理                                                         */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgStartDir == POS_DIR)
    {
        if(PosLimit == 1 && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_POT)
        {
            OrgStr.OrgStep = ORG_FAIL;
//            KPI_WARNINGSET(WRN_POT);                                    //正限位报警
            return;
        }
    }
    else
    {
        if(NegLimit == 1 && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_NOT)
        {
            OrgStr.OrgStep = ORG_FAIL;
//            KPI_WARNINGSET(WRN_NOT);                                    //负限位报警
            return;
        }
    }
     
    /*----------------------------------------------------------------------------------------------*/  
    /* 进入减速阶段，运动方向保持不变                                                                 */
    /*----------------------------------------------------------------------------------------------*/
         if(Flag_High_Low_Dec==1)
            {
                OrgStr.OrgStep = ORG_SPDL; 
                Flag_High_Low_Dec=0;
            }
  
}

/****************************************************************************************************/
/*Function Name: HighSpdDec(void)                                                                   */
/*Description  : 高速运行搜索到原点信号进入减速阶段(减速到 0 )                                      */
/****************************************************************************************************/
void HighSpdDec(void)
{
LONG KX;

    Dec_Flag=0;
    /*----------------------------------------------------------------------------------------------*/
    /* 正向减速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    if( OrgStr.OrgCmdOutQ15 > 0 )
    {
        OrgStr.OrgCmdOutQ15 -= OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 < 0 )
		{
            OrgStr.OrgCmdOutQ15 = 0;
		}
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 反向减速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    else
    {                
         OrgStr.OrgCmdOutQ15 += OrgStr.OrgAccDecBaseQ15;
         if( OrgStr.OrgCmdOutQ15 > 0 )
		{
             OrgStr.OrgCmdOutQ15 = 0;     
		}    
    }    
    /*----------------------------------------------------------------------------------------------*/  
    /* 正向减速运行碰到  正方向限位开关处理                                                         */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgStartDir == POS_DIR)
    {
        if(PosLimit == 1 && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_POT)
        {
            OrgStr.OrgStep = ORG_FAIL;
//            KPI_WARNINGSET(WRN_POT);                                    //正限位报警
            return;
        }
    }
    else
    {
        if(NegLimit == 1 && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_NOT)
        {
            OrgStr.OrgStep = ORG_FAIL;
//            KPI_WARNINGSET(WRN_NOT);                                    //负限位报警
            return;
        }
    }
    

    /*----------------------------------------------------------------------------------------------*/
    /* 判断速度指令是否为0   为0进入低速运行阶段                                                    */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgStr.OrgCmdOutQ15 == 0)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 减速完成后再切换到低速阶段   防止出现误动作                                              */
        /* 等待定位完成                                                                             */
        /*------------------------------------------------------------------------------------------*/
        KX = MlibAbs32(s32FollowErrActVal);                              /* 求绝对值              */
        KX = KX << 15;  
        
        if( KX < OrgStr.OrgAccDecBaseQ15 && KX < OrgStr.OrgSpdLQ15)
		{
                  OrgStr.OrgStep = ORG_SPDL;                 
		}
    }
}

/****************************************************************************************************/
/*Function Name: LowSpdSearch(void)                                                                 */
/*Description  : 低速阶段查找原点信号                                                               */
/****************************************************************************************************/
void LowSpdSearch(void)
{
/*----------------------------------------------------------------------------------------------*/
/*  如果上一个运动方向和正负上升沿标志位一样，必定反向                                             */
/*----------------------------------------------------------------------------------------------*/
     if(OrgControlBit.bit.OrgStartDir==Flag_OrgSwithEdge) 
      {
          if(OrgControlBit.bit.OrgStartDir == POS_DIR)
              OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdLQ15;
          else
              OrgStr.OrgSpdQ15 = OrgStr.OrgSpdLQ15;
      }
      else
      {
/*---------------------------------------------------------------------------------------------------------------------------------------*/
/*  在OrgStartStateCheck(void)种判断为初始运行时原点开关ON，则直接过渡到低速运行方向，根据在OrgStartStateCheck(void) 判断方向给定速度      */        
/*---------------------------------------------------------------------------------------------------------------------------------------*/
           if(OrgControlBit.bit.OrgStartDir == POS_DIR)
              OrgStr.OrgSpdQ15 = OrgStr.OrgSpdLQ15;
          else
              OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdLQ15;
        } 
               
    /*----------------------------------------------------------------------------------------------*/
    /* 以DI原点信号作为原点时 查找信号沿                                                            */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgSwithType == DI_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 判断原点回归方向  正方向原点回归处理                                                     */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgStartDir == POS_DIR)
        {
            /*--------------------------------------------------------------------------------------*/
            /* 判断原点信号沿方向  正向上升沿处理                                                     */
            /*--------------------------------------------------------------------------------------*/
            if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号下降沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
               if(OrgPrCtlBit.OrgSignUp)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                } 
               
                if(OrgPrCtlBit.OrgSignDown)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }                
            }
            /*--------------------------------------------------------------------------------------*/
            /* 负向上升沿处理                                                                       */
            /*--------------------------------------------------------------------------------------*/
            else
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号上升沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
                if(OrgPrCtlBit.OrgSignUp)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
                
                if(OrgPrCtlBit.OrgSignDown) 
                {
                /*-----------------------------------------------------------------------------------*/
                /* 用以处理存在4种原点信号开关变化的状况，防止触碰到下降沿后直接跳转到找Z的过程//20211013 */
                /*-----------------------------------------------------------------------------------*/                   
                   if((OrgControlBit.bit.On_Off_Four==Switch_Four)&&(Start_OrgSwitch==0))
                   { 
                      OrgStr.OrgStep = ORG_SPDL_DEC_SECOND;
                      OrgStr.OrgSpdQ15 =0;
                      OrgControlBit.bit.On_Off_Four=0;
                   }
                   else
                   {
                      OrgStr.OrgStep = ORG_SPDL_DEC;
                      OrgStr.OrgSpdQ15 = 0;
                   }
                }
            }
        }
        
        /*------------------------------------------------------------------------------------------*/
        /* 负向运行处理                                                                             */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            /*--------------------------------------------------------------------------------------*/
            /* 判断原点信号沿方向  正向上升沿处理                                                   */
            /*--------------------------------------------------------------------------------------*/
            if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号上升沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/                
                
               if(OrgPrCtlBit.OrgSignUp)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                } 
                
               if(OrgPrCtlBit.OrgSignDown) //20211013
                {
                   if((OrgControlBit.bit.On_Off_Four==Switch_Four)&&(Start_OrgSwitch==0))
                   { 
                      OrgStr.OrgStep = ORG_SPDL_DEC_SECOND;
                      OrgStr.OrgSpdQ15 =0;
                      OrgControlBit.bit.On_Off_Four=0;
                   }
                   else
                   {
                      OrgStr.OrgStep = ORG_SPDL_DEC;
                      OrgStr.OrgSpdQ15 = 0;
                   }
                }
                
            }
            /*--------------------------------------------------------------------------------------*/
            /* 负向上升沿处理                                                                       */
            /*--------------------------------------------------------------------------------------*/
            else
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号下降沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
                if(OrgPrCtlBit.OrgSignDown)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
            }
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    else if(OrgControlBit.bit.OrgSwithType == OV_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 运行方向判断  正向运行处理                                                               */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgStartDir == POS_DIR)
        {
          
            if(NegLimit == 1 && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_NOT)
            {
                OrgStr.OrgStep = ORG_FAIL;
//                KPI_WARNINGSET(WRN_NOT);                                    //负限位报警
                return;
            }
            /*--------------------------------------------------------------------------------------*/
            /* 正限位下降沿判断                                                                     */
           /*--------------------------------------------------------------------------------------*/
            if(OrgPrCtlBit.PosLimDown)
            {
                OrgStr.OrgStep = ORG_SPDL_DEC;
                OrgStr.OrgSpdQ15 = 0;
            }
        }
        /*------------------------------------------------------------------------------------------*/
        /* 负方向运行处理                                                                           */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            if(PosLimit == 1 && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_POT)
            {
                OrgStr.OrgStep = ORG_FAIL;
//                KPI_WARNINGSET(WRN_POT);                                    //正限位报警
                return;
            }
            /*--------------------------------------------------------------------------------------*/
            /* 负限位下降沿判断                                                                     */
            /*--------------------------------------------------------------------------------------*/
            if(OrgPrCtlBit.NegLimDown)
            {
                OrgStr.OrgStep = ORG_SPDL_DEC;
                OrgStr.OrgSpdQ15 = 0;
            }
        }
    }
    
    /*----------------------------------------------------------------------------------------------*/
    /* 正向加速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
if(Dec_Flag==0)
{
    if( OrgStr.OrgSpdQ15 > 0 )
    {
        OrgStr.OrgCmdOutQ15 += OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 > OrgStr.OrgSpdQ15 )
        {
            OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdQ15;
            Dec_Flag=1;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 反向加速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        OrgStr.OrgCmdOutQ15 -= OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 < OrgStr.OrgSpdQ15 )
        {
            OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdQ15;
            Dec_Flag=1;
        }
    }
}
    /*----------------------------------------------------------------------------------------------*/
}

/****************************************************************************************************/
/*Function Name: LowSpdDec(void)                                                                    */
/*Description  : 低速减速到0阶段                                                                    */
/****************************************************************************************************/
void LowSpdDec(void)
{
//LONG KX;
  
    Start_OrgSwitch=0;  //20211018
    
    Dec_Flag=0;
    
    if((OrgControlBit.bit.OrgSwithEndState==SWITCH_STA_OFF)&&(Last_Flag==0))
    {      
        OrgStr.OrgStep = ORG_SWITCH_CHECK;
        return;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 正向减速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    if( OrgStr.OrgCmdOutQ15 > 0 )
    {
        OrgStr.OrgCmdOutQ15 -= OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 < 0 )
        {
            OrgStr.OrgCmdOutQ15 = 0;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 反向减速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        OrgStr.OrgCmdOutQ15 += OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 > 0 )
        {
            OrgStr.OrgCmdOutQ15 = 0;
        } 
}
    /*----------------------------------------------------------------------------------------------*/
    /* 正向减速运行碰到  正方向限位开关处理                                                         */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgStartDir == POS_DIR)
    {
        if(NegLimit == 1  && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_NOT)
        {
            OrgStr.OrgStep = ORG_FAIL;
//            KPI_WARNINGSET(WRN_NOT);    //负限位报警
            return;
        }
    }
    else
    {
        if(PosLimit == 1 && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_POT)
        {
            OrgStr.OrgStep = ORG_FAIL;
//            KPI_WARNINGSET(WRN_POT);    //正限位报警
            return;
        }
    }
    
    
    /*----------------------------------------------------------------------------------------------*/
    /* 判断速度指令是否为0   为0进入低速运行阶段                                                    */
    /*----------------------------------------------------------------------------------------------*/
    if((OrgStr.OrgCmdOutQ15 == 0)&&(Dec_Flag==0))
    {
        /*------------------------------------------------------------------------------------------*/
        /* 减速完成后再切换到低速阶段   防止出现误动作                                                */
        /*------------------------------------------------------------------------------------------*/        
        OrgStr.OrgStep = ORG_SWITCH_CHECK;
    }
}

/****************************************************************************************************/
/*Function Name: LowSpdSearch_SECOND(void)                                                          */
/*Description  : 低速阶段查找原点信号（用以解决一些回零模式存在4种原点开关信号变化的情况）                             */
/****************************************************************************************************/
void LowSpdSearch_SECOND(void)
{
     Last_Flag=1;
     
     if(OrgControlBit.bit.OrgStartDir == NEG_DIR)  
     {
          OrgStr.OrgSpdQ15 =OrgStr.OrgSpdLQ15;
     }
     else
     {
          OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdLQ15;
     }
    /*----------------------------------------------------------------------------------------------*/
    /* 以DI原点信号作为原点时 查找信号沿                                                                    */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgSwithType == DI_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 判断原点回归方向  正方向原点回归处理                                                     */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgStartDir == POS_DIR)
        {
            /*--------------------------------------------------------------------------------------*/
            /* 判断原点信号沿方向  正向上升沿处理                                                     */
            /*--------------------------------------------------------------------------------------*/
            if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号下降沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
               if(OrgPrCtlBit.OrgSignUp)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                } 
               if(OrgPrCtlBit.OrgSignDown)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
            }
            /*--------------------------------------------------------------------------------------*/
            /* 负向上升沿处理                                                                       */
            /*--------------------------------------------------------------------------------------*/
            else
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号上升沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
                if(OrgPrCtlBit.OrgSignUp)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
                if(OrgPrCtlBit.OrgSignDown)  //20211013
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
            }
        }
        
        /*------------------------------------------------------------------------------------------*/
        /* 负向运行处理                                                                             */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            /*--------------------------------------------------------------------------------------*/
            /* 判断原点信号沿方向  正向上升沿处理                                                   */
            /*--------------------------------------------------------------------------------------*/
            if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号上升沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
                  if(OrgPrCtlBit.OrgSignUp)
                   {
                       OrgStr.OrgStep = ORG_SPDL_DEC;
                       OrgStr.OrgSpdQ15 = 0;
                     }
                
                
            }
            /*--------------------------------------------------------------------------------------*/
            /* 负向上升沿处理                                                                       */
            /*--------------------------------------------------------------------------------------*/
            else
            {
                /*----------------------------------------------------------------------------------*/
                /* DI信号下降沿判断                                                                 */
                /*----------------------------------------------------------------------------------*/
                if(OrgPrCtlBit.OrgSignDown)
                {
                    OrgStr.OrgStep = ORG_SPDL_DEC;
                    OrgStr.OrgSpdQ15 = 0;
                }
            }
        }
    }
    /*----------------------------------------------------------------------------------------------*/
   
    /*----------------------------------------------------------------------------------------------*/
    /* 正向加速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    if(Dec_Flag==0)
    {
        if( OrgStr.OrgSpdQ15 > 0 )
        {
            OrgStr.OrgCmdOutQ15 += OrgStr.OrgAccDecBaseQ15;
            if( OrgStr.OrgCmdOutQ15 > OrgStr.OrgSpdQ15 )
            {
                OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdQ15;
                Dec_Flag=1;
            }
        }
        /*------------------------------------------------------------------------------------------*/
        /* 反向加速                                                                                 */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            OrgStr.OrgCmdOutQ15 -= OrgStr.OrgAccDecBaseQ15;
            if( OrgStr.OrgCmdOutQ15 < OrgStr.OrgSpdQ15 )
            {
                OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdQ15;
                Dec_Flag=1;
            }
        }
    }    
    /*----------------------------------------------------------------------------------------------*/
}

/****************************************************************************************************/
/*Function Name: LowSpdDec_SECOND(void)                                                             */
/*Description  : 低速减速到0阶段 （用以解决一些回零模式存在4种原点开关信号变化的情况）              */
/****************************************************************************************************/ 
void LowSpdDec_SECOND(void)
{
  LONG KX;
  
    Dec_Flag=0;
    if( OrgStr.OrgCmdOutQ15 > 0 )
     {
        OrgStr.OrgCmdOutQ15 -= OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 < 0 )
            OrgStr.OrgCmdOutQ15 = 0;
      }
    /*----------------------------------------------------------------------------------------------*/
    /* 反向减速                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        OrgStr.OrgCmdOutQ15 += OrgStr.OrgAccDecBaseQ15;
        if( OrgStr.OrgCmdOutQ15 > 0 )
            OrgStr.OrgCmdOutQ15 = 0;
    }  
    /*----------------------------------------------------------------------------------------------*/
    /* 正向减速运行碰到  正方向限位开关处理                                                         */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgStartDir == POS_DIR)
    {
        if(NegLimit == 1  && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_NOT)
        {
            OrgStr.OrgStep = ORG_FAIL;
//            KPI_WARNINGSET(WRN_NOT);    //负限位报警
            return;
        }
    }
    else
    {
        if(PosLimit == 1 && OrgControlBit.bit.OrgWarnFlg != ORG_LIMIT_POT)
        {
            OrgStr.OrgStep = ORG_FAIL;
//            KPI_WARNINGSET(WRN_POT);    //正限位报警
            return;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 判断速度指令是否为0   为0进入低速运行阶段                                                    */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgStr.OrgCmdOutQ15 == 0)
    {
        KX = MlibAbs32(s32FollowErrActVal);                              /* 求绝对值              */
        KX = KX << 15;  
        if( KX < OrgStr.OrgAccDecBaseQ15 && KX < OrgStr.OrgSpdLQ15)
        OrgStr.OrgStep = ORG_SPDL_SECOND; 
    }
}

/****************************************************************************************************/
/*Function Name: OrgSwitchDirCheck(void)                                                            */
/*Description  : 根据当前原点信号的状态 判断是否切换状态                                            */
/****************************************************************************************************/
void OrgSwitchDirCheck(void)
{
    Last_Flag=0;
  
    if(OrgControlBit.bit.OrgSwithType == DI_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 判断原点回归方向                                                                         */
        /*------------------------------------------------------------------------------------------*/
       if(OrgControlBit.bit.OrgStartDir == POS_DIR)  //正向
        {
            /*--------------------------------------------------------------------------------------*/
            /* 判断期望原点开关状态                                                                 */
            /*--------------------------------------------------------------------------------------*/
            if(OrgControlBit.bit.OrgSwithEndState == SWITCH_STA_ON)
            {
                /*----------------------------------------------------------------------------------*/
                /* 判断当前原点开关状态                                                             */
                /*----------------------------------------------------------------------------------*/
                  if(DISignReach == 1)
                  {
                      if(OrgControlBit.bit.Canopen_Pulse == Pulse_Type)
                      {
                         if(OrgControlBit.bit.OrgZEndFlg == ORG_Z_YES)
                         {
                              OrgStr.OrgStep = ORG_OFFSET_SEC;
                         }
                         else
                         {
                            OrgStr.OrgStep = ORG_OFFSET;
                         }
                      }
                    else
                      {
                        OrgStr.OrgStep = ORG_OFFSET;
                        OrgStr.OrgCmdOutQ15 = 0;
                     }
                    }
                /*----------------------------------------------------------------------------------*/
                /* 判断原点信号沿方向                                                               */
                /*----------------------------------------------------------------------------------*/
                  else
                  {           
                        if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
                        {
                            OrgStr.OrgSpdQ15 = OrgStr.OrgSpdLQ15;    //正向沿正转
                        }
                        else
                        {
                            OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdLQ15;     //负向沿反转
                        }
                   }

            }
            /*--------------------------------------------------------------------------------------*/
            else if(OrgControlBit.bit.OrgSwithEndState == SWITCH_STA_OFF)
            {
                //判断当前原点开关状态
                if(DISignReach == 1)
                {
                    //判断原点信号沿方向
                    if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
                    {
                        OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdLQ15;    //正向沿反转
                    }
                    else
                    {
                        OrgStr.OrgSpdQ15 = OrgStr.OrgSpdLQ15;     //负向沿正转
                    }
                }
                else
                {
                    OrgStr.OrgStep = ORG_OFFSET;
                    OrgStr.OrgCmdOutQ15 = 0;
                }
            }
        }
        else if(OrgControlBit.bit.OrgStartDir == NEG_DIR)  //反向
        {
            //判断期望原点开关状态
            if(OrgControlBit.bit.OrgSwithEndState == SWITCH_STA_ON)
            {
                //判断当前原点开关状态
                if(DISignReach == 1)
                {
                      if(OrgControlBit.bit.Canopen_Pulse == Pulse_Type)
                      {
                         if(OrgControlBit.bit.OrgZEndFlg == ORG_Z_YES)
                         {
                               OrgStr.OrgStep = ORG_OFFSET_SEC;
                         }
                         else
                         {
                            OrgStr.OrgStep = ORG_OFFSET;
                         }
                      }
                    else
                      {
                        OrgStr.OrgStep = ORG_OFFSET;
                        OrgStr.OrgCmdOutQ15 = 0;
                     }
                }
                else
                {
                    //判断原点信号沿方向
                    if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
                    {
                        OrgStr.OrgSpdQ15 = OrgStr.OrgSpdLQ15;     //正向沿正转
                    }
                    else
                    {
                        OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdLQ15;     //负向沿反转
                    }
                }
            }
            else if(OrgControlBit.bit.OrgSwithEndState == SWITCH_STA_OFF)
            {
                //判断当前原点开关状态
                if(DISignReach == 1)
                {
                    //判断原点信号沿方向
                    if(OrgControlBit.bit.OrgSwithEdge == SWITCH_EDGE_POS)
                    {
                        OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdLQ15;    //正向沿反转
                    }
                    else
                    {
                        OrgStr.OrgSpdQ15 = OrgStr.OrgSpdLQ15;     //负向沿正转
                    }
                }
                else
                {
                    OrgStr.OrgStep = ORG_OFFSET;
                    OrgStr.OrgCmdOutQ15 = 0;
                }
            }
        }
       
      }
    /*----------------------------------------------------------------------------------------------*/
    /* 限位信号开关状态检测                                                                         */
    /*----------------------------------------------------------------------------------------------*/
    else if(OrgControlBit.bit.OrgSwithType == OV_SIGN)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 正方向运行检测正限位                                                                     */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgStartDir == POS_DIR)
        {
            if(PosLimit == 1)
			{
              OrgStr.OrgSpdQ15 = -OrgStr.OrgSpdLQ15;
			}
            else
            {
                if(OrgControlBit.bit.Canopen_Pulse == Pulse_Type)
                {
                   if(OrgControlBit.bit.OrgZEndFlg == ORG_Z_YES)
					{
                             
						OrgStr.OrgStep = ORG_OFFSET_SEC;
                    }
                    else
                    {
                        OrgStr.OrgStep = ORG_OFFSET;
                    }
                  }
                else
                {
                        OrgStr.OrgStep = ORG_OFFSET;
                        OrgStr.OrgCmdOutQ15 = 0;
                 }
            }   
        }
        /*------------------------------------------------------------------------------------------*/
        /* 负方向运行检测负限位                                                                     */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            if(NegLimit == 1)
                OrgStr.OrgSpdQ15 = OrgStr.OrgSpdLQ15;
            else
            {
                if(OrgControlBit.bit.Canopen_Pulse == Pulse_Type)
                {
					if(OrgControlBit.bit.OrgZEndFlg == ORG_Z_YES)
					{
						OrgStr.OrgStep = ORG_OFFSET_SEC;
					}
					else
					{
						OrgStr.OrgStep = ORG_OFFSET;
					}
				}
				else
				{
                     OrgStr.OrgStep = ORG_OFFSET;
                     OrgStr.OrgCmdOutQ15 = 0;
				}
            }    
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 不以DI为原点开关情况下直接切换到OFFSET状态机                                                 */
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        OrgStr.OrgStep = ORG_OFFSET;
        OrgStr.OrgCmdOutQ15 = 0;
    }

/*----------------------------------------------------------------------------------------------*/
/* 在这一阶段设置加速，改变以前的速度突变没有加速这一过程     20211026                                                                  */
/*----------------------------------------------------------------------------------------------*/
	if(Dec_Flag==0)
	{
	    if( OrgStr.OrgSpdQ15 > 0 )
	    {
	        OrgStr.OrgCmdOutQ15 += OrgStr.OrgAccDecBaseQ15;
	        if( OrgStr.OrgCmdOutQ15 > OrgStr.OrgSpdQ15 )
	        {
	            OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdQ15;
	            Dec_Flag=1;
	        }
	    }
	    /*----------------------------------------------------------------------------------------------*/
	    /* 反向加速                                                                                     */
	    /*----------------------------------------------------------------------------------------------*/
	    else
	    {
	        OrgStr.OrgCmdOutQ15 -= OrgStr.OrgAccDecBaseQ15;
	        if( OrgStr.OrgCmdOutQ15 < OrgStr.OrgSpdQ15 )
	        {
				OrgStr.OrgCmdOutQ15 = OrgStr.OrgSpdQ15; 
	            Dec_Flag=1;
	        }
	    }
	}
 }

/****************************************************************************************************/
/*Function Name: OrgZeroPosDeal(void)        ORG_OFFSET                                                       */
/*Description  : 根据当前原点信号的状态 判断是否切换状态                                              */
/****************************************************************************************************/
LLONG OrgPosOffset = 0;                         /* 原点偏置值                                        */
void OrgZeroPosDeal(void)
{
    LONG ZposDelta = 0;                         /* Z脉冲移动距离计算值                               */
    LONG AmonPosErratemp=0;                    //位置偏差                                         
    /*----------------------------------------------------------------------------------------------*/
#if 0
    OrgPosOffset = s32HomeOffset;               /* 偏置脉冲                                         */
#else
    OrgPosOffset = 0;
#endif
//    OrgPosOffset -= s32FollowErrActVal;
    /*-----------------------------------判断找Z的速度-----------------------------------------------*/
    if(!OrgPosOffset)
    {
        if(OrgControlBit.bit.OrgSwithType == Z_SIGN)        // 问题点
        {
            ZeroRunSpeed = SpeedLow;
        }
        if(OrgControlBit.bit.OrgZEndFlg == 1)        // 问题点  20230830
        {
            ZeroRunSpeed = SpeedLow;
        }
    }
    else
    {
        ZeroRunSpeed = SpeedHigh;       //原点偏置不为0，最后高速运行到偏置点
    }
    /*----------------------------------------------------------------------------------------------*/
    /* Z脉冲位置计算                                                                                 */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgZEndFlg == ORG_Z_YES)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 正方向找第一个Z脉冲为原点                                                                  */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgZPulseDir == ORG_Z_DIR_POS)
        {
            if(Kprm.f.FencUseFlag)
                ZposDelta = MencP.PulseNo - (LONG)RoutV.ABSEncSValue;
            else
                ZposDelta = (FencP.MotPulseNo - (LONG)FencV.FencAbsPos) * Iprm.sfgear.b / Iprm.sfgear.a;

        }
        /*------------------------------------------------------------------------------------------*/
        /* 反向找原点时  反方向找第一个脉冲                                                           */
        /*------------------------------------------------------------------------------------------*/
        else if( OrgControlBit.bit.OrgZPulseDir == ORG_Z_DIR_NEG )
        {
            if(Kprm.f.FencUseFlag)
                ZposDelta = -(LONG)RoutV.ABSEncSValue;
            else
                ZposDelta = - (LONG)FencV.FencAbsPos * Iprm.sfgear.b / Iprm.sfgear.a ;
        }
        
        ZposDelta = (INT64)ZposDelta * Iprm.Egear.a / Iprm.Egear.b;
        
    }
    /*----------------------------------------------------------------------------------------------*/
    else if(OrgControlBit.bit.OrgZEndFlg == ORG_Z_NO)
    {
        ZposDelta = 0;
    }
    
    if((OrgPosOffset!=0)||(OrgControlBit.bit.OrgZEndFlg == ORG_Z_YES))
    {
        /*------------------------------------------------------------------------------------------*/
        /* 需要走的位置总量计算,需去掉脉冲偏差;脉冲偏差和Z脉冲距离都需要经过电子齿轮比处理          */
        /*------------------------------------------------------------------------------------------*/
        AmonPosErratemp = (LLONG)PosMngV.PosErrA.per32s * PositionFactor.aEntries[1] / PositionFactor.aEntries[0];
        ZposDelta       = (LLONG)ZposDelta * PositionFactor.aEntries[1] / PositionFactor.aEntries[0] ;
        if(Iprm.f.RvsDir == FALSE)
        {
            OrgPosOffset = OrgPosOffset + ZposDelta - AmonPosErratemp;
        }
        else
        {
            OrgPosOffset = OrgPosOffset - ZposDelta - AmonPosErratemp;
        }
        /*------------------------------------------------------------------------------------------*/    
        OrgStr.OrgStep = ORG_CmdGen;
    }
    else
    {
        OrgStr.OrgStep = ORG_OK;
    }
}

/****************************************************************************************************/
/*Function Name: OrgOKDeal(void)                                                                    */
/*Description  : 原点回归完成 参数清零                                                              */
/****************************************************************************************************/
void OrgOKDeal(void)
{
INT64 PosError = 0;
    /*----------------------------------------------------------------------------------------------*/
    /* 位置偏差的计算                                                                               */
    /*----------------------------------------------------------------------------------------------*/
    PosError = (INT64)PosMngV.PosErrA.per32s * Iprm.Egear.b / Iprm.Egear.a;
    PosError = PosError >= 0 ? PosError : -PosError;
    
    /*----------------------------------------------------------------------------------------------*/
    if( Iprm.f.MulTSingT == 1 )
    {
        /*------------------------------------------------------------------------------------------*/
        /* 单圈编码器(非绝对值)                                                                     */
        /*------------------------------------------------------------------------------------------*/
        OrgStr.OrgCmdOutQ15                 = 0;                //防止继续发送指令
#if 0
        if(BoutV.f.Ctrl.Coin)
#else
        if( PosError <= 5 )   
#endif
        {
                OrgStr                      = OrgStrDefault;
                OrgControlBit.bit.OrgDone   = 1;   
                OrgControlBit.bit.OrgOkFlag = 1;
                ODDatArr[Status_Word].all  |= 0x9000;           //找到参考点，bit15置1（Canopen）
                u16StatusWord              |= 0x9000;           //找到参考点，bit15置1（Ethercat）     
        }
    }
    else
    {
        /*------------------------------------------------------------------------------------------*/
        /* 多圈编码器(绝对值)                                                                       */
        /*------------------------------------------------------------------------------------------*/
        OrgStr.OrgCmdOutQ15                 = 0;                //防止继续发送指令
        if( PosError <= 5 )
        {
                OrgStr                      = OrgStrDefault;
                OrgControlBit.bit.OrgDone   = 1;
                OrgControlBit.bit.OrgOkFlag = 1;
                ODDatArr[Status_Word].all  |= 0x9000;           //找到参考点，bit15置1（Canopen）
                u16StatusWord              |= 0x9000;           //找到参考点，bit15置1（Ethercat）
        }    
    }
}

/****************************************************************************************************/
/*Function Name: OrgZeroRun(void)                                                                   */
/*Description  : 运行到零点位置      ORG_CmdGen                                                     */
/****************************************************************************************************/
LLONG PosOut = 0;          //脉冲输出值
void OrgZeroRun( void )
{
    Dec_Flag=0;  
  
    INT64 PosRem = 0;      //剩余脉冲值
    INT64 PosSpdOut = 0;   //位置指令速度输出
    
    /*----------------------------------------------------------------------------------------------*/
    /* 剩余脉冲计算                                                                                 */
    /*----------------------------------------------------------------------------------------------*/
    PosRem = (OrgPosOffset<<15) - PosOut;
    
    /*----------------------------------------------------------------------------------------------*/
    /* 剩余脉冲正负判断                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    if(PosRem < 0)
    {
        PosRem = -PosRem;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 判断是否发送完成                                                                              */
    /*----------------------------------------------------------------------------------------------*/
    //判断是否完成
    switch(ZeroRunSpeed)
    {
    case SpeedHigh:
        {
            if(PosRem <= OrgStr.OrgSpdHQ15)
            {
                OrgStr.OrgCmdOutQ15 = (OrgPosOffset<<15) - PosOut;
                //状态切换
                OrgStr.OrgStep = ORG_OK;
                //变量清零
                PosOut = 0;
            }
            else
            {
                //判断目标速度正负
                if(OrgPosOffset < 0)
                    PosSpdOut = -OrgStr.OrgSpdHQ15;
                else
                    PosSpdOut = OrgStr.OrgSpdHQ15;
                //输出脉冲统计
                PosOut += PosSpdOut;
                //脉冲输出
                OrgStr.OrgCmdOutQ15 = PosSpdOut;
            }
            break;
        }   
    case SpeedLow:
        {
            if(PosRem <= OrgStr.OrgSpdLQ15)
            {
                OrgStr.OrgCmdOutQ15 = (OrgPosOffset<<15) - PosOut;
                //状态切换
                OrgStr.OrgStep = ORG_OK;
                //变量清零
                PosOut = 0;
            }
            else
            {
                //判断目标速度正负
                if(OrgPosOffset < 0)
                    PosSpdOut = -OrgStr.OrgSpdLQ15;
                else
                    PosSpdOut = OrgStr.OrgSpdLQ15;
                //输出脉冲统计
                PosOut += PosSpdOut;
                //脉冲输出
                OrgStr.OrgCmdOutQ15 = PosSpdOut;
            }
            break;
        }
       default:
          break;
    }
}

/****************************************************************************************************/
/*Function Name: OrgFailDeal(void)                                                                  */
/*Description  : 原点回归失败后，如果错误清楚，则重新进行原点回归                                   */
/****************************************************************************************************/
void OrgFailDeal(void)
{
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归失败报警                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    OrgControlBit.bit.OrgFail = 1;
    
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归使能关断                                                                             */
    /*----------------------------------------------------------------------------------------------*/
//    CinV.f.Sv.OTCheck = 0;
    
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归控制清零                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    OrgStr = OrgStrDefault;

}

/****************************************************************************************************/
/*函数名称：OrgStateMachine()原点回归状态机                                                         */
/*函数功能：原点回归不同状态间切换                                                                  */
/****************************************************************************************************/
void OrgStateMachine(void)
{
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归状态机执行                                                                           */
    /*----------------------------------------------------------------------------------------------*/
    switch(OrgStr.OrgStep)
    {
        /*------------------------------------------------------------------------------------------*/
        case ORG_SPDH:                                          /* 高速搜索原点                     */
            HighSpdSearch();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_SPDH_DEC:                                      /* 高速减速                         */
            HighSpdDec();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_SPDL:                                          /* 低速搜索原点                     */
            LowSpdSearch();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_SPDL_DEC:                                      /* 低速减速                         */
            LowSpdDec();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_SWITCH_CHECK:                                  /* 状态判断                         */
            OrgSwitchDirCheck();
        break;
        case ORG_SPDL_SECOND:                                   /* 低速搜索原点                     */
            LowSpdSearch_SECOND();
        break;
        
        case ORG_SPDL_DEC_SECOND:                               /* 低速减速                         */
            LowSpdDec_SECOND();
        break;
        case ORG_SPDH_SPDL_DEC:                                 /* 高速减速                         */
            HighLowSpdDec();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_OFFSET:                                        /* 从原点运行到零点位置             */
            OrgZeroPosDeal();
        break;
        case ORG_CmdGen:
            OrgZeroRun();
        break;    
        /*------------------------------------------------------------------------------------------*/
        case ORG_OK:                                            /* 原点回归完成 参数清零            */
            OrgOKDeal();
        break;
        case ORG_FAIL:                                          /* 原点回归失败                     */
            OrgFailDeal();
        default:
            break;
    }
}

/****************************************************************************************************/
/*Function Name: OrigSearch_Deal(void)                                                              */
/*Description  : 原点搜索相关处理   						                                        */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
LONG OrigSearch_Deal( void )
{
    /*----------------------------------------------------------------------------------------------*/
    /* 判断原点回归是否完成,完成则结束处理                                                          */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgDone == 1)
    {
        u16StatusWord |= 0x1000;                                        //原点回归已完成，bit12置1
        return 0;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归状态执行                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    OrgStateMachine();
    /*----------------------------------------------------------------------------------------------*/
    /* 脉冲指令输出计算                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    OrgStr.OrgCmdOut        = (OrgStr.OrgCmdOutQ15 + OrgStr.RemainPulsQ15) >> 15;
    OrgStr.RemainPulsQ15    = OrgStr.OrgCmdOutQ15 + OrgStr.RemainPulsQ15 - (OrgStr.OrgCmdOut << 15);

    return OrgStr.OrgCmdOut;
}

UCHAR OrgEEPResetFlg = 0;
/****************************************************************************************************/
/*Function Name: OrgStatusEEPReset                                                             */
/*Description  : 原点回归完成状态EEPROM存储执行   						                                        */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void OrgStatusEEPReset(void)
{
    if( CAN_EXFUNC1_0_EN )
    {
        if(OrgEEPResetFlg == 0)
        {
            OrgEEPResetFlg = 1;
            Prm.orgstatus = 0;
            EnccodeStep = 40;
        }
    }
}




