/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                   */
/*											2017 ~													*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		Pos_PosCurveGenerator.c : 位置曲线生成                          					    	*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "Main.h"


#define INCPOS_I        0                      /*   正向加速 1象限加速运行                          */
#define DECPOS_I        1                      /*   正向减速 1象限减速运行                          */
#define INCNEG_IV       2                      /*   反向加速 4象限加速运行                          */
#define DECNEG_IV       3                      /*   反向减速 4象限减速运行                          */
#define DEC_I_INC_IVC   4                      /*   正向向负向转换 1象限运到到4象限                 */
#define DEC_IV_INC_I    5                      /*   负向向正向转换  4象限运到到1象限                */


POSCURVEGENERATOR_P PosCurvP;                                    /* 位置曲线规划曲线                */
POSCURVEGENERATOR_V PosCurvV;                                    /* 位置曲线规划曲线                */


/****************************************************************************************************/
/*Function Name: EthercatPosUpdate(void)                                                            */
/*Description  : EtherCAT 相关位置指令更新						                                    */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void EthercatPosParameterUpdate( void )
{
ULONG AccTmp;
ULONG DecTmp;
    /*----------------------------------------------------------------------------------------------*/
    /* 位置控制最大速度(p/s)   对象字典:  6081h                                                     */
    /*----------------------------------------------------------------------------------------------*/
    /*                6081 × 6091                                                                   */
    /* Speed(rpm) = --------------- × 60                                                            */
    /*                编码器分辨率                                                                  */
    /*----------------------------------------------------------------------------------------------*/
    /* 速度单位转换成脉冲单位                                                                       */
    /*               Speed(rpm) × 编码器分辨率                                                      */
    /* Speed(pps) = ---------------------------                                                     */
    /*                          60                                                                  */
    /*----------------------------------------------------------------------------------------------*/
    /* 简化后可以得到:                                                                              */
    /*                6081h × 6091h-1                                                               */
    /* Speed(pps) = -------------------------                                                       */
    /*                  6091h-2                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    /* 需要将Speed(pps)转换成执行周期内脉冲数,执行周期为125us,则相应系数为:                         */
    /*           Speed(PPS) × 125            Speed(PPS)                                             */
    /* P/SCAN = ------------------------ = ------------                                             */
    /*           1000 × 1000   (S--->us)        8000                                                */
    /* 脉冲格式转换成Q15格式,于是有:                                                                */
    /*      2^15        2^9                                                                         */
    /*   ---------- = ------                                                                        */
    /*      8000        125                                                                         */
    /*----------------------------------------------------------------------------------------------*/
    PosCurvP.ProfRefSpdQ15 = (INT64)u32ProfileVel *  512 / 125;
 
    /*----------------------------------------------------------------------------------------------*/
    /* 位置控制轮廓加速时间   对象字典:  【0x6083】                                                 */
    /*----------------------------------------------------------------------------------------------*/
    /* 单位为 PPS,转换成扫描周期内脉冲数                                                            */
    /*        ACCP × 125 us                                                                         */
    /* ACC = --------------                                                                         */
    /*        1000 × 1000  (s -->us)                                                                */
    /* 转换成脉冲Q15格式,于是简化有:                                                                */
    /*    125 × 2^15        2^15      512                                                           */
    /* = -------------- = -------- = -----                                                          */
    /*     1000 × 1000      8000      125                                                           */
    /*----------------------------------------------------------------------------------------------*/
    /* 轮廓位置模式加速度限制处理                                                                   */
    /*----------------------------------------------------------------------------------------------*/
    if( u32ProfileAcc > u32MaxAcc )
    {
        AccTmp = u32MaxAcc;
    }
    else
    {
        AccTmp = u32ProfileAcc;
    }
    /*----------------------------------------------------------------------------------------------*/    
    if( u32ProfileDec > u32MaxDec )
    {
        DecTmp = u32MaxDec;
    }
    else
    {
        DecTmp = u32ProfileDec;
    }
    /*----------------------------------------------------------------------------------------------*/
    PosCurvP.AccBaseQ15 = (INT64)AccTmp * 8 / 15625;
    if(PosCurvP.AccBaseQ15 <= 1)
    {
        PosCurvP.AccBaseQ15 = 1;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 位置控制轮廓减速时间   对象字典:  【0x6084】                                                 */
    /*----------------------------------------------------------------------------------------------*/
    PosCurvP.DecBaseQ15 = (INT64)DecTmp * 8 / 15625;    
    if(PosCurvP.DecBaseQ15 <= 1)
    {
	        PosCurvP.DecBaseQ15 = 1;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 目标位置赋值                                                                                 */
    /*----------------------------------------------------------------------------------------------*/
    PosCurvV.PosRemain += PosCurvP.TargetPos;
    PosCurvV.PosSumIn  += PosCurvP.TargetPos;
    
    PosCurvV.TargetReach = 0;
}


/****************************************************************************************************/
/*Function Name: PosCurGenerator_Clear( void )                                                      */
/*Description  : EtherCAT 相关变量清零						                                        */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void PosCurGenerator_Clear( void )
{
    PosCurvV.PosRemain = 0;
    PosCurvV.PosSumIn  = 0;
    PosCurvV.PosSumOut = 0;
    PosCurvV.SpdOutQ15 = 0;
    PosCurvV.PosBlock  = 0;
    PosCurvV.PosCmdOut = 0;
    PosCurvV.PosCmdABS = 0;
}

/****************************************************************************************************/
/*Function Name: PosCaseJug(void)                                                                   */						
/*Description  : 6种定位运行情况						                                            */
/*Attention    : 										                                            */ 
/*                                                                                                  */
/*  1、起始速度为正 目标速度大于起始速度  第I象限加速运行                           INCPOS_I        */
/*  2、起始速度为正 目标速度小于起始速度大于0  第I象限减速运行                      DECPOS_I        */
/*  3、起始速度为负 目标速度小于起始速度  第IV象限加速运行                          INCPOS_IV       */
/*  4、起始速度为负 目标速度大于起始速度小于  第IV象限减速运行                      DECPOS_IV       */
/*  5、起始速度为正 目标速度小于0  第I象限减速运行到0，然后再第IV象限加速运行       DEC_I_INC_IVC   */
/*  6、起始速度为负 目标速度大于0  第IV象限减速运行到0，然后再第I象限加速运行       DEC_IV_INC_I    */
/****************************************************************************************************/
void PosQuadrantJudge(void)
{
    /*----------------------------------------------------------------------------------------------*/
    /* 根据脉冲余量的正负 判断目标速度最大值以及正反方向                                            */
    /*----------------------------------------------------------------------------------------------*/
    if(PosCurvV.PosRemain >=0)
        PosCurvV.ProfRefMaxSpdQ15 = PosCurvP.ProfRefSpdQ15;
    else
        PosCurvV.ProfRefMaxSpdQ15 = -PosCurvP.ProfRefSpdQ15;
    
    /*----------------------------------------------------------------------------------------------*/
    /* 正向运行情况判断                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    if(PosCurvV.SpdOutQ15 > 0)                                 /* 实际运行速度大于 0                */
    {
        /*------------------------------------------------------------------------------------------*/
        if(PosCurvV.ProfRefMaxSpdQ15 > 0)                      /* 目标转速大于0                     */
        {
            if(PosCurvV.SpdOutQ15 < PosCurvV.ProfRefMaxSpdQ15)/* 实际速度小于定位速度,1象限加速运行*/
                PosCurvV.PosCase = INCPOS_I;
            else                                               /* 实际速度大于定位速度  1象限减速   */
                PosCurvV.PosCase = DECPOS_I;
        }
        /*------------------------------------------------------------------------------------------*/
        else if(PosCurvV.ProfRefMaxSpdQ15 < 0)                 /*定位速度小于0判断                  */
            PosCurvV.PosCase = DEC_I_INC_IVC;                  /* 1象限减速 4象限加速               */
        /*------------------------------------------------------------------------------------------*/
        else                                                   /* 定位速度等于0 判断                */
            PosCurvV.PosCase = DECPOS_I;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 负向运行情况判断                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    else if(PosCurvV.SpdOutQ15 < 0)                           /* 实际速度小于0情况                  */
    {
        if( PosCurvV.ProfRefMaxSpdQ15 > 0 )                   /* 目标定位速度大于0                  */
            PosCurvV.PosCase = DEC_IV_INC_I;                  /* 4象限减速  1象限加速               */
        else if( PosCurvV.ProfRefMaxSpdQ15 < 0 )              /* 定位速度小于 0                     */
        {
            if(PosCurvV.SpdOutQ15 > PosCurvV.ProfRefMaxSpdQ15)/* 实际速度大于目标定位速度          */
                PosCurvV.PosCase = INCNEG_IV;                 /* 4象限加速                          */
            else                                              /*实际速度小于目标定位速度            */
                PosCurvV.PosCase = DECNEG_IV;                 /* 4象限减速                          */
        }
        else                                                  /* 定位速度等于 0                     */
            PosCurvV.PosCase = DECNEG_IV;                     /* 4象限减速                          */
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 静止运行情况判断                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    else 
    {
        if( PosCurvV.ProfRefMaxSpdQ15 > 0 )                  /* 定位速度大于0                       */
            PosCurvV.PosCase = INCPOS_I;                     /* 第1象限加速                         */
        else
            PosCurvV.PosCase = INCNEG_IV;                    /* 第4象限加速                         */
    }
}

/****************************************************************************************************/
/*Function Name: DecPosCal                                                                          */
/*Description  : 根据当前速度值和减速基值计算减速点位置值                                           */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
LLONG DecPosCal(LLONG SpdOutQ15)
{
LLONG DecTimes      = 0;                                     /* 减速时间                            */
LLONG Remains       = 0;                                     /* 除法计算余数                        */
LLONG TurnPosQ15    = 0;                                     /* 减速点转折位置Q15格式               */

    DecTimes = SpdOutQ15 / PosCurvP.DecBaseQ15;              /* 减速次数计算                        */
    
    Remains = SpdOutQ15 - PosCurvP.DecBaseQ15 * DecTimes;    /* 余数计算                            */
    
    /*----------------------------------------------------------------------------------------------*/
    /* 减速点转折位置计算                                                                           */
    /*----------------------------------------------------------------------------------------------*/
    TurnPosQ15 = ((LLONG)DecTimes * (DecTimes+1) * PosCurvP.DecBaseQ15 >> 1 ) + Remains * ( DecTimes+1 );

    return TurnPosQ15;
}

/****************************************************************************************************/
/*Function Name: PosQuadrantINC                                                                     */
/*Description  : 位置指令各个象限处理     				                                            */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void PosQuadrantINC(void)
{
LLONG PosRemainABS;
INT64 TempT = 0;                                                         /* 减速次数临时变量         */

    if( PosCurvV.PosRemain >= 0)
        PosRemainABS = PosCurvV.PosRemain << 15;                        /* 剩余脉冲计算             */ 
    else
        PosRemainABS = -(PosCurvV.PosRemain << 15);                     /* 剩余脉冲计算             */

    /*----------------------------------------------------------------------------------------------*/
    /* 初次进入  减速点位置值计算                                                                   */
    /*----------------------------------------------------------------------------------------------*/
    if(PosCurvV.PosBlock == 0)
        PosCurvV.TurningPosABS = DecPosCal(PosCurvV.SpdOutABSQ15);
    
    /*----------------------------------------------------------------------------------------------*/
    /* 根据计算的减速点位置值和位置余量值计算运行区间                                               */
    /*----------------------------------------------------------------------------------------------*/
    if((PosRemainABS - PosCurvV.SpdOutABSQ15) >= PosCurvV.TurningPosABS)
    {
        if(PosCurvV.SpdOutABSQ15 < PosCurvV.PosRefSpd)      /*判断输出速度指令是否达到定位速度值    */
            PosCurvV.PosBlock = 1;                          /*速度指令没有达到定位速度   加速运行   */
        else
            PosCurvV.PosBlock = 2;                          /* 速度指令达到定位速度匀速运行         */
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 位置余量小于减速转折速度时    进入减速计算                                                   */
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        /*------------------------------------------------------------------------------------------*/
        /* 第一次进入减速阶段插补位置计算                                                           */
        /*------------------------------------------------------------------------------------------*/
        if(PosCurvV.PosBlock != 3)
        {
            /*--------------------------------------------------------------------------------------*/
            /* 计算按设定减速度减速 需要插补的位置值                                                */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.InsertPosABS = PosRemainABS + PosCurvV.SpdOutABSQ15 - PosCurvV.TurningPosABS;
            
            /*--------------------------------------------------------------------------------------*/
            /* InsertPosABS小于0 减速时间、速度值重新规划                                           */
            /*--------------------------------------------------------------------------------------*/
            if(PosCurvV.InsertPosABS < 0)
            {
                /*----------------------------------------------------------------------------------*/
                /*       1                1                                                         */
                /*  L = --- × a × t^2 = ---- × V × t        (V = a × t)                             */
                /*       2                2                                                         */
                /*----------------------------------------------------------------------------------*/
                TempT = 2 * PosRemainABS / PosCurvV.SpdOutABSQ15 - 1;
                if(TempT <= 0)
                    TempT = 1;
                
                PosCurvP.DecBaseQ15 = PosCurvV.SpdOutABSQ15 / TempT;
                PosCurvV.SpdOutABSQ15 = PosCurvP.DecBaseQ15 * TempT;

                PosCurvV.TurningPosABS = DecPosCal(PosCurvV.SpdOutABSQ15);
                PosCurvV.InsertPosABS = PosRemainABS - PosCurvV.TurningPosABS;

                PosCurvV.SpdOutABSQ15 = PosCurvV.SpdOutABSQ15 + PosCurvP.DecBaseQ15;
              /*------------------------------------------------------------------------------------*/
              /* 进入区域3轨迹规划                                                                  */
              /*------------------------------------------------------------------------------------*/
              PosCurvV.PosBlock = 3;
              //return;
            }
            else
            {
              /*------------------------------------------------------------------------------------*/
              /* 进入区域3轨迹规划                                                                  */
              /*------------------------------------------------------------------------------------*/
              PosCurvV.PosBlock = 3;
            }
            /*--------------------------------------------------------------------------------------*/
            /* 位置重叠计算                                                                         */
            /*--------------------------------------------------------------------------------------*/
#if 0            
            if(ProfPos.OverlapFlg)        //多段位置重叠
            {
              OverlapDeal();
            }
#endif
        }
        /*------------------------------------------------------------------------------------------*/
        /* 判断     当脉冲余量减到0时   定位完成   PosBlock清零                                     */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            if((PosRemainABS == 0)&&(PosCurvV.SpdOutABSQ15 == 0))       /* 剩余脉冲数判断           */
                PosCurvV.PosBlock = 0;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 不同运行区间运行                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    switch(PosCurvV.PosBlock)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 加速运行阶段                                                                             */
        /*------------------------------------------------------------------------------------------*/
        case 1:
        {
            /*--------------------------------------------------------------------------------------*/
            /* 速度指令输出                                                                         */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.SpdOutABSQ15 += PosCurvP.AccBaseQ15;
            
            /*--------------------------------------------------------------------------------------*/
            /* 速度指令输出限定   最大为定位速度                                                    */
            /*--------------------------------------------------------------------------------------*/
            if(PosCurvV.SpdOutABSQ15 > PosCurvV.PosRefSpd)
                PosCurvV.SpdOutABSQ15 = PosCurvV.PosRefSpd;
            
            /*--------------------------------------------------------------------------------------*/
            /* 位置指令输出  由Q15格式转换到Q0格式                                                  */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
            
            /*--------------------------------------------------------------------------------------*/
            /* 减速点位置值计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.TurningPosABS = DecPosCal(PosCurvV.SpdOutABSQ15);
            
            break;
        }
        /*------------------------------------------------------------------------------------------*/
        /* 匀速运行阶段                                                                             */
        /*------------------------------------------------------------------------------------------*/
        case 2:
        {
            /*--------------------------------------------------------------------------------------*/
            /*以定位速度匀速运行                                                                    */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.SpdOutABSQ15 = PosCurvV.PosRefSpd;
            PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
            break;
        }
    
    /*----------------------------------------------------------------------------------------------*/
    /*减速运行阶段                                                                                  */
    /*----------------------------------------------------------------------------------------------*/
    case 3:
    {
        /*------------------------------------------------------------------------------------------*/
        /* 当插补位置大于当前速度值时  插入一个当前速度值                                           */
        /*------------------------------------------------------------------------------------------*/
        if(PosCurvV.InsertPosABS > (PosCurvV.SpdOutABSQ15 - PosCurvP.DecBaseQ15))
        {
            /*--------------------------------------------------------------------------------------*/
            /* 转速为0判断  当速度为0时 输出剩余脉冲数                                              */
            /*--------------------------------------------------------------------------------------*/
            if((PosCurvV.SpdOutABSQ15 - PosCurvP.DecBaseQ15) <= 0)
            {
            	/*----------------------------------------------------------------------------------*/
                /* 判断插补位置值是否大于当前速度值 如果大于则以当前速度继续运行                    */
                /*----------------------------------------------------------------------------------*/
            	if(PosCurvV.InsertPosABS > PosCurvV.SpdOutABSQ15)
            	{
                    PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
                    PosCurvV.InsertPosABS = PosCurvV.InsertPosABS - PosCurvV.SpdOutABSQ15;
            	}
            	else
            	{
                    PosCurvV.PosCmdABS = PosCurvV.InsertPosABS;
                    PosCurvV.InsertPosABS = 0;
                    PosCurvV.SpdOutABSQ15 = 0;
            	}
            }
            else
            {
                /*----------------------------------------------------------------------------------*/
                /* 插补位置与当前脉冲指令判断                                                       */
                /*----------------------------------------------------------------------------------*/
                if(PosCurvV.InsertPosABS > PosCurvV.SpdOutABSQ15)
                {
                    /*------------------------------------------------------------------------------*/
                    /* 输出位置脉冲按当前速度值计算                                                 */
                    /*------------------------------------------------------------------------------*/
                    PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
                    
                    /*------------------------------------------------------------------------------*/
                    /* 插补位置更新  位置余量减去当前速度值                                         */
                    /*------------------------------------------------------------------------------*/
                    PosCurvV.InsertPosABS = PosCurvV.InsertPosABS - PosCurvV.SpdOutABSQ15;
                }
                else
                {
                    PosCurvV.PosCmdABS = PosCurvV.InsertPosABS;
                    PosCurvV.InsertPosABS = 0;
                }
            }
        }
        /*------------------------------------------------------------------------------------------*/
        /* 当位置余量小于当前速度值时  正常减速运行                                                 */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            /*--------------------------------------------------------------------------------------*/
            /* 速度输出计算                                                                         */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.SpdOutABSQ15 = PosCurvV.SpdOutABSQ15 - PosCurvP.DecBaseQ15;
            
            /*--------------------------------------------------------------------------------------*/
            /* 速度非负限制                                                                         */
            /*--------------------------------------------------------------------------------------*/
            if(PosCurvV.SpdOutABSQ15 <= 0)
                PosCurvV.SpdOutABSQ15 = 0;
            
            /*--------------------------------------------------------------------------------------*/
            /* 位置指令输出计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
        }
        break;
    }
    /*----------------------------------------------------------------------------------------------*/
    default:
        break;
    }
}


/****************************************************************************************************/
/*Function Name: PosQuadrantDEC                                                                     */
/*Description  : 位置指令各个象限处理     				                                            */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void PosQuadrantDEC(void)
{
INT64 PosRemainABS;
INT64 TempT = 0;                                                         /* 减速次数临时变量         */

    if( PosCurvV.PosRemain >= 0)
        PosRemainABS = PosCurvV.PosRemain << 15;                        /* 剩余脉冲计算             */ 
    else
        PosRemainABS = -(PosCurvV.PosRemain << 15);                     /* 剩余脉冲计算             */
    /*----------------------------------------------------------------------------------------------*/
    /* 初次进入  减速点位置值计算                                                                   */
    /*----------------------------------------------------------------------------------------------*/
    if(PosCurvV.PosBlock == 0)
        PosCurvV.TurningPosABS = DecPosCal(PosCurvV.SpdOutABSQ15);
 
    /*----------------------------------------------------------------------------------------------*/
    /* 根据计算的减速点位置值和位置余量值计算运行区间                                               */
    /*----------------------------------------------------------------------------------------------*/
    if((PosRemainABS - PosCurvV.SpdOutABSQ15) >= PosCurvV.TurningPosABS)
    {
        if(PosCurvV.SpdOutABSQ15 >= PosCurvV.PosRefSpd)     /*判断输出速度指令是否达到定位速度值    */
            PosCurvV.PosBlock = 1;                          /*速度指令没有达到定位速度   加速运行   */
        else
            PosCurvV.PosBlock = 2;                          /* 速度指令达到定位速度匀速运行         */
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 位置余量小于减速点位置值时  减阶段规划                                                       */
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        /*------------------------------------------------------------------------------------------*/
        /* 第一次进入减速阶段插补位置计算                                                           */
        /*------------------------------------------------------------------------------------------*/
        if(PosCurvV.PosBlock != 3 && PosCurvV.PosBlock != 4)
        {
            /*--------------------------------------------------------------------------------------*/
            /* 计算按设定减速度减速 需要插补的位置值                                                */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.InsertPosABS = PosRemainABS + PosCurvV.SpdOutABSQ15 - PosCurvV.TurningPosABS;
            /*--------------------------------------------------------------------------------------*/
            /* 判断插补位置值是否为负                                                               */
            /*--------------------------------------------------------------------------------------*/
            if(PosCurvV.InsertPosABS < 0)
            {
                TempT = 2 * PosRemainABS / PosCurvV.SpdOutABSQ15 - 1;
                if(TempT <= 0)
                  TempT = 1;
                PosCurvP.DecBaseQ15 = PosCurvV.SpdOutABSQ15 / TempT;
                PosCurvV.SpdOutABSQ15 = PosCurvP.DecBaseQ15 * TempT;
                
                PosCurvV.TurningPosABS = DecPosCal(PosCurvV.SpdOutABSQ15);
                
                PosCurvV.InsertPosABS = PosRemainABS - PosCurvV.TurningPosABS;
                
                PosCurvV.SpdOutABSQ15= PosCurvV.SpdOutABSQ15 + PosCurvP.DecBaseQ15;
                
                /*----------------------------------------------------------------------------------*/
                /* 运行轨迹切换到Block3减速运行阶段                                                 */
                /*----------------------------------------------------------------------------------*/
                PosCurvV.PosBlock = 3;
            }
            else
            {
                /*----------------------------------------------------------------------------------*/
                /* 运行轨迹切换到Block3减速运行阶段                                                 */
                /*----------------------------------------------------------------------------------*/
                PosCurvV.PosBlock = 3;
            }
            //位置重叠计算
#if 0
            if(ProfPos.OverlapFlg)        //多段位置重叠
            {
                OverlapDeal();
            }
#endif
        }
        /*------------------------------------------------------------------------------------------*/
        /* 判断     当脉冲余量减到0时   定位完成   PosBlock清零                                     */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            /*--------------------------------------------------------------------------------------*/
            /* 剩余脉冲数判断                                                                       */
            /*--------------------------------------------------------------------------------------*/
            if((PosRemainABS == 0)&&(PosCurvV.SpdOutABSQ15 == 0))
                PosCurvV.PosBlock = 0;
        }
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 不同运行阶段位置指令规划                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    switch(PosCurvV.PosBlock)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 从初始速度减速到定位速度                                                                 */
        /*------------------------------------------------------------------------------------------*/
        case 1:
        {
            PosCurvV.SpdOutABSQ15 = PosCurvV.SpdOutABSQ15 - PosCurvP.DecBaseQ15;
            /*--------------------------------------------------------------------------------------*/
            /*速度值最小为定位速度                                                                  */
            /*--------------------------------------------------------------------------------------*/
            if(PosCurvV.SpdOutABSQ15 <= PosCurvV.PosRefSpd)
                PosCurvV.SpdOutABSQ15 = PosCurvV.PosRefSpd;
            PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
            /*--------------------------------------------------------------------------------------*/
            /* 减速点位置值计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.TurningPosABS = DecPosCal(PosCurvV.SpdOutABSQ15);
            break;
        }
    /*----------------------------------------------------------------------------------------------*/
    /* 匀速运行阶段   以定位为速度进行匀速运行                                                      */
    /*----------------------------------------------------------------------------------------------*/
    case 2:
    {
        PosCurvV.SpdOutABSQ15 = PosCurvV.PosRefSpd;
        PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
        break;
    }
    /*----------------------------------------------------------------------------------------------*/
    /*从当前速度减速到0运行阶段                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    case 3:
    {
        /*------------------------------------------------------------------------------------------*/
        /* 插补位置值判断                                                                           */
        /* 插补位置值 大于当前速度值时  插入一个当前速度值                                          */
        /*------------------------------------------------------------------------------------------*/
        if(PosCurvV.InsertPosABS > (PosCurvV.SpdOutABSQ15- PosCurvP.DecBaseQ15))
        {
            /*--------------------------------------------------------------------------------------*/
            /* 转速为0判断  当速度为0时 输出剩余脉冲数                                              */
            /*--------------------------------------------------------------------------------------*/
            if((PosCurvV.SpdOutABSQ15 - PosCurvP.DecBaseQ15) <= 0)
            {
                /*----------------------------------------------------------------------------------*/
            	/*判断插补位置值是否大于当前速度值 如果大于则以当前速度继续运行                     */
                /*----------------------------------------------------------------------------------*/
            	if(PosCurvV.InsertPosABS > PosCurvV.SpdOutABSQ15)
            	{
                    PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
                    PosCurvV.InsertPosABS = PosCurvV.InsertPosABS - PosCurvV.SpdOutABSQ15;
            	}
            	else
            	{
                    PosCurvV.PosCmdABS = PosCurvV.InsertPosABS + (PosCurvV.PosRemain<<15);
                    PosCurvV.InsertPosABS = 0;
                    PosCurvV.SpdOutABSQ15 = 0;
            	}
            }
            else
            {
                /*----------------------------------------------------------------------------------*/
                /* 插补位置与当前脉冲指令判断                                                       */
                /*----------------------------------------------------------------------------------*/
                if(PosCurvV.InsertPosABS > PosCurvV.SpdOutABSQ15)
                {
                    /*------------------------------------------------------------------------------*/
                    /* 输出位置脉冲按当前速度值计算                                                 */
                    /*------------------------------------------------------------------------------*/
                    PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
                    
                    /*------------------------------------------------------------------------------*/
                    /* 插补位置更新  位置余量减去当前速度值                                         */
                    /*------------------------------------------------------------------------------*/
                    PosCurvV.InsertPosABS = PosCurvV.InsertPosABS - PosCurvV.SpdOutABSQ15;
                }
                else
                {
                    PosCurvV.PosCmdABS = PosCurvV.InsertPosABS;
                    PosCurvV.InsertPosABS = 0;
                }
            }
        }
        /*------------------------------------------------------------------------------------------*/
        /* 插补位置值小于当前速度值判断                                                             */
        /*------------------------------------------------------------------------------------------*/
        else
        {
            /*--------------------------------------------------------------------------------------*/
            /* 按设定减速度减速运行                                                                 */
            /*--------------------------------------------------------------------------------------*/
            PosCurvV.SpdOutABSQ15 = PosCurvV.SpdOutABSQ15 - PosCurvP.DecBaseQ15;
            
            /*--------------------------------------------------------------------------------------*/
            /* 速度值非负限定  最小为0                                                              */
            /*--------------------------------------------------------------------------------------*/
            if(PosCurvV.SpdOutABSQ15 <= 0)
                PosCurvV.SpdOutABSQ15 = 0;
            PosCurvV.PosCmdABS = PosCurvV.SpdOutABSQ15;
        }
        break;
    }
    default:
        break;
    }
}

/****************************************************************************************************/
/*Function Name: PosQuadrantDeal                                                                    */
/*Description  : 位置指令各个象限处理     				                                            */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
LONG PosQuadrantDeal(void)
{
INT64 kx;
INT64 LLkx;
INT64 PosCmd = 0;
    switch(PosCurvV.PosCase)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 1象限加速运行位置指令计算                                                                */
        /*------------------------------------------------------------------------------------------*/
        case INCPOS_I:
        {
            PosCurvV.SpdOutABSQ15 = PosCurvV.SpdOutQ15;      /* 当前输出的速度绝对值                */
            PosCurvV.PosRefSpd    = PosCurvP.ProfRefSpdQ15;
            PosQuadrantINC();
            
            PosCurvV.SpdOutQ15 = PosCurvV.SpdOutABSQ15;
            
            /*--------------------------------------------------------------------------------------*/
            /* 位置移位  移位余量计算                                                               */
            /*--------------------------------------------------------------------------------------*/
            LLkx = PosCurvV.PosCmdABS + PosCurvV.PosCmdRemABS;
            kx = LLkx >> 15;
            PosCurvV.PosCmdRemABS = LLkx - ( kx << 15 );
            
            /*--------------------------------------------------------------------------------------*/
            /* 输出位置指令计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCmd = kx;
            PosCurvV.PosSumOut += PosCmd;
            PosCurvV.PosRemain = PosCurvV.PosSumIn - PosCurvV.PosSumOut;
            break;
        }
        /*------------------------------------------------------------------------------------------*/
        /* 1象限减速运行位置指令计算                                                                */
        /*------------------------------------------------------------------------------------------*/
        case DECPOS_I:
            PosCurvV.SpdOutABSQ15 = PosCurvV.SpdOutQ15;
            PosCurvV.PosRefSpd    = PosCurvP.ProfRefSpdQ15;
            PosQuadrantDEC( );
            
            PosCurvV.SpdOutQ15 = PosCurvV.SpdOutABSQ15;
           
            /*--------------------------------------------------------------------------------------*/
            /* 位置移位  移位余量计算                                                               */
            /*--------------------------------------------------------------------------------------*/
            LLkx = PosCurvV.PosCmdABS + PosCurvV.PosCmdRemABS;
            kx = LLkx >> 15;
            PosCurvV.PosCmdRemABS = LLkx - ( kx << 15 );
            /*--------------------------------------------------------------------------------------*/
            /* 输出位置指令计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCmd = kx;            
            PosCurvV.PosSumOut = PosCurvV.PosSumOut + PosCmd;
            PosCurvV.PosRemain = PosCurvV.PosSumIn - PosCurvV.PosSumOut;
            break;
        /*------------------------------------------------------------------------------------------*/
        /* 第四象限加速运行位置指令计算                                                             */
        /*------------------------------------------------------------------------------------------*/
        case INCNEG_IV:
            PosCurvV.SpdOutABSQ15 = -PosCurvV.SpdOutQ15;
            PosCurvV.PosRefSpd    = PosCurvP.ProfRefSpdQ15;
            PosQuadrantINC();
            PosCurvV.SpdOutQ15 = -PosCurvV.SpdOutABSQ15;
            
            /*--------------------------------------------------------------------------------------*/
            /* 位置移位  移位余量计算                                                               */
            /*--------------------------------------------------------------------------------------*/
            LLkx = PosCurvV.PosCmdABS + PosCurvV.PosCmdRemABS;
            kx = LLkx >> 15;
            PosCurvV.PosCmdRemABS = LLkx - ( kx << 15 );
            
            /*--------------------------------------------------------------------------------------*/
            /* 输出位置指令计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCmd = -kx;
            PosCurvV.PosSumOut = PosCurvV.PosSumOut + PosCmd;
            PosCurvV.PosRemain = PosCurvV.PosSumIn - PosCurvV.PosSumOut;
            break;
        /*------------------------------------------------------------------------------------------*/
        /* 第四象限减速运行位置指令计算                                                             */
        /*------------------------------------------------------------------------------------------*/
        case DECNEG_IV:
            PosCurvV.SpdOutABSQ15 = -PosCurvV.SpdOutQ15;
            PosCurvV.PosRefSpd    = PosCurvP.ProfRefSpdQ15;
            PosQuadrantDEC();
            PosCurvV.SpdOutQ15 = -PosCurvV.SpdOutABSQ15;
            /*--------------------------------------------------------------------------------------*/
            /* 位置移位  移位余量计算                                                               */
            /*--------------------------------------------------------------------------------------*/
            LLkx = PosCurvV.PosCmdABS + PosCurvV.PosCmdRemABS;
            kx = LLkx >> 15;
            PosCurvV.PosCmdRemABS = LLkx - ( kx << 15 );
            /*--------------------------------------------------------------------------------------*/
            /* 输出位置指令计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCmd = -kx;
            PosCurvV.PosSumOut = PosCurvV.PosSumOut + PosCmd;
            PosCurvV.PosRemain = PosCurvV.PosSumIn - PosCurvV.PosSumOut;
            break;
        /*------------------------------------------------------------------------------------------*/
        /* 第1象限减速到0,然后再在第4象限加速运动                                                  */
        /*------------------------------------------------------------------------------------------*/            
        case DEC_I_INC_IVC:
            PosCurvV.SpdOutABSQ15 = PosCurvV.SpdOutQ15;
            PosCurvV.PosRefSpd    = 0;
            PosQuadrantDEC();
            PosCurvV.SpdOutQ15 = PosCurvV.SpdOutABSQ15;
            /*--------------------------------------------------------------------------------------*/
            /* 位置移位  移位余量计算                                                               */
            /*--------------------------------------------------------------------------------------*/
            LLkx = PosCurvV.PosCmdABS + PosCurvV.PosCmdRemABS;
            kx = LLkx >> 15;
            PosCurvV.PosCmdRemABS = LLkx - ( kx << 15 );
            /*--------------------------------------------------------------------------------------*/
            /* 输出位置指令计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCmd = kx;
            PosCurvV.PosSumOut = PosCurvV.PosSumOut + PosCmd;
            PosCurvV.PosRemain = PosCurvV.PosSumIn - PosCurvV.PosSumOut;
            break;
        /*------------------------------------------------------------------------------------------*/
        /* 第四象限减速到0,然后再在第1象限加速运动                                                  */
        /*------------------------------------------------------------------------------------------*/   
        case DEC_IV_INC_I:
            PosCurvV.SpdOutABSQ15 = -PosCurvV.SpdOutQ15;
            PosCurvV.PosRefSpd    = 0;
            PosQuadrantDEC();
            PosCurvV.SpdOutQ15 = -PosCurvV.SpdOutABSQ15;
            /*--------------------------------------------------------------------------------------*/
            /* 位置移位  移位余量计算                                                               */
            /*--------------------------------------------------------------------------------------*/
            LLkx = PosCurvV.PosCmdABS + PosCurvV.PosCmdRemABS;
            kx = LLkx >> 15;
            PosCurvV.PosCmdRemABS = LLkx - ( kx << 15 );
            /*--------------------------------------------------------------------------------------*/
            /* 输出位置指令计算                                                                     */
            /*--------------------------------------------------------------------------------------*/
            PosCmd = -kx;
            PosCurvV.PosSumOut = PosCurvV.PosSumOut + PosCmd;
            PosCurvV.PosRemain = PosCurvV.PosSumIn - PosCurvV.PosSumOut;
            break;          
        /*------------------------------------------------------------------------------------------*/                   
        default:
            break;
    }
    return PosCmd;
}

/****************************************************************************************************/
/*Function Name: PosCurveGenerator_Deal(void)                                                       */						
/*Description  : 位置曲线的生成处理								                                    */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void PosCurveGenerator_Deal( void )
{
    PosQuadrantJudge( );                                    /* 运行象限判断                         */
INT64 kx1 = MlibAbs32( PosCurvV.PosRemain );
      kx1 = kx1 << 15;
INT64 kx2;
    /*----------------------------------------------------------------------------------------------*/
    if( kx1 > PosCurvP.DecBaseQ15)
    {
        PosCurvV.PosCmdOut = PosQuadrantDeal();
    }
    /*----------------------------------------------------------------------------------------------*/
    else
    {
        if( PosCurvV.PosRemain != 0 )
        {
            if(PosCurvV.SpdOutQ15 == 0)
            {
                PosCurvV.PosCmdOut = PosCurvV.PosRemain;                /* 脉冲余量直接输出         */
                PosCurvV.PosSumOut = PosCurvV.PosSumOut + PosCurvV.PosCmdOut;
                PosCurvV.PosRemain = PosCurvV.PosSumIn - PosCurvV.PosSumOut;
            }
            else
            {
                if( PosCurvV.SpdOutQ15 < 0 )
                    kx2 = -PosCurvV.SpdOutQ15;
                else
                    kx2 = PosCurvV.SpdOutQ15;
                if(kx1 > kx2)
                {
                    /* PosCurvV.PosCmdOut = PosCurvV.SpdOutQ15 >> 15;                               */
                    PosCurvV.PosCmdOut += (PosCurvV.SpdOutQ15 >> 15);     /* @2019.12.10 Rebuild      */
                    PosCurvV.PosSumOut = PosCurvV.PosSumOut + PosCurvV.PosCmdOut;
                    PosCurvV.PosRemain = PosCurvV.PosSumIn  - PosCurvV.PosSumOut;
                }
                else
                {               
                    PosCurvV.PosCmdOut = PosCurvV.PosRemain;            /* 脉冲余量直接输出         */
                    PosCurvV.PosSumOut = PosCurvV.PosSumOut + PosCurvV.PosCmdOut;
                    PosCurvV.PosRemain = PosCurvV.PosSumIn - PosCurvV.PosSumOut;
                }
            }
        }
        else
        {
            PosCurvV.TargetReach = 1;                                   /* 定位完成                 */
            PosCurvV.Pos1TarReach = 1;
            PosCurGenerator_Clear( );                                   /* 相关数据清零             */
        } 
    }
}

