/****************************************************************************************************
                    (C) COPYRIGHT 2019 ShenZhen XXXXX Electronics CO.,LTD.
                         ~~~~~~~~~~~深圳市XXXX电气有限公司 ~~~~~~~~~~~
							             科技创新无极限
                                             _ooOoo_
                                            o8888888o
                                            88" . "88
                                            (| -_- |)
                                            O\  =  /O
                                         ____/`---'\____
                                       .'  \\|     | 
                                      /  \\|||  :  ||| 
                                     /  _||||| -:- |||||-  \
                                     |   | \\\  -   
                                     | \_|  ''\---/''  |   |
                                     \  .-\__  `-`  ___/-. /
                                   ___`. .'  /--.--\  `. . __
                                ."" '<  `.___\_<|>_/___.'  >'"".
                               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
                               \  \ `-.   \_ __\ /__ _/   .-` /  /
                          ======`-.____`-.___\_____/___.-`____.-'======
                                             `=---='
                          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
                                          \      |      /
                                          \     |     /
                                           \    |    /
                                            \   |   /
                                             \  |  /
                                              \ | /
                                            |--\|/--|
                                            |||||||||
 *****************************************************************************************************/
  
  
  
/****************************************************************************************************
*文件名:Seq00_Main.c
*创建时间:2017.08.22
*版本说明:V1.0
*功能描述:控制模式
*****************************************************************************************************/
#include "Main.h"
 
SVSEQV SvSeqV;
  
  
  
void	LpxForceSetAlmReady( void )
{
	CoutV.f.Sv.AlmReady = Alm.f.AlmReady;
	SvSeqV.OperateAlmStopMode = Alm.StopMode;
	return;
}
  
  
  
void CpxServoSequence( void )
{
		LpxForceSetAlmReady( );					     
 		LpxMakeSequenceSignal( );				     
 		LpxMechaBrakeSequence( );				     
 		LpxOverTravelSequence( );				     
 		LpxZeroClampSequence( );				     
 		LpxStopModeManager( );					     
 		LpxDynamicBrakeSequence( );				     
 		LpxControlModeManager( );				     
 		return;   
}
 
