//*************************************************************************************************
//文件名:APP11_ScanA.c
//创建时间:2022.07.11
//版本说明:V1.0
//功能描述:62.5us中断
//*************************************************************************************************
#include "Main.h"



#define EXIT1_Pin       92
#define GPIO_CFG_EXIT1  GPIO_92_GPIO92

//*************************************************************************************************
//
//任务A调度
//
//*************************************************************************************************
__interrupt void SCANA_Task(void)
{
    ULONG StartTime;

    //---------------------------------------------------------------------------------------------
    // 任务A调度开始
    //---------------------------------------------------------------------------------------------
    KPX_RST_SCANA_STRTIME( StartTime );                     // ScanA 执行时间计时开始
    //---------------------------------------------------------------------------------------------
    //KPX_MOTA_RUN_LED_TOG();
    ApiScanAMain( );
    //---------------------------------------------------------------------------------------------

#ifdef CPU1
    CLA_TaskB();
#endif
    //---------------------------------------------------------------------------------------------
    // 任务A调度结束
    //---------------------------------------------------------------------------------------------
    KPX_GET_SCANA_EXETIME( StartTime );                     // ScanA 执行时间结束
    //---------------------------------------------------------------------------------------------
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);

}

/****************************************************************************************************/
/*Function_Name:InitCpu1_ScanA                                                                      */
/*Description  :使用外部中断来触发                                                                       */
/****************************************************************************************************/
void InitCpu1_ScanA( void )
{
    EALLOW;
    // 中断信号引脚配置
#ifdef CPU1
    GPIO_setPinConfig(GPIO_CFG_EXIT1);
    GPIO_setDirectionMode(EXIT1_Pin, GPIO_DIR_MODE_IN);
    GPIO_setPadConfig(EXIT1_Pin, GPIO_PIN_TYPE_PULLUP);
    GPIO_setQualificationMode(EXIT1_Pin, GPIO_QUAL_6SAMPLE);
    GPIO_setMasterCore(EXIT1_Pin, GPIO_CORE_CPU1);
#endif

    // 中断信号配置
#ifdef CPU1
    GPIO_setInterruptType(GPIO_INT_XINT1, GPIO_INT_TYPE_RISING_EDGE);
#endif
    GPIO_setInterruptPin(EXIT1_Pin, GPIO_INT_XINT1);
    GPIO_enableInterrupt(GPIO_INT_XINT1);
    Interrupt_register(INT_XINT1, &SCANA_Task);
    EDIS;
}

/****************************************************************************************************/
/*  开启外部中断(62.5us)                                                                               */
/****************************************************************************************************/
void ScanATask_Start( void )
{
    Interrupt_enable(INT_XINT1);
}

