/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                   */
/*											2017 ~													*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		Can06_CiA402.c : CanOpen  402协议               											*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "Main.h"



/****************************************************************************************************/
/*Function Name: OrigSearch_ParamUpdate(void)                                                       */
/*Description  : 原点搜索初始化						                                                */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void Can_OrigSearch_ParamUpdate( void )
{
    USHORT OrgType = 0;                                     /* 原点回归类型                         */
    OrgControlBit.bit.OrgDone = 0;                          /* 原点回归完成标志位清零               */
    OrgControlBit.bit.OrgFail = 0;                          /* 原点回归失败标志清零                 */
    
    OrgStr.OrgCmdOutQ15  = 0;
    OrgStr.RemainPulsQ15 = 0;
    ULLONG Kx = 0;
    
    ODDatArr[Status_Word].all &= 0x6FFF;                   //bit12清0,bit15清0
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归使能参数初始化 状态过渡到高速原点搜索                                                */
    /* 基于125us规划                                                                                */
    /*----------------------------------------------------------------------------------------------*/    
    Kx = ((ULLONG)ODDatArr[Homing_Acceleration].all * 8) / 15625;
    if( Kx==0 )
    {
        Kx = 1;
    }
    OrgStr.OrgAccDecBaseQ15 = Kx;
    /*----------------------------------------------------------------------------------------------*/
    /* 回原点高速速度值给定                                                                         */
    /*----------------------------------------------------------------------------------------------*/
    if( ODDatArr[Search_Switch_Spd].all == 0 ) 
	{
        ODDatArr[Search_Switch_Spd].all = 1;
	}
    if( ODDatArr[Search_Zero_Spd].all == 0 ) 
	{
        ODDatArr[Search_Zero_Spd].all = 1;
    }
    OrgStr.OrgSpdHQ15 = ((ULLONG)ODDatArr[Search_Switch_Spd].all * 512) / 125;
    OrgStr.OrgSpdLQ15 = ((ULLONG)ODDatArr[Search_Zero_Spd].all * 512) / 125;

    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归控制参数初始化                                                                       */
    /*----------------------------------------------------------------------------------------------*/
    OrgType = ODDatArr[Homing_Method].byte.FirstByte;           /* 回零方式                         */
    if(OrgType > 35 || OrgType == 0 )
    {
        OrgStr.OrgStep = ORG_FAIL;
        KPI_ALARMSET( ALM_EET_HomeErr );
        return;
    }
    /*----------------------------------------------------------------------------------------------*/
    if(OrgType == 35)
    {
        OrgStr.OrgStep = ORG_OK;
        return;
    }
    /*----------------------------------------------------------------------------------------------*/
    OrgControlBit.all = OrgCtlBitTable[OrgType];
    
    /*----------------------------------------------------------------------------------------------*/
    /* 初始化原点回归状态切换                                                                       */
    /*----------------------------------------------------------------------------------------------*/
    OrgStartStateCheck();
}

/****************************************************************************************************/
/*Function Name: OrigSearch_Deal(void)                                                              */
/*Description  : 原点搜索相关处理   						                                        */
/*Attention    : 										                                            */
/****************************************************************************************************/

void Can_OrgZeroPosDeal(void)
{
    LONG Can_ZposDelta = 0;                         /* Z脉冲移动距离计算值                          */
    LONG AmonPosErratemp=0;                         //位置偏差
    /*----------------------------------------------------------------------------------------------*/
    if(CAN_EXFUNC0_14_EN)
     {
         OrgPosOffset = ODDatArr[Homing_Offset_MM].sall;
     }
     else
     {
         OrgPosOffset = 0;
     }
    ZeroRunSpeed = SpeedLow;
    /*----------------------------------------------------------------------------------------------*/
    /* Z脉冲位置计算                                                                                */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgZEndFlg == ORG_Z_YES)
    {
        /*------------------------------------------------------------------------------------------*/
        /* 正方向找第一个Z脉冲为原点                                                                */
        /*------------------------------------------------------------------------------------------*/
        if(OrgControlBit.bit.OrgZPulseDir == ORG_Z_DIR_POS)
        {
            if(Kprm.f.FencUseFlag)
                Can_ZposDelta = MencP.PulseNo - (LONG)RoutV.ABSEncSValue;
            else
                Can_ZposDelta = (FencP.MotPulseNo - (LONG)FencV.FencAbsPos) * Iprm.sfgear.b / Iprm.sfgear.a;
            /*--------------------------------------------------------------------------------------*/
            
            /*--------------------------------------------------------------------------------------*/
        }
        /*------------------------------------------------------------------------------------------*/
        /* 反向找原点时  反方向找第一个脉冲                                                         */
        /*------------------------------------------------------------------------------------------*/
        else if( OrgControlBit.bit.OrgZPulseDir == ORG_Z_DIR_NEG )
        {
            if(Kprm.f.FencUseFlag)
                Can_ZposDelta = -(LONG)RoutV.ABSEncSValue;
            else
                Can_ZposDelta = - (LONG)FencV.FencAbsPos * Iprm.sfgear.b / Iprm.sfgear.a ;
        }
		else
		{
			;
		}
        /*------------------------------------------------------------------------------------------*/
        /* Z 脉冲偏置值转换成Pn204/Pn206之后的值                                                    */
        /*------------------------------------------------------------------------------------------*/
		Can_ZposDelta = (INT64)Can_ZposDelta * Iprm.Egear.a / Iprm.Egear.b;
        
    }
    /*----------------------------------------------------------------------------------------------*/
    else if(OrgControlBit.bit.OrgZEndFlg == ORG_Z_NO)
    {
        Can_ZposDelta = 0;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 需要走的位置总量计算                                                                         */
    /* CANopen的位置偏差60F4与实际电机的位置偏差不同步,使用s32FollowErrActVal                       */
    /*----------------------------------------------------------------------------------------------*/
    AmonPosErratemp = (LLONG)PosMngV.PosErrA.per32s * ODDatArr[Position_Factor_Divisor].all
                        / ODDatArr[Position_Factor_Numer].all ;
    Can_ZposDelta   = (LLONG)Can_ZposDelta * ODDatArr[Position_Factor_Divisor].all \
                        / ODDatArr[Position_Factor_Numer].all;
    
    if( Iprm.f.RvsDir == FALSE )
    {
        OrgPosOffset = (LONG)OrgPosOffset + Can_ZposDelta - AmonPosErratemp;
    }
    else
    {
        OrgPosOffset = (LONG)OrgPosOffset - Can_ZposDelta - AmonPosErratemp;
    }
    /*----------------------------------------------------------------------------------------------*/    
    OrgStr.OrgStep = ORG_CmdGen;
}

/****************************************************************************************************/
/*函数名称：OrgStateMachine()原点回归状态机                                                         */
/*函数功能：原点回归不同状态间切换                                                                  */
/****************************************************************************************************/
void Can_OrgStateMachine(void)
{
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归状态机执行                                                                           */
    /*----------------------------------------------------------------------------------------------*/
    switch(OrgStr.OrgStep)
    {
        /*------------------------------------------------------------------------------------------*/
        case ORG_SPDH:                                          /* 高速搜索原点                     */
            HighSpdSearch();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_SPDH_DEC:                                      /* 高速减速                         */
            HighSpdDec();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_SPDL:                                          /* 低速搜索原点                     */
            LowSpdSearch();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_SPDL_DEC:                                      /* 低速减速                         */
            LowSpdDec();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_SWITCH_CHECK:                                  /* 状态判断                         */
            OrgSwitchDirCheck();
        break;
        case ORG_SPDL_SECOND:                                   /* 低速搜索原点                     */
            LowSpdSearch_SECOND();
        break;
        
        case ORG_SPDL_DEC_SECOND:                               /* 低速减速                         */
            LowSpdDec_SECOND();
        break;
        case ORG_SPDH_SPDL_DEC:                                 /* 高速减速                         */
            HighLowSpdDec();
        break;
        /*------------------------------------------------------------------------------------------*/
        case ORG_OFFSET:                                        /* 从原点运行到零点位置             */
            Can_OrgZeroPosDeal();
        break;
        case ORG_CmdGen:
            OrgZeroRun();
        break;    
        /*------------------------------------------------------------------------------------------*/
        case ORG_OK:                                            /* 原点回归完成 参数清零            */
            OrgOKDeal();
        break;
        case ORG_FAIL:                                          /* 原点回归失败                     */
            OrgFailDeal();
        default:
            break;
    }
}

LONG Can_OrigSearch_Deal( void )
{
    /*----------------------------------------------------------------------------------------------*/
    /* 判断原点回归是否完成,完成则结束处理                                                          */
    /*----------------------------------------------------------------------------------------------*/
    if(OrgControlBit.bit.OrgDone == 1)
    {
        return 0;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 原点回归状态执行                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    Can_OrgStateMachine();
    /*----------------------------------------------------------------------------------------------*/
    /* 脉冲指令输出计算                                                                             */
    /*----------------------------------------------------------------------------------------------*/
    OrgStr.OrgCmdOut        = (OrgStr.OrgCmdOutQ15 + OrgStr.RemainPulsQ15) >> 15;
    OrgStr.RemainPulsQ15    = OrgStr.OrgCmdOutQ15 + OrgStr.RemainPulsQ15 - (OrgStr.OrgCmdOut << 15);

    return OrgStr.OrgCmdOut;
}

/****************************************************************************************************/
/*Function Name: Can_Orig_Init                                                    */
/*Description  : 原点回归模式初始化						                                                */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void Can_Orig_Init(void)
{
    //---------------------------------------------------------------------------------------------
    /* 上电关闭原点回归使能控制                                                                            */
    //---------------------------------------------------------------------------------------------
    if( (Prm.orgmode & 0x000F) == 0x0004 )
    {
        Prm.orgmode = Prm.orgmode & 0xFFF0;
    }
}

/****************************************************************************************************/
/*Function Name: Can_Orig_Status                                                                    */
/*Description  : CANopen 6041bit15判定						                                        */
/*Attention    : 										                                            */ 
/****************************************************************************************************/
void Can_Orig_Status(void)
{
    if( CAN_EXFUNC1_0_EN )
    {
        if( (Prm.orgstatus & 0x01) == 1)
        {
            ODDatArr[Status_Word].all  |= 0x8000;           //找到参考点，bit15置1（Canopen）
        }
    }

}


