/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                              */
/*                                  版权所有 · All right Reserved                                  */
/*						                    2018 ~	        					                    */
/****************************************************************************************************/
/*文件名:Pr01_DICtrg.c                                                                              */
/*创建时间: 2018.11.14                                                                              */
/*版本说明: V1.0                                                                                    */
/*功能描述: 通过输入端子来选择所需要的位置     	                                                    */			
/****************************************************************************************************/
#include "Main.h"


PR_DICTRG Pr_DICtrgV;
HWSIN	Inx;


void InnerPosInformation( USHORT Target );
USHORT InperRunMode(UCHAR Target);
/****************************************************************************************************/
/*																									*/
/*		PR模式之相关变量清零处理 																	    */
/*                                                  												*/
/****************************************************************************************************/
void PrModePrameterInit( void )
{
    Pr_DICtrgV.f.PrDelayOKFlag=1;
    Pr_DICtrgV.f.PosSpdReachflag=1;
    
    Pr_DICtrgV.NewNum = 1;
    
    OrgStr.ExternOrgEnFlg = 0;
    OrgStr.OrgCompStatus = 0x03;
//    OrgParaInitial();
    OrgControlBit.bit.OrgDone = 1;
    Pr_DICtrgV.StopSign = 1;
    
}

/****************************************************************************************************/
/*																									*/
/*		DI触发端子判断             																	*/
/*                                                  												*/
/****************************************************************************************************/
void Pr_DI_ConTrig(void)
{
    /*----------------------------------------------------------------------------------------------*/
    /*                              DI 端子位置触发处理部分                                          */
    /*----------------------------------------------------------------------------------------------*/
    KPI_SIN_START( Inx );                               /* 获取相关的输入信号                        */
    /*----------------------------------------------------------------------------------------------*/
    Pr_DICtrgV.f.CTRG    = KPI_SIN_CTRG( Inx );         /* 内部位置 触发                             */
    /*----------------------------------------------------------------------------------------------*/
    
    /*----------------------------------------------------------------------------------------------*/
    /*                         伺服驱动器是否使能,不使能则退出                                        */
    /*----------------------------------------------------------------------------------------------*/

    if( !BinV.f.BaseEnable )
    {
        Pr_DICtrgV.CTRG_Step            = 0;
        Pr_DICtrgV.CurMode              = 1;           // 初始默认为定速模式
        Pr_DICtrgV.f.PrDelayOKFlag      = 1;           // 自动执行标志清零
        Pr_DICtrgV.f.PosSpdReachflag    = 1;           // 定速已完成
        Pr_DICtrgV.f.NewPosFlag         = 0;           // 不再更新
        /*------------------------------------------------------------------------------------------*/
        PosCurvV.SpdOutQ15              = 0;           //伺服在Off时,需要将当前的速度输出赋0 V20190116
        Pr_DICtrgV.PrPosSpd_Q15Remain   = 0;
        PosCurvV.Pos1TarReach           = 0;
        /*------------------------------------------------------------------------------------------*/
        return;
    }
    Pr_DICtrgV.CTRG_Status = ( Pr_DICtrgV.CTRG_Status << 1 ) & 0x0003;      /* CTRG 信号沿监视      */
    Pr_DICtrgV.CTRG_Status  |= Pr_DICtrgV.f.CTRG;

}
/****************************************************************************************************/
/*																									*/
/*		内部位置停止命令               																*/
/*                                                  												*/
/****************************************************************************************************/
void  PrPosStop(void)
{
    
    if(Prm.PrCommSet == 1000 || Pr_DICtrgV.CTRG_Status == 2)        //下降沿或1000停止，端子与通讯触发互不影响
    {     
        Pr_DICtrgV.StopSign = 1;
        Prm.PrCommSet =  20000 + Pr_DICtrgV.PosNum;
        Pr_DICtrgV.PrDelayTimeCnt = Pr_DICtrgV.PrDelayTimeOld;      // 延时计数器处理                     
    }
    if(Pr_DICtrgV.StopSign)
    {
        PosCurGenerator_Clear();
        Pr_DICtrgV.f.NewPosFlag = 0;
        PrPosSpdP.ProfRefSpdQ15 = 0;
//        Pr_DICtrgV.CTRG_Step    = 0;
    }
}




/****************************************************************************************************/
/*																									*/
/*		单段位置指令处理时序逻辑 																        */
/*                                                  												*/
/****************************************************************************************************/
LONG PrModeSinglePos( void )
{
//USHORT kx0,kx1;
//USHORT PosNum = 0;
   LONG KX;
    /*------------------------------------------------------------------------------------------*/
    Pr_DICtrgV.DI.f.Pos0 = KPI_SIN_POS0( Inx );         /* 内部位置端子0                        */  
    Pr_DICtrgV.DI.f.Pos1 = KPI_SIN_POS1( Inx );         /* 内部位置端子1                        */
    Pr_DICtrgV.DI.f.Pos2 = KPI_SIN_POS2( Inx );         /* 内部位置端子2                        */
    Pr_DICtrgV.DI.f.Pos3 = KPI_SIN_POS3( Inx );         /* 内部位置端子3                        */
    //        Pr_DICtrgV.DI.f.Pos4 = KPI_SIN_POS4( Inx );       /* 内部位置端子4                        */
    //        Pr_DICtrgV.DI.f.Pos5 = KPI_SIN_POS5( Inx );       /* 内部位置端子5                        */
    /*------------------------------------------------------------------------------------------*/

    /*----------------------------------------------------------------------------------------------*/
    /*                                     DI CTRG 上升沿信号                                        */
    /*----------------------------------------------------------------------------------------------*/    
    if( Pr_DICtrgV.CTRG_Status == 0x01 )
    {
        Pr_DICtrgV.NewNum = (UCHAR)(Pr_DICtrgV.DI.w & 0x000F);  /* 新的位置编号                     */
        if( !Pr_DICtrgV.NewNum )
        {
            OrgStr.ExternOrgEnFlg = 1;
        }
        else
        {
            if((Prm.PrModeSet & 0x0100)==0x0000) 
            {
                if( Pr_DICtrgV.f.PrDelayOKFlag == 1 ) 
                {
                    Pr_DICtrgV.f.NewPosFlag = 1;            /* 新的位置标志                         */
                    Pr_DICtrgV.f.PramUpdate = 0;            /* 相关参数需要重新计算                 */
                    Pr_DICtrgV.StopSign     = 0;
                }
            }
            else
            {
                Pr_DICtrgV.f.NewPosFlag = 1;                /* 新的位置标志                         */
                Pr_DICtrgV.f.PramUpdate = 0;                /* 相关参数需要重新计算                 */
                Pr_DICtrgV.StopSign     = 0;
            }
        }
        /*------------------------------------------------------------------------------------------*/
    }
    
    if(Prm.PrCommSet<16)                                        //通讯触发
    {
        Pr_DICtrgV.NewNum = (UCHAR)(Prm.PrCommSet & 0x000F);    /* 新的位置编号                     */
        if(!Pr_DICtrgV.NewNum)
        {
            OrgStr.ExternOrgEnFlg = 1;
        }
        else
        {
            Pr_DICtrgV.f.NewPosFlag = 1;                        /* 新的位置标志                     */
            Pr_DICtrgV.f.PramUpdate = 0;                        /* 相关参数需要重新计算              */
            Pr_DICtrgV.StopSign     = 0;
        }
    }
   

    if( Pr_DICtrgV.f.NewPosFlag )
    {
        /*------------------------------------------------------------------------------------------*/
        /* 当有新的指令时,需要对当前的标志位进行查表等计算,为了减轻CPU的负荷,当查表完成后,置位相关       */
        /* 的标志位,更新的数据不再进行相应的计算处理                                                   */
        /*------------------------------------------------------------------------------------------*/
        /* 是否需要进行对指令缓存处理????????????????????( 台达有进行缓存处理  )                       */
        /* 使用缓存的方式,可以有效的保持前后两个位置之间的连贯性处理                                    */
        /*------------------------------------------------------------------------------------------*/
        
        if( !Pr_DICtrgV.f.PramUpdate )
        {
            InnerPosInformation( Pr_DICtrgV.NewNum );           /* 相关参数的计算处理               */
            Pr_DICtrgV.f.PramUpdate = 1;                        /* 相关的参数已经更新               */
        }
        /*------------------------------------------------------------------------------------------*/
        /*  新的目标模式仍然是定速模式                                                                */
        /*------------------------------------------------------------------------------------------*/
        
        if((Prm.PrModeSet & 0x0100)  || Pr_DICtrgV.f.PrDelayOKFlag)
        {
            PrPosSwitch();
            Pr_DICtrgV.f.NewPosFlag = 0;                        //指令已经执行,位置更新标志清零
        }
    }
    if(Prm.PrCommSet == 1000)
    {
        PrPosStop();                                            //单段触发只能使用通讯停止，或是立即更新情况下触发0位置指令
    }
    KX=PosAndSpeedDeal();
    
    return KX;
} 
    
LONG PosAndSpeedDeal(void)
{
    LONG rc = 0;
    /*----------------------------------------------------------------------------------------------*/
    /*  Un300: 监控当前的 Pr运行的路径编号                                                           */
    /*----------------------------------------------------------------------------------------------*/
    Pr_DICtrgV.MonitorPosNum = Pr_DICtrgV.PosNumOld;
    /*----------------------------------------------------------------------------------------------*/
    Pr_DICtrgV.f.PosExeImmet = 0;
    /*----------------------------------------------------------------------------------------------*/
    /*                                    速度 or 位移处理时序                                       */
    /*----------------------------------------------------------------------------------------------*/
    switch( Pr_DICtrgV.CTRG_Step )
    {
        /*------------------------------------------------------------------------------------------*/
        case 0:
            return 0;
        /*------------------------------------------------------------------------------------------*/
        case 1:                                     /* 定速 或者定位时相关系数初始化                 */
            /*--------------------------------------------------------------------------------------*/
            if( Pr_DICtrgV.CurMode )                /* 定速模式                                     */
            {
                PrPosSpdCoeffCount( );              /* 用户设定参数更新                              */
                Pr_DICtrgV.f.PosSpdReachflag = 0;   /* 加速完成(0:无效;1:延时计时开始)                */
            }
            /*--------------------------------------------------------------------------------------*/
            else                                    /* 定位模式                                     */
            {               
                PosVelocityCoeffCount( );           /* 用户设定参数更新                              */
                Pr_DICtrgV.f.PosCmdFinishFlag = 0;  /* 当前段位移指令完成标志(包含延时)               */
            }
            /*--------------------------------------------------------------------------------------*/
            Pr_DICtrgV.f.CMDOK          = 0;                     /* 开始发送位置指令                 */
            Pr_DICtrgV.PosNumOld        = Pr_DICtrgV.PosNum;     /* 记录当前路径的编号               */
            Pr_DICtrgV.PosTypeOld       = Pr_DICtrgV.PosType;    /* 记录当前路径的Type               */
            Pr_DICtrgV.PosOptionOld     = Pr_DICtrgV.PosOption;  /* 记录当前路径的Option             */
            Pr_DICtrgV.PrDelayTimeOld   = Pr_DICtrgV.PrDelayTime;/* 延时时间                        */
            Pr_DICtrgV.PrDelayTimeCnt   = 0;                     /* 延时计数器清零                   */
            Pr_DICtrgV.f.PrDelayOKFlag  = 0;                     /* Pr 延时完成标志位清零            */
            Pr_DICtrgV.f.PosExeFinishFlg= 0;                     /* 位置指令运算完成完成标志清零      */
            Prm.PrCommSet               = 10000 + Pr_DICtrgV.PosNum; //运行过程中Pn806的显示值
            /*--------------------------------------------------------------------------------------*/
            Pr_DICtrgV.CTRG_Step        = 2;                    /* 进入下一步                        */          
            /*--------------------------------------------------------------------------------------*/
            /* Attention:为羚殑证位置指令的连贯性,直接执行Step2 操作                                  */
            /*--------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------------*/
        case 2:
            /*--------------------------------------------------------------------------------------*/
            if( Pr_DICtrgV.CurMode )                /* 定速模式                                     */
            {
                /*----------------------------------------------------------------------------------*/
                /* 定速处理部分(加减速的处理)                                                        */
                /*----------------------------------------------------------------------------------*/
                PosCurvV.SpdOutQ15 = PrPosSpeedDeal( PosCurvV.SpdOutQ15 );      
                /*----------------------------------------------------------------------------------*/
                /*  对当前的速度输出至位置环的指令时,需要进行相关的余数处理,不然,实际运行的速度与设      */
                /*  定的速度存在一定的偏差,故采取相应的余数进行处理                                    */
                /*----------------------------------------------------------------------------------*/
                PosCurvV.PosCmdOut = (PosCurvV.SpdOutQ15 + Pr_DICtrgV.PrPosSpd_Q15Remain ) >> 15;
                Pr_DICtrgV.PrPosSpd_Q15Remain = (PosCurvV.SpdOutQ15 + Pr_DICtrgV.PrPosSpd_Q15Remain ) \
                                                - ((LONG)PosCurvV.PosCmdOut << 15);
                /*----------------------------------------------------------------------------------*/
                /* 判断当前是否有指令在等待                                                           */
                /*----------------------------------------------------------------------------------*/
                if( !Pr_DICtrgV.f.PrDelayOKFlag )
                {
                    /*------------------------------------------------------------------------------*/
                    /* 当前位置需要自动运行到下一位置                                                 */
                    /*------------------------------------------------------------------------------*/
                    if( Pr_DICtrgV.f.PosSpdReachflag )
                    {
                        /*--------------------------------------------------------------------------*/
                        /*  计时已经开始                                                            */
                        /*--------------------------------------------------------------------------*/
                        if( ++Pr_DICtrgV.PrDelayTimeCnt >= Pr_DICtrgV.PrDelayTimeOld )
                        {
                            /*----------------------------------------------------------------------*/
                            /* 延时时间已经到达                                                      */
                            /*----------------------------------------------------------------------*/
                            Pr_DICtrgV.f.PrDelayOKFlag = 1;             /* 延时结束,自动进入下一路径 */
                        }
                    }
                    /*------------------------------------------------------------------------------*/
                    else
                    {  
                        
                    }
                }
                else
                {
                    /*------------------------------------------------------------------------------*/
                    /* 当前位置不需要自动运行到下一位置                                               */
                    /*------------------------------------------------------------------------------*/                    
//                    Pr_DICtrgV.f.PrDelayOKFlag = 0;
                    Prm.PrCommSet = 20000 + Pr_DICtrgV.PosNum;
                }
                /*----------------------------------------------------------------------------------*/
                /* 在定速时,需要将位置的相关数据清零处理                                              */
                /*----------------------------------------------------------------------------------*/
                //PosCurGenerator_Clear();
                /*----------------------------------------------------------------------------------*/
                /*  位置指令总数累加处理                                                             */
                /*----------------------------------------------------------------------------------*/
                Pr_DICtrgV.PosCmdSum += PosCurvV.PosCmdOut;
                return PosCurvV.PosCmdOut;          /* 位置指令输出至位置环指令接口                  */
            }
            /*--------------------------------------------------------------------------------------*/
            else                                    /* 定位模式                                     */
            {
                PosCurveGenerator_Deal( );          /* 轨迹规划                                     */             
                /*----------------------------------------------------------------------------------*/
                /* 判断目标位置是否到达或目标位置指令已经发送完成                                      */
                /*----------------------------------------------------------------------------------*/
                if( PosCurvV.TargetReach )
                {
                    /*------------------------------------------------------------------------------*/
                    if( !Pr_DICtrgV.f.PrDelayOKFlag )          //定位控制:自动运行至下一段路径
                    {
                        /*--------------------------------------------------------------------------*/
                        /*  计时已经开始                                                             */
                        /*--------------------------------------------------------------------------*/
                        if( ++Pr_DICtrgV.PrDelayTimeCnt >= Pr_DICtrgV.PrDelayTimeOld )
                        {
                            /*----------------------------------------------------------------------*/
                            /* 延时时间已经到达                                                      */
                            /*----------------------------------------------------------------------*/
                            Pr_DICtrgV.f.PrDelayOKFlag = 1;             /* 延时结束,自动进入下一路径 */
                            Pr_DICtrgV.f.PosExeFinishFlg = 1;           /* 位置指令运算完成完成标志  */
                        }
                    }
                    /*------------------------------------------------------------------------------*/
                    else
                    {
                        Prm.PrCommSet             = 20000 + Pr_DICtrgV.PosNum;
                        Pr_DICtrgV.PrDelayTimeCnt = 0;                  /* 延时计数器清零处理        */
                        Pr_DICtrgV.f.PosExeImmet  = 1;                  /* 当前位置已经完成,下一位置可以执行*/
                        Pr_DICtrgV.f.PosExeFinishFlg = 1;               /* 位置指令运算完成完成标志  */
                    }
                    /*------------------------------------------------------------------------------*/
                }
                /*----------------------------------------------------------------------------------*/
                else
                {
                    Pr_DICtrgV.PrDelayTimeCnt = 0;                      /* 延时计数器清零处理       */
                    Pr_DICtrgV.f.PosExeFinishFlg = 0;                   /* 位置指令未运算完         */
                }      
                /*----------------------------------------------------------------------------------*/
                /*  位置指令总数累加处理                                                             */
                /*----------------------------------------------------------------------------------*/
                Pr_DICtrgV.PosCmdSum += PosCurvV.PosCmdOut;
                rc = PosCurvV.PosCmdOut;          /* 位置指令输出至位置环指令接口                 */
            }          
            break;
        /*------------------------------------------------------------------------------------------*/
        default:
            break;
        /*------------------------------------------------------------------------------------------*/
    }
    return rc;
}


/****************************************************************************************************/
/*                                                                                                  */
/*                                  定速模式或者定位模式相关配置                                      */
/*                                                                                                  */
/****************************************************************************************************/
USHORT InperRunMode(UCHAR Target)
{
USHORT KX;
    KX = *( &Prm.PathPlan1L + (Target-1) * 4);  
    return KX;
}



/****************************************************************************************************/
/*																									*/
/*		PR模式之DI端子选择位置指令的相关信息														*/
/*                                                  												*/
/****************************************************************************************************/
void InnerPosInformation( USHORT Target )
{
USHORT KX;
USHORT KXL,KXH;
    /*----------------------------------------------------------------------------------------------*/
    Pr_DICtrgV.PosNum       = Target;
    /*----------------------------------------------------------------------------------------------*/
    KX = *( &Prm.PathPlan1L + (Target-1) * 4);  
    Pr_DICtrgV.PosType      = KX & 0x0001;                       //指令类型
    Pr_DICtrgV.PosOption    = ( KX >> 4 ) & 0x0003;              //位置类型
    Pr_DICtrgV.SpeedUnit    = ( KX >> 8 ) & 0x0001;              //速度单位
    KX = *( &Prm.PathPlan1H + (Target-1) * 4);
    Pr_DICtrgV.PrAccTime    = *( &Prm.AccDecT0 + ((KX >> 0 ) & 0x000F));                 // 加速时间(ms) 
    Pr_DICtrgV.PrDecTime    = *( &Prm.AccDecT0 + ((KX >> 4 ) & 0x000F));                 // 减速时间(ms)
    Pr_DICtrgV.PrSpd        = *( &Prm.Spd0     + ((KX >> 8 ) & 0x000F));                 // 目标速度(0.1rpm)
    Pr_DICtrgV.PrDelayTime  = (ULONG)8 * (*( &Prm.DelayT0  + ((KX >> 12) & 0x000F)));    // 延时时间(ms)
    /*----------------------------------------------------------------------------------------------*/
    KXL = *( &Prm.PathPlan2L + (Target-1) * 4);                          // Pr1资料，POS 低16位
    KXH = *( &Prm.PathPlan2H + (Target-1) * 4);                          // Pr1资料，POS 高16位
    Pr_DICtrgV.PrPos = LONGOF( KXL,KXH );
    
}

