/*************** (C) COPYRIGHT 2024  Veichi Technology Co., Ltd*********************************
* File Name          : Mot05_VarDef.c
* Version            : V0.1
* Date               : 2024
* Description        : 系统变量管理
***********************************************************************************************/


#include "Main.h"
RNDWRTD		RndWrtDisable;
 
/* ScanB变量定义 */
BINV    BinV;                           //SCANB输入变量（I/O输入位）、位置/速度/转矩给定等控制参数
BOUTV   BoutV;                          //SCANB输出变量
BORST   BoutRrst;
BINK    BinK;                           // ScanB Input Variables
BOUTK   BoutK;                          // ScanB Output Variables

/* ScanC变量定义 */
CINV    CinV;                           //大部分为I/O输入源和内部SEQ时序标志位
COUTV   CoutV;                          //大部分为监控参数
CORST   CoutRrst;                       //大部分为位置量监控变量输出
CINK    CinK;                           // ScanC Input Variables    SCANC内部输入参数
COUTK   CoutK;                          // ScanC Output Variables   I/O输出和内部时序输出标志

IPRMDAT Iprm;                           //内部变量（大部分为单模块应用）< Initial Calculated Parameters >                      */
GPRMDAT Gprm;                           //根据功能码设定计算获取的全局变量参数

HPRMDAT Hprm;                           //单位转换相关参数< Half Calculated Parameters >

KIOP    KioP;                           // Kernel I/O Service Parameters
KIOV    KioV;                           // Kernel I/O Service Variables

RINV    RinV;                           // 主循环输入参数
ROUTV   RoutV;                          // 主循环输出参数



  
  
/**********************************************************************************************/
/* Function_Name: VarDef_Init        */
/* Description  : 初始化变量处理清零处理
                  调用：Main函数*/
/**********************************************************************************************/
void VarDef_Init(void)
{
    /*---------------------基础系统参数初始化--------------------------------------------------------*/
    MlibResetLONGMemory( &Iprm, sizeof(Iprm) / 2 );
    MlibResetLONGMemory( &Gprm, sizeof(Gprm) / 2 );					 
    MlibResetLONGMemory( &AinK, sizeof( AinK ) / 2 );
    MlibResetLONGMemory( &AoutV,sizeof( AoutV ) / 2 );
    MlibResetLONGMemory( &BoutK, sizeof(BoutK) / 2 );
    MlibResetLONGMemory( &BinV, sizeof(BinV) / 2 );					 
    MlibResetLONGMemory( &BoutV, sizeof(BoutV) / 2 );				 
    MlibResetLONGMemory( &BoutRrst, sizeof(BoutRrst) / 2 );
    MlibResetLONGMemory( &CinV, sizeof(CinV) / 2 );
    MlibResetLONGMemory( &CoutV, sizeof(CoutV) / 2 );				 
    MlibResetLONGMemory( &CoutRrst, sizeof(CoutRrst) / 2 );			 
    MlibResetLONGMemory( &CinK, sizeof(CinK) / 2 );                  
    DriveSeriesSet( );                  // 驱动器系列设置
    ApxInitRippleComp();                // 复位速度脉动补偿计算变量
    LpxInitEhSpeedObserver();           // 相位补偿速度观测器变量初始化
    InitSpeedObserver( );               // 速度观测器变量初始化，考虑删除
    SoftStart_Init( );                  // 速度S曲线参数初始化
    AI12DataInit( );
}

/**********************************************************************************************/
/* Function_Name: IprmcalBitParam000        */
/* Description  : 功能选择基本开关(Pn000)
                  调用：Main函数*/
/**********************************************************************************************/
void	IprmcalBitParam000( void )
{
  
/*--------------------------------------------------------------------------------------------------*/
/*		Pn000.X : 控制模式选择																		*/
/*--------------------------------------------------------------------------------------------------*/
    switch( Prm.b_prm0_0 & 0x000F )
    {
        case 0x00:                          /* 位置控制(脉冲序列指令)		                    */
             Iprm.CtrlModeA = CTRLMODE_POS;
             Iprm.CtrlModeB = CTRLMODE_POS;
             Iprm.CtrlMode  = 0;
             break;
        case 0x01:                          /* 速度控制模式					                    */
             Iprm.CtrlModeA = CTRLMODE_SPD;
             Iprm.CtrlModeB = CTRLMODE_SPD;
             Iprm.CtrlMode  = 1;
             break;
        case 0x02:                          /* 转矩控制						                    */
             Iprm.CtrlModeA = CTRLMODE_TRQ;
             Iprm.CtrlModeB = CTRLMODE_TRQ;
             Iprm.CtrlMode  = 2;
             break;
        case 0x03:                          /* 速度控制模式 <--> 位置控制模式	                */
             Iprm.CtrlModeA = CTRLMODE_SPD;
             Iprm.CtrlModeB = CTRLMODE_POS;
             Iprm.CtrlMode  = 3;
             break;
        case 0x04:                          /* 转矩控制模式 <--> 位置控制模式	                */
             Iprm.CtrlModeA = CTRLMODE_TRQ;
             Iprm.CtrlModeB = CTRLMODE_POS;
             Iprm.CtrlMode  = 4;
             break;
        case 0x05:                          /* 速度控制模式 <--> 转矩控制模式	                */
             Iprm.CtrlModeA = CTRLMODE_SPD;
             Iprm.CtrlModeB = CTRLMODE_TRQ;
             Iprm.CtrlMode  = 5;
             break;
        case 0x06:                          /* 速度控制模式 <--> 位置控制模式 <--> 转矩控制模式 */
             Iprm.CtrlModeA = CTRLMODE_SPD;
             Iprm.CtrlModeB = CTRLMODE_POS;
             Iprm.CtrlModeC = CTRLMODE_TRQ;
             Iprm.CtrlMode  = 6;
             break;
        case 0x07:
             Iprm.CtrlModeA = CTRLMODE_VF;
             Iprm.CtrlModeB = CTRLMODE_VF;
             Iprm.CtrlMode  = 7;
             break;
        case 0x08:
            Iprm.CtrlModeA = CTRLMODE_POS_MIT;
            Iprm.CtrlModeB = CTRLMODE_POS_MIT;
            Iprm.CtrlMode  = 8;
            break;
        default:
             KpiSetParamError( &pndef_b_prm0_0 );
             Iprm.CtrlMode  = 0;
             break;
    }
    Iprm.CtrlModeInit = CTRLMODE_SPD;
    /*------------------------------------------------------------------------------------------*/
    if( Prm.Testpassword == 3322 )  /* 整机老化测试时,强制进入VF模式 */
    {
        Iprm.CtrlModeA = CTRLMODE_VF;
        Iprm.CtrlModeB = CTRLMODE_VF;
    }
/*------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------*/
/*		Pn000.Y : 保留														                        */
/*--------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------*/
/*		Pn000.Z : 机型选择																		    */
/*--------------------------------------------------------------------------------------------------*/
	switch( (Prm.b_prm0_0 >> 8) & 0x000F )
	{
        case 0:                              
            Kprm.f.CanOpenNet   = FALSE;
            Kprm.f.EtherCATNet  = FALSE;
            Kprm.f.StandardType = TRUE;
                
             break;
        case 1:                              
            Kprm.f.CanOpenNet   = TRUE;
            Kprm.f.EtherCATNet  = FALSE;
            Kprm.f.StandardType = FALSE;
            break;
        case 2:                              
            Kprm.f.CanOpenNet   = FALSE;
            Kprm.f.EtherCATNet  = TRUE;
            Kprm.f.StandardType = FALSE;
            break;
        default:
            Kprm.f.CanOpenNet   = FALSE;
            Kprm.f.EtherCATNet  = FALSE;
            Kprm.f.StandardType = TRUE;
            KpiSetParamError( &pndef_b_prm0_0 );
            break;
    }
	/*------------------------------------------------------------------------------------------*/
    if( Prm.Testpassword == 3322 )
    {
        Kprm.f.CanOpenNet   = FALSE;
        Kprm.f.EtherCATNet  = FALSE;
        Kprm.f.StandardType = TRUE;
    }

    /*------------------------------------------------------------------------------------------*/
    /*  无电机测试模式                                                                          */
    /*------------------------------------------------------------------------------------------*/
    if( ((Prm.b_prm0_0 >> 12) & 0x000F ) == 0x0002 )
    {
        Kprm.f.MotorLessTestMode = 1;
    }
    else
    {
        Kprm.f.MotorLessTestMode = 0;
    }
    return;
}
  
  
/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn002 电机旋转方向																	*/
/*																									*/
/****************************************************************************************************/
void	IprmcalBitParam002( void )
{
    switch( Prm.motdir & 0x000F )
    {
        /*--------------------------------------------------------------------------------------*/
        /* 以CCW方向为正向																		*/
        /*--------------------------------------------------------------------------------------*/
        case 0x0000 :
            Iprm.f.RvsDir = FALSE;
			Iprm.DirSign = +1;
            break;
        /*--------------------------------------------------------------------------------------*/
        /* 以CW方向为正向																		*/
        /*--------------------------------------------------------------------------------------*/
        case 0x0001 :
            Iprm.f.RvsDir = TRUE;
			Iprm.DirSign = -1;
            break;
        /*--------------------------------------------------------------------------------------*/
        /* 参数设置异常																			*/
        /*--------------------------------------------------------------------------------------*/
        default:
            KpiSetParamError( &pndef_motdir );
            break;
    }
}


/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn400																				*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam400( void )
{
/*--------------------------------------------------------------------------------------------------*/
/*		Pn400.Y : 转矩控制时速度限制源选择															*/
/*--------------------------------------------------------------------------------------------------*/
    switch( Prm.b_prm400 & 0x00F0 )
    {
        case 0x0000:    Iprm.VrefSpdLmtSEL = 0x0000;    break;
        case 0x0010:    Iprm.VrefSpdLmtSEL = 0x0001;    break;
        case 0x0020:    Iprm.VrefSpdLmtSEL = 0x0002;    break;
        case 0x0030:    Iprm.VrefSpdLmtSEL = 0x0003;    break;
        case 0x0040:    Iprm.VrefSpdLmtSEL = 0x0004;    break;
        default:KpiSetParamError( &pndef_b_prm400 );    break;
    }
}


/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn004 伺服Off & Gr.1时停机方式														*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam004(void)
{
/*--------------------------------------------------------------------------------------------------*/
/*		Pn006.X : 伺服OFF时的停止方法													            */
/*--------------------------------------------------------------------------------------------------*/  
    switch( Prm.b_prm0_04 & 0x000F )
    {
		case 0x0000:        /* 通过DB(动态制动器)来停止电机   */
          Iprm.OffStopMode = STOPMODE_DBSTOPDB;
          Iprm.StopMode = STOPMODE_DBSTOPDB;
          break;
		case 0x0001:        /* 通过DB停止电机，然后解除DB     */
          Iprm.OffStopMode = STOPMODE_DBSTOPFR;
          Iprm.StopMode = STOPMODE_DBSTOPFR;
          break;
		case 0x0002:        /* 不使用DB,将电机设为自由运行状态*/
          Iprm.OffStopMode = STOPMODE_FREERUN;
          Iprm.StopMode = STOPMODE_FREERUN;
          break;
        case 0x0003:        /* 减速停机                       */
          Iprm.OffStopMode = STOPMODE_LDECSTOP; 
          break;
		default:            /* 参数设置异常                   */
          KpiSetParamError( &pndef_b_prm0_04 );   
          break;
    }
}

/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn005  Gr.2时停机方式														        */
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam005(void)
{
    switch( Prm.b_prm0_05 & 0x000F )
    {
		case 0x0000: Iprm.f.G2AlmStopMode = FALSE ;		    break;    /* 零速停止					*/
		case 0x0001: Iprm.f.G2AlmStopMode = TRUE ;		    break;    /* 停止方法与Pn006.1相同      */
		default  : KpiSetParamError( &pndef_b_prm0_05 );	break;    /* 参数设置异常               */
    }
}

/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn006																				*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam006(void)
{

/*--------------------------------------------------------------------------------------------------*/
/*		Pn008.X : 超程(OT)警告检出选择  												            */
/*--------------------------------------------------------------------------------------------------*/ 
    switch( Prm.b_prm0_06 & 0x000F )
    {
		case 0x0000: Iprm.f.OtStopWarn = FALSE ;           break;    /* 不检出						*/
		case 0x0001: Iprm.f.OtStopWarn = TRUE ;            break;    /* 检出                        */
		default  : KpiSetParamError( &pndef_b_prm0_06 );    break;    /* 参数设置异常                */
    }
/*--------------------------------------------------------------------------------------------------*/
/*		Pn008.Y : 抱闸输出方式											            */
/*--------------------------------------------------------------------------------------------------*/   
    switch( Prm.b_prm0_06 & 0x00F0 )
    {
		case 0x0000: Iprm.f.BKsel = FALSE ;                 break;  	//内部控制		   
		case 0x0010: Iprm.f.BKsel = TRUE ;                  break;    	//外部控制 
		default  : KpiSetParamError( &pndef_b_prm0_06 );    break;     
    }
/*--------------------------------------------------------------------------------------------------*/
/*		Pn008.Z : 警告检出选择															            */
/*--------------------------------------------------------------------------------------------------*/
    switch( (Prm.b_prm0_06 >> 8) & 0x000F )
    {
        case 0x00:
            KpiSetWarningMask( WRN_OLF,      FALSE );
            KpiSetWarningMask( WRN_VIB,      FALSE );
            KpiSetWarningMask( WRN_RGOLF,    FALSE );

            KpiSetWarningMask( WRN_PGBAT,    FALSE );
            KpiSetWarningMask( WRN_OF,       FALSE );
            KpiSetWarningMask( WRN_BEOF,     FALSE );
            KpiSetWarningMask( WRN_BOOT,     FALSE );
            //KpiSetWarningMask( WRN_DBOL_LVL, FALSE );
            KpiSetWarningMask( WRN_POWEROFF,   FALSE );
            break;
        case 0x01:
            KPI_WARNINGMSK( WRN_OLF    );
            KPI_WARNINGMSK( WRN_VIB    );
            KPI_WARNINGMSK( WRN_RGOLF  );

            KPI_WARNINGMSK( WRN_PGBAT  );
            KPI_WARNINGMSK( WRN_OF     );
            KPI_WARNINGMSK( WRN_BEOF   );
            KPI_WARNINGMSK( WRN_BOOT   );
            //KPI_WARNINGMSK( WRN_DBOL_LVL );
            KPI_WARNINGMSK( WRN_POWEROFF );
            break;
        default:
            KpiSetParamError( &pndef_b_prm0_06 );
            break;
    }
/*--------------------------------------------------------------------------------------------------*/
/*		Pn008.W : 风扇温度控制															            */
/*--------------------------------------------------------------------------------------------------*/        
    switch( (Prm.b_prm0_06 >> 12) & 0x000F )
    {
        case 0: Iprm.FanContMode = 0;   break;
        case 1: Iprm.FanContMode = 1;   break;
        case 2: Iprm.FanContMode = 2;   break;
        case 3: Iprm.FanContMode = 3;   break;
        case 4: Iprm.FanContMode = 4;   break;
        default:KpiSetParamError( &pndef_b_prm0_06 );break;
    }
}

/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn007	超程(OT)时的停止方法														*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam007(void)
{     
    switch( Prm.b_prm0_07 & 0x000F )
    {
		case 0x0000: Iprm.OtStopMode = OTSTOPMODE_DEFAULT; break; /* 停止方法与Pn004相同            */
        case 0x0001: Iprm.OtStopMode = OTSTOPMODE_ZSTOPZC; break; /* 零速停机并锁轴                 */
        case 0x0002: Iprm.OtStopMode = OTSTOPMODE_ZSTOPFR; break; /* 零速停机后自由运行             */
		default:   KpiSetParamError( &pndef_b_prm0_07 );    break;
    }
    
    switch( Prm.b_prm0_07 & 0x0010 )
    {
		case 0x0000: Iprm.OtPErrorclr = 0; break;                   /* 不清除                       */
        case 0x0010: Iprm.OtPErrorclr = 1; break;                   /* 清除                         */
		default:   KpiSetParamError( &pndef_b_prm0_07 );    break;
    }
}
  
  
  
/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn00B																				*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam00B(void)
{
    /*----------------------------------------------------------------------------------------------*/
    /*  Pn00B.X                                                                                     */
    /*----------------------------------------------------------------------------------------------*/
    switch( Prm.b_prm0_0E & 0x000F )
    {
        case 0x0000:    Iprm.ABSEncMOVSel = TRUE; break;
        case 0x0001:    Iprm.ABSEncMOVSel = FALSE; break;
        default:
          KpiSetParamError( &pndef_b_prm0_0E );
          break;
    }

}

/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn020																				*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam020(void)
{

    /*----------------------------------------------------------------------------------------------*/
    /*  Pn020.X 全闭环功能开关                                                                      */
    /*----------------------------------------------------------------------------------------------*/
    switch( Prm.fcplsel & 0x000F )
    {
        case 0x0000:    Kprm.f.FencUse = FALSE; break;
        case 0x0001:    Kprm.f.FencUse = TRUE;  break;
        default: KpiSetParamError( &pndef_fcplsel ); break;
    }

    /*----------------------------------------------------------------------------------------------*/
    /*  Pn020.Y 全闭环位置反馈切入方式                                                              */
    /*----------------------------------------------------------------------------------------------*/
    switch( Prm.fcplsel & 0x00F0 )
    {
        case 0x0000:    Iprm.f.FencSource = 0; break;
        case 0x0010:    Iprm.f.FencSource = 1; break;
        default: KpiSetParamError( &pndef_fcplsel ); break;
    }
    /*----------------------------------------------------------------------------------------------*/
    /*  Pn020.Z 全闭环脉冲反馈方向                                                             */
    /*----------------------------------------------------------------------------------------------*/
    switch( Prm.fcplsel & 0x0F00 )
    {
        case 0x0000:    Iprm.f.FencDir = 0; break;
        case 0x0100:    Iprm.f.FencDir = 1; break;
        default: KpiSetParamError( &pndef_fcplsel ); break;
    }
}
  
  
/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn00A																				*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam00A(void)
{
/*--------------------------------------------------------------------------------------------------*/
/*		AC/DC 电源输入选择                															*/
/*--------------------------------------------------------------------------------------------------*/
    switch( Prm.b_prm0_0D & 0x000F ) 
    {
        /*------------------------------------------------------------------------------------------*/
        case 0x0000:                                /* AC电源输入：从L1、L2、L3端子输入AC电源       */
            Iprm.f.Dcbus = FALSE;
            break;
        /*------------------------------------------------------------------------------------------*/
        case 0x0001:                                /* DC电源输入：从“+”、“-”之间输入DC电源         */
            Iprm.f.Dcbus = TRUE;
            break;
        /*------------------------------------------------------------------------------------------*/
        default:                                    /* 参数设定异常                                 */
            KpiSetParamError( &pndef_b_prm0_0D );
            break;        
    }
  
/*--------------------------------------------------------------------------------------------------*/
/*		三相输入规格伺服单元的单元输入选择															*/
/*--------------------------------------------------------------------------------------------------*/
    switch( Prm.b_prm0_0D & 0x00F0 )
    {
        /*--------------------------------------------------------------------------------------*/
        case 0x0000:     /* 以三相电源输入使用             */
            Iprm.f.SnglPhBaseDerate = FALSE;
            break;
        /*--------------------------------------------------------------------------------------*/
        case 0x0010:	/* 以单相电源输入使用三相输入规格  */
            Iprm.f.SnglPhBaseDerate = TRUE;
            break;
        /*--------------------------------------------------------------------------------------*/
        default:        /* 参数设定异常                    */
            KpiSetParamError( &pndef_b_prm0_0D );
            break;
    }
   
/*--------------------------------------------------------------------------------------------------*/
/*		电机速度检出方式																			*/
/*--------------------------------------------------------------------------------------------------*/
    switch( Prm.b_prm0_0D & 0x0F00 )
    {
        /*--------------------------------------------------------------------------------------*/
        case 0x0000:    /* 速度检测方式1*/
            Iprm.f.SpdDetMaFil = FALSE;
            break;
        /*--------------------------------------------------------------------------------------*/
        case 0x0100:	/* 速度检测方式2  使用滤波*/
        case 0x0200:
        case 0x0300:
            Iprm.f.SpdDetMaFil = TRUE;
            break;
        /*--------------------------------------------------------------------------------------*/
        default:	/* 参数设定异常 */
            KpiSetParamError( &pndef_b_prm0_0D );
            break;
    }
        
/*--------------------------------------------------------------------------------------------------*/
/*		绝对位置软限位检测功能开关																	*/
/*--------------------------------------------------------------------------------------------------*/
    switch( Prm.b_prm0_0D & 0xF000 )
    {
        /*--------------------------------------------------------------------------------------*/
        case 0x0000:                        /* 软限位功能关闭 */
            Iprm.f.AbsPosLimit = 0;
            break;
        /*--------------------------------------------------------------------------------------*/
        case 0x1000:	                    /*  软限位功能开启 内部软件 */
            Iprm.f.AbsPosLimit = 1;
            break;
        /*--------------------------------------------------------------------------------------*/
        case 0x2000:	                    /*  软限位功能开启 EtherCat */
            Iprm.f.AbsPosLimit = 2;
            break;
        /*--------------------------------------------------------------------------------------*/
        default:
            KpiSetParamError( &pndef_b_prm0_0D );
            break;
        /*--------------------------------------------------------------------------------------*/
    }
}


/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn040	绝对值编码器使用方法														*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam040( void )
{
    /*------------------------------------------------------------------------------------------*/
    /* 标准脉冲型                                                                               */
    /*------------------------------------------------------------------------------------------*/
    if( Kprm.f.EtherCATNet == 0 )
    {
        switch(Prm.absEncuse & 0x000F)
        {
            /*----------------------------------------------------------------------------------*/
            case 0x0000:/* 正常使用多圈编码器 */
                Iprm.f.MulTSingT = 0x0;
                break;
            /*----------------------------------------------------------------------------------*/
            case 0x0001:/* 多圈编码器当做增量式使用 */
                Iprm.f.MulTSingT = 0x1;
                break;
            /*----------------------------------------------------------------------------------*/
            default:	/* 参数设定异常 */
                KpiSetParamError( &pndef_absEncuse );
                break;
        }
    }
    /*------------------------------------------------------------------------------------------*/
    /* 总线型驱动器                                                                             */
    /*------------------------------------------------------------------------------------------*/
    else
    {
        switch(Prm.absEncuse & 0x00F0)
        {
            /*----------------------------------------------------------------------------------*/
            case 0x0000:/* 正常使用多圈编码器 */
                Iprm.f.MulTSingT = 0x0;
                break;
            /*----------------------------------------------------------------------------------*/
            case 0x0010:/* 多圈编码器当做增量式使用 */
                Iprm.f.MulTSingT = 0x1;
                Iprm.f.MulTSing  = 0x0;
                break;
            case 0x0020:/* 单圈绝对值编码器                                                     */
                Iprm.f.MulTSingT = 0x1;
                Iprm.f.MulTSing  = 0x1;
                break;
            /*----------------------------------------------------------------------------------*/
            default:	/* 参数设定异常 */
                KpiSetParamError( &pndef_absEncuse );
                break;
        }
    }
    /*------------------------------------------------------------------------------------------*/
    /* 进入测试模式1 或者测试模式2 时,不对编码器电池进行校验处理                                */
    /*------------------------------------------------------------------------------------------*/
    if( Iprm.FATest1 == 1  || Iprm.FATest2 == 1 )
    {
        Iprm.f.MulTSingT = 0x1;                          /* 多圈绝对值编码器当增量式编码器使用  */
    }
}

/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn041	电池电压不足警报/警告选择													*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam041( void )
{
    switch( Prm.absEncalm & 0x000F )
    {
        /*--------------------------------------------------------------------------------------*/
        case 0x00:	/* 警报*/
                    Iprm.f.BatWrnMode = FALSE;
                    break;
        /*--------------------------------------------------------------------------------------*/
        case 0x01:	/* 警告*/
                    Iprm.f.BatWrnMode = TRUE;
                    break;
        /*--------------------------------------------------------------------------------------*/
        default:	/* 参数设定异常 */
                    KpiSetParamError( &pndef_absEncalm );
                    break;
    }
}


/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn045	欠电压时转矩限制选择														*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam045( void )
{
    /*------------------------------------------------------------------------------------------*/
    switch( Prm.UvModeSel & 0x000F )
    {
        /*--------------------------------------------------------------------------------------*/
        case 0x00:
            Iprm.f.UvTrqLmtCtrl = FALSE;
            KpiSetWarningMask( WRN_UV, TRUE );
            break;
        /*--------------------------------------------------------------------------------------*/
        case 0x01:
            Iprm.f.UvTrqLmtCtrl = FALSE;
            KpiSetWarningMask( WRN_UV, FALSE );
            break;
        /*--------------------------------------------------------------------------------------*/
        case 0x02:
            Iprm.f.UvTrqLmtCtrl = TRUE;
            KpiSetWarningMask( WRN_UV, FALSE );
            break;
        /*--------------------------------------------------------------------------------------*/
        default:
            KpiSetParamError( &pndef_UvModeSel );
            break;
    }
}
 
  
/****************************************************************************************************/
/*																									*/
/*	基本功能设定 Pn200																				*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam200(void)
{
 
/*--------------------------------------------------------------------------------------------------*/
/*		Pn002.X : 位置模式下指令源选择																*/
/*--------------------------------------------------------------------------------------------------*/
    switch ( Prm.prstsw & 0x000F )
    {
        case 0x0000:     /* 低速脉冲 */
                        Iprm.POSSource = 0;     /* 外部脉冲给定(CN1)                */
                        break;
        case 0x0001:     /* 高速脉冲 */
                        Iprm.POSSource = 1;     /* 外部脉冲给定(CN1)       			*/
                        break;
        case 0x0002:
                        Iprm.POSSource = 2;     /* 外部脉冲给定(CN5)                */
                        break;
        case 0x0003:
                        Iprm.POSSource = 3;     /* Pr模式                           */
                        break;
        default:KpiSetParamError( &pndef_prstsw );    break;
    }
}
 
  
  
/****************************************************************************************************/
/*																									*/
/*		齿隙补偿控制开关                															*/
/*                                                      											*/
/****************************************************************************************************/
void IprmcalBitParam220( void )
{
    /*----------------------------------------------------------------------------------------------*/
    /* 齿隙补偿开关                                                                                 */
    /*----------------------------------------------------------------------------------------------*/
    switch( Prm.cmctrlexsw & 0x000F )
    {
        case 0x0000:	Iprm.BacklashEn = 0x00; break;	                /* 无效                     */
        case 0x0001:    Iprm.BacklashEn = 0x01; break;	                /* 有效			            */
        default :       KpiSetParamError( &pndef_cmctrlexsw ); break;
    }
    /*----------------------------------------------------------------------------------------------*/
    /* 齿隙补偿方向                                                                                 */
    /*----------------------------------------------------------------------------------------------*/
    switch( Prm.cmctrlexsw & 0x00F0 )
    {
        case 0x0000:    Iprm.BacklashDir = FOR_BACKLASH; break;	        /* 正向补偿                 */
        case 0x0010:    Iprm.BacklashDir = REV_BACKLASH; break;	        /* 反向补偿                 */
        default :       KpiSetParamError( &pndef_cmctrlexsw ); break;
    }
}


/****************************************************************************************************/
/*																									*/
/*		外部脉冲指令倍率切入选择        															*/
/*                                                      											*/
/****************************************************************************************************/
void IprmcalBitParam271( void )
{
    switch( Prm.PulseSel & 0x000F )
    {
        case 0x00:	Iprm.PGAINSet = 0x00; break;	            /* 强制无效                     */
        case 0x01:  Iprm.PGAINSet = 0x01; break;	            /* 强制有效			            */
        case 0x02:  Iprm.PGAINSet = 0x02; break;	            /* 外部端子来进行切换			*/
        default :	KpiSetParamError( &pndef_PulseSel ); break;
    }
}

/****************************************************************************************************/
/*																									*/
/*		外部信号清除信号形态               															*/
/*                                                      											*/
/****************************************************************************************************/
void IprmcalBitParam272( void )
{
    switch( Prm.prstsw_1 & 0x0F )
    {
        case 0x00:	Iprm.PerClrSigSel = 0x00; break;	/* 高电平                               */
        case 0x01:  Iprm.PerClrSigSel = 0x01; break;	/* 上升沿			                    */
        case 0x02:  Iprm.PerClrSigSel = 0x02; break;	/* 低电平			                    */
        case 0x03:  Iprm.PerClrSigSel = 0x03; break;	/* 下降沿			                    */
        default :	KpiSetParamError( &pndef_prstsw_1 ); break;
    }
}

/****************************************************************************************************/
/*																									*/
/*		脉冲偏差清除动作选择设定           															*/
/*                                                      											*/
/****************************************************************************************************/
void IprmcalBitParam273( void )
{
    switch( Prm.prstsw_2 & 0x0F )
    {
        case 0x00:	Iprm.PerClrMode = 0x00; break;		/* 伺服OFF和发生报警时清除位置偏差      */
        case 0x01:	Iprm.PerClrMode = 0x01; break;		/* 只能通过CLR信号清除					*/
        case 0x02:	Iprm.PerClrMode = 0x02; break;		/* 发生报警时+CLR信号清除偏差			*/
        case 0x03:	Iprm.PerClrMode = 0x03; break;		/* 不清除位置偏差脉冲(CLR信号忽略)		*/
        default :	KpiSetParamError( &pndef_prstsw_2 ); break;
    }
/*--------------------------------------------------------------------------------------------------*/
/*		位置偏差エッジクリア選択設定			Position deviation edge clear selection set         */
/*--------------------------------------------------------------------------------------------------*/
    if( ((Iprm.PerClrSigSel == 0x01)||(Iprm.PerClrSigSel == 0x03))&&(Iprm.PerClrMode != 0x03) )
    {
        Iprm.f.PerClrEdge = TRUE;					/* CLR信鐨勎エッジで、偏差クリアする		*/
    }
    else
    {
        Iprm.f.PerClrEdge = FALSE;					/* CLR信鐨勎エッジで、偏差クリアしない		*/
    }
/*--------------------------------------------------------------------------------------------------*/
    return;
}


void IprmcalBitParam300( void )
{

/*--------------------------------------------------------------------------------------------------*/
/*		Pn300.X : 速度模式下指令源选择																*/
/*--------------------------------------------------------------------------------------------------*/
    Iprm.SPDSource = (Prm.spdSource & 0x000F);
}

/****************************************************************************************************/
/*																									*/
/*		磁编码器位置跳动抑制              															*/
/*                                                      											*/
/****************************************************************************************************/
void IprmcalBitParam78F( void )
{
    if( (Prm.PosJump & 0x0001) ==  0x0000 )
    {
        Iprm.iCHausAdj = 0;
    }
    else
    {
        //icHaus校准模式必须在IF模式下有效打开，其他模式下打开报Er040
        Iprm.iCHausAdj = 1;
        if((Prm.b_prm0_0 & 0x000F) != 0x07)
        {
            KpiSetParamError( &pndef_PosJump );
        }
    }
}

/****************************************************************************************************/
/*																									*/
/*		增量式编码器控制开关              															*/
/*                                                      											*/
/****************************************************************************************************/
void IprmcalBitParam795( void )
{

/*--------------------------------------------------------------------------------------------------*/
/*		Pn792.X : 霍尔信号WVW使用方法																*/
/*--------------------------------------------------------------------------------------------------*/
    switch( Prm.IncEncBit & 0x000F )
    {
        case 0x0000: Iprm.IncEncHallSel = 0x00; break;          /* 使用内部默认值               */
        case 0x0001: Iprm.IncEncHallSel = 0x01; break;          /* 使用外部用户设定值           */
        default    : KpiSetParamError( &pndef_IncEncBit ); break;
    }
/*--------------------------------------------------------------------------------------------------*/
/*		Pn792.Y : 编码器Z信号锁存值使用方法															*/
/*--------------------------------------------------------------------------------------------------*/
    switch( (Prm.IncEncBit >> 4) & 0x000F )
    {
        case 0x0000: Iprm.IncEncZlachSel = 0x00; break;         /* 使用内部默认值               */
        case 0x0001: Iprm.IncEncZlachSel = 0x01; break;         /* 使用外部用户设定值           */
        default    : KpiSetParamError( &pndef_IncEncBit ); break;
    }
/*--------------------------------------------------------------------------------------------------*/
/*		Pn792.Z : 增量式编码器分辨率使用方法														*/
/*--------------------------------------------------------------------------------------------------*/
    switch( (Prm.IncEncBit >> 8) & 0x000F )
    {
        case 0x0000: Iprm.IncEncResSel = 0x00; break;	        /* 使用内部默认值               */
        case 0x0001: Iprm.IncEncResSel = 0x01; break;           /* 使用外部用户设定值           */
        default    : KpiSetParamError( &pndef_IncEncBit ); break;
    }
/*--------------------------------------------------------------------------------------------------*/
    return;
}

/****************************************************************************************************/
/*																									*/
/*		厂家测试模式密匙                   															*/
/*                                                      											*/
/****************************************************************************************************/
void IprmcalBitParam79E( void )
{
    if( Prm.Testpassword == 3322 )
    {
        Iprm.FATest1 = 1;                                   /* 整机测试                             */
        Iprm.FATest2 = 0;
    }
    else if( Prm.Testpassword == 4499 )
    {
        Iprm.FATest1 = 0;
        Iprm.FATest2 = 1;                                   /* 单板测试                             */
    }
    else
    {
        Iprm.FATest1 = 0;
        Iprm.FATest2 = 0;      
    }
}


/****************************************************************************************************/
/*																									*/
/*		系统控制开关                    															*/
/*                                                      											*/
/****************************************************************************************************/
void IprmcalBitParamE1C( void )
{
      
	/*--------------------------------------------------------------------------------------*/
    /* 1.自举功能开关                                                                       */
    /*--------------------------------------------------------------------------------------*/     
	if(( Prm.syssw2 & 0x1000 ) == 0x0000)
    {
        Iprm.MosfetPumpFlag = 0x01;              /* 自举开启                     */            
    }
    else
    {
        Iprm.MosfetPumpFlag = 0x00;              /* 自举关闭                     */            
    }
	return;
}

/****************************************************************************************************/
/*																									*/
/*		速度环P/PI控制开关(Pn130)					*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*		Pn130.X : 模式开关选择(P控制/PI控制) --> PcalBitParamMSW()									*/
/*		Pn130.Y : 速度环的控制方法选择设定															*/
/*		Pn130.Z : 相位补偿速度观测器																*/
/*																									*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParam10B( void )
{

/*--------------------------------------------------------------------------------------------------*/
/*		Pn130.1 : 速度环的控制方法选择设定															*/
/*--------------------------------------------------------------------------------------------------*/
    switch( (Prm.gnmode >> 4) & 0x0F )
    {
        case 0x00:  
                    Iprm.f.IPSpdControl = FALSE;
                    break;
        case 0x01:
                    Iprm.f.IPSpdControl = TRUE;
                    break;
		default :	
                    KpiSetParamError( &pndef_gnmode );
                    break;
    }
/*--------------------------------------------------------------------------------------------------*/
/*		Pn130.Z : 相位补偿速度观测器设置                                                        */
/*--------------------------------------------------------------------------------------------------*/
	IprmcalEhSpeedObserver();
 
	return;
}
 
 
  
  
  

/****************************************************************************************************/
/*																									*/
/*	基本功能设定 PnF1E																				*/
/*																									*/
/****************************************************************************************************/
void IprmcalBitParamF1F(void)
{

/*--------------------------------------------------------------------------------------------------*/
/*	速度反馈第二滤波																			    */
/*--------------------------------------------------------------------------------------------------*/
	if(( Prm.flg_wf & 0x0004 ) || (MencP.f.TuningLessLowGainMotor == TRUE))
	{
		Iprm.SpdFbLpassFil = Prm.fbfil2;
	}
	else
	{
		Iprm.SpdFbLpassFil = 0;
	}
}
  
  
  
/**********************************************************************************************/
/* Function_Name: HprmCommonMotorParamCal                                                  */   
/* Description  : 电机通用中间参数计算
        	调用：  Main_Init  main函数*/
/**********************************************************************************************/
void HprmCommonMotorParamCal( void )
{
	LONG kx,
		 sx;
	float fw;
  
/*--------------------------------------------------------------------------------------------------*/
/*		位置控制增益参数的计算					*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*				Kfbpls * 2^24						Kfbpls :	[rad/pulse]		[m/pulse]			*/
/*		Kpx = -----------------						OvrSpd :	[rad/s]			[m/s]				*/
/*				   OvrSpd																			*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/

	Hprm.Kpx = MlibScalKxksks( 0x1000000, Bprm.Kfbpls, Bprm.OvrSpd, &sx, -1 );
 	Hprm.fKpx = 16777216.0f * Bprm.fKfbpls / Bprm.fOvrSpd;

/*--------------------------------------------------------------------------------------------------*/
/*		速度控制增益参数的计算						Rotary			Linear				*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*				2*PAI * OvrSpd * Jmot				OvrSpd :	[rad/s]			[m/s]				*/
/*		Kvx = -------------------------				Jmot   :	[kg*m^2]		[kg]				*/
/*					  MaxTrq						MaxTrq :	[Nm]			[N]					*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
	kx			 = MlibScalKskxkx( Bprm.OvrSpd, C2PAIE7, C10POW7, &sx, 0 );
	kx			 = MlibPcalKxksks( kx, Bprm.Jmot, Bprm.MaxTrq, &sx, -1 );
	Hprm.Kvx	 = kx;
 	fw = Bprm.fOvrSpd * (float)C2PAIE7 / (float)C10POW7;
	Hprm.fKvx = fw * Bprm.fJmot / Bprm.fMaxTrq;
  
/*--------------------------------------------------------------------------------------------------*/
/*		电机速度计算				Rotary			Linear				*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*					Kmotpls * 2^24					Kmotpls :	[rad/pulse]		[m/pulse]			*/
/*		Kmotspd = ------------------				OvrSpd	:	[rad/s]			[m/s]				*/
/*						OvrSpd																		*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
	
 	Hprm.Kmotspd = MlibScalKxksks( 0x1000000, Bprm.Kmotpls, Bprm.OvrSpd, &sx, -1 );
 	Hprm.fKmotspd = (float)16777216.0f * Bprm.fKmotpls / Bprm.fOvrSpd;

 	if( Kprm.f.FencUse )
    {
        Hprm.KmotspdFC = MlibScalKxksks( 0x1000000, Bprm.KmotplsFC, Bprm.OvrSpd, &sx, -1 );
        Hprm.fKmotspdFC = (float)0x1000000 * (float)Bprm.KmotplsFC / Bprm.fOvrSpd;
    }
  
/*--------------------------------------------------------------------------------------------------*/
/*		位置速度增益参数的计算						Rotary			Linear				*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*						  Jmot * 2^24				Kfbpls :	[rad/pulse]		[m/pulse]			*/
/*		Kpvx = Kfbpls * ---------------				Jmot   :	[kg*m^2]		[kg]				*/
/*							MaxTrq					MaxTrq :	[Nm]			[N]					*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
	  
 	kx		  = MlibScalKskxkx( Bprm.Kfbpls, 0x1000000, 1, &sx, 0 );
	kx		  = MlibPcalKxksks( kx, Bprm.Jmot, Bprm.MaxTrq, &sx, -1 );
	Hprm.Kpvx = kx;
 	return;
}
  
  
  
/**********************************************************************************************/
/* Function_Name: IprmcalUnitTransFacter        */
/* Description  : 标幺化系数的计算*/
  
/**********************************************************************************************/
void	IprmcalUnitTransFacter( void )
{
float fkx;
 
/*--------------------------------------------------------------------------------------------------*/
/*		Position level calculation coefficient   : Command Pulse     --> Feedback Pulse				*/
/*		Speed level calculation coefficient      : 0.1r/min, 0.1mm/s --> NormalizedSpeed  [2^24/OvrSpd]	*/
/*		Torque level calculation coefficient     : 0.01%             --> NormalizedTorque [2^24/MaxTrq]	*/
/*		Torque level calculation coefficient     : 0.01%             --> NormalizedTorque [15000/MaxTrq]*/
/*--------------------------------------------------------------------------------------------------*/

    Iprm.Kposlvl  = MlibScalKxgain( 1, Iprm.Egear.b, Iprm.Egear.a, NULL, 24 );
    Iprm.Kspdlvl  = MlibScalKskxkx( Bprm.Knorspd, 1, 10, NULL, 24 );
    Iprm.Ktrqlvl  = MlibScalKxgain( 1, 0x01000000, (100 * Bprm.PerMaxTrq), NULL, 24 );
    Iprm.Ktrqlvls = MlibScalKxgain( 1, 15000,      (100 * Bprm.PerMaxTrq), NULL, 24 );
    Iprm.fKspdlvl  = Bprm.fKnorspd / 10.0f;
    Iprm.fKtrqlvl  = 1.0f * 16777216.0f / (100.0f * Bprm.fPerMaxTrq);
    Iprm.fKtrqlvls = 1.0f * 15000.0f / (100.0f * Bprm.fPerMaxTrq);
  
  
/*--------------------------------------------------------------------------------------------------*/
/*		归一化速度计算系数 : r/min, mm/s --> NormalizedSpeed										*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*		Bprm.Knorspd : r/min --> NormalizedSpeed	Rotary Motor									*/
/*		Bprm.Knorspd : mm/s  --> NormalizedSpeed	Linear Motor  									*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
 	 
  
    Iprm.Knorspd = MlibScalKskxkx( Bprm.Knorspd, 1, 1, NULL, 24 );
 
  
/*--------------------------------------------------------------------------------------------------*/
/*		Normalization torque command calculation coefficient : %RatedTorque --> NormalizedTorque    */
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*						   2^24																		*/
/*		Iprm.Knortrq = -------------						Bprm.PerMaxTrq : [%]					*/
/*						 PerMaxTrq																	*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
  
  
    Iprm.Knortrq = MlibScalKxgain( 1, 0x01000000, Bprm.PerMaxTrq, NULL, 24 );
 
  
/*--------------------------------------------------------------------------------------------------*/
/*		Monitor for speed calculation coefficient : NormalizedSpeed --> r/min, mm/s					*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*		Bprm.Knorspd : r/min --> NormalizedSpeed	Rotary Motor									*/
/*		Bprm.Knorspd : mm/s  --> NormalizedSpeed	Linear Motor  									*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
  
  
  
    Iprm.Kmonspd = MlibScalKskxkx( Bprm.NorspdConv,   1, 1, NULL, 48 );
    Iprm.Kmonspd1 = MlibScalKskxkx( Bprm.NorspdConv, 10, 1, NULL, 48 );
    Iprm.Kmonspdrads    = MlibScalKskxkx( Bprm.NorspdConv, 62832, 60, NULL, 48 );
#if(FLOAT_USE == 1)
    Iprm.fKmonspd = Bprm.fNorspdConv;
    Iprm.fKmonspd1 = Bprm.fNorspdConv * 10.0f;
#endif
  
  
/*--------------------------------------------------------------------------------------------------*/
/*		Monitoring torque command calculation coefficient : NormalizedTorque --> %RatedTorque		*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*						 PerMaxTrq																	*/
/*		Iprm.Kmontrq = -------------						Bprm.PerMaxTrq : [%]					*/
/*						   2^24																		*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
  
  
    Iprm.Kmontrq = MlibScalKxgain( Bprm.PerMaxTrq, 1, 0x01000000, NULL, 24 );
    Iprm.kmontrq1 = MlibScalKxgain( Bprm.PerMaxTrq, 10, 0x01000000, NULL, 24 );
    Iprm.kmontrq2 = MlibScalKxgain( Bprm.PerMaxTrq, 100, 15000, NULL, 24 );
#if(FLOAT_USE == 1)
    Iprm.fKmontrq  = 1.0f   * Bprm.fPerMaxTrq / 16777216.0f;
    Iprm.fkmontrq1 = 10.0f  * Bprm.fPerMaxTrq / 16777216.0f;
    Iprm.fkmontrq2 = 100.0f * Bprm.fPerMaxTrq / 15000.0f;
#endif
  
  
/*--------------------------------------------------------------------------------------------------*/
/*		监控用指令脉冲胜算增益的计算 (Un007)	                                            */
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*							 Egear.b * Hprm.Kmotspd * 1000000  										*/
/*		Iprm.Kmonpcmdspd = -------------------------------------		Xcycle : 64ms				*/
/*							 Egear.a * Bprm.Knorspd * Xcycleus 										*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
  
  
#if(FLOAT_USE == 1)
    fkx = 1.0f * Iprm.Egear.fb / Iprm.Egear.fa;
    fkx = fkx * Hprm.fKmotspd / Bprm.fKnorspd;
    Iprm.fKmonpcmdspd = fkx * 1000000.0f / ((float)SVCDEF_UNSPD_SCMEANTMMS * 1000.0f);
#else
    kx = MlibScalKxgain( 1,  Iprm.Egear.b, Iprm.Egear.a, &sx,  0 );
    kx = MlibPcalKxksks( kx, plsno, Bprm.Knorspd, &sx,  0 );
    Iprm.Kmonpcmdspd = MlibPcalKxgain( kx, 1000000, ((ULONG)SVCDEF_UNSPD_SCMEANTMMS * 1000), &sx, 24 );
#endif
  
/*--------------------------------------------------------------------------------------------------*/
/*		监控用指令脉冲胜算增益的计算                                                      */
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*							 	Egear.b * Hprm.Kmotspd * 1000000  									*/
/*		Iprm.Kmonpcmdspd2ms = ----------------------------------------		Xcycle : 2ms			*/
/*							 	Egear.a * Bprm.Knorspd * Xcycleus 									*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
	  
#if(FLOAT_USE == 1)
    fkx = 1.0f * Iprm.Egear.fb / Iprm.Egear.fa;
    fkx = fkx * Hprm.fKmotspd / Bprm.fKnorspd;
    Iprm.fKmonpcmdspd2ms = fkx * 1000000.0f / (float)KPI_SCCYCLEUS;
#else
    kx = MlibScalKxgain( 1,  Iprm.Egear.b, Iprm.Egear.a, &sx,  0 );
    kx = MlibPcalKxksks( kx, plsno, Bprm.Knorspd, &sx,  0 );
    Iprm.Kmonpcmdspd2ms = MlibPcalKxgain( kx, 1000000, (KPI_SCCYCLEUS), &sx, 24 );
#endif
  
/*--------------------------------------------------------------------------------------------------*/
/*		Calculation of the monitor pulse rate calculation gain : Pulse/Scan --> NormalizedSpeed		*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*							 Hprm.Kpx * 1000000  													*/
/*		Iprm.Knorpulsspd = ----------------------				Xcycle : KPI_SBCYCLEUS				*/
/*							      Xcycleus 															*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/

#if(FLOAT_USE == 1)
    Iprm.fKnorpulsspd = Hprm.fKpx * 1000000.0f / (float)KPI_SBCYCLEUS;
#else
    Iprm.Knorpulsspd = MlibScalKskxkx( Hprm.Kpx, 1000000, KPI_SBCYCLEUS, NULL,  24 );
#endif
  
/*--------------------------------------------------------------------------------------------------*/
/*		Monitor current command calculation factor : NormalizedCurrent --> %RatedCurrent			*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*							PerMaxTrq																*/
/*		Iprm.Kmontrq = -----------------						Bprm.PerMaxTrq : [0.1%]				*/
/*							15000																	*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
  
    Iprm.Kmoncrnt = MlibScalKxgain( Bprm.PerMaxTrq, 10, 15000, NULL, 24 );
    Iprm.fKmoncrnt = Bprm.fPerMaxTrq * 10.0f / 15000.0f;
  
/*--------------------------------------------------------------------------------------------------*/
/*                                                                                                  */
/*                 sqrt(2)                                                                          */
/*      14481   = -------------- × 10 × 2^11                                                        */
/*                     2                                                                            */
/*--------------------------------------------------------------------------------------------------*/

#if(FLOAT_USE == 1)
    Iprm.fKmoncrntA = (float)Prm.imaxs * 7.071067812f;
#else
    Iprm.KmoncrntA = (ULONG)Prm.imaxs * 14482;
#endif
    return;
}
 
  
  
  
  
  
/**********************************************************************************************/
/* Function_Name: IprmcalPcmdOvrSpd        */
/* Description  : 位置指令过冲（OS）的计算
            概要：此函数将根据位置指令生成器的时间,同时结合电子齿轮比的关系,计算出位置指令生成器的最大输出脉冲数 
   					即: Pulse / 125us  <--> 最大速度                                                               
					Bprm.OvrSpd :	rad /s [OvSpeed]														   
					Bprm.Kfbpls :	rad /Pulse																	
					Iprm.Egear.a:	电子齿轮分母																  
					Iprm.Egear.b:	电子齿轮分子 */
/**********************************************************************************************/
void	IprmcalPcmdOvrSpd( void )
{
LONG	kx,sx;
    kx = MlibScalKxksks( 1,  Bprm.OvrSpd,    Bprm.Kfbpls,  &sx,  0 );
    kx = MlibPcalKxgain( kx, Iprm.Egear.a,   Iprm.Egear.b, &sx,  0 );
    kx = MlibPcalKxgain( kx, Iprm.SvCycleNs, 1000000000,   &sx, 24 );
    Iprm.PcmdOvrSpd = kx;
    return;
}
  
  
  
/****************************************************************************************************/
/*																									*/
/*		伺服控制周期的计算																		    */
/****************************************************************************************************/
void	IprmcalServoCycle( void )
{
    Iprm.SvCycleUs  = KPI_SBCYCLEUS;
    Iprm.SvCycleNs  = KPI_SBCYCLENS;
    return;
}
  

/****************************************************************************************************/
/*																									*/
/*		系统开关设置(PnE1C/E1D)															    */
/****************************************************************************************************/
  
void	IprmcalSystemSwitch( void )
{
  
/*--------------------------------------------------------------------------------------------------*/
/*		系统开关                                                                  */
/*--------------------------------------------------------------------------------------------------*/
  
    Iprm.f.SpdIctrlKeep = ( Prm.syssw1 & 0x1000 )? TRUE  : FALSE;   /* 速度控制积分保持          */
	Iprm.f.RegRxIn = ( Prm.syssw2 & 0x0001 )? TRUE  : FALSE;        /* 再生制动保护             */
    Iprm.f.EepPrmWrite  = ( Prm.syssw3 & 0x0001 )? TRUE : FALSE;    /* 参数写入保护             */
        
	return;
}
 
  
  
  
  
  
  
  
/*--------------------------------------------------------------------------------------------------*/

/*		电压检测滤波器选择开关设定(PnE14)														    */
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*		PnE7A.Bit0,1 : 主电路电压检测异常检测滤波器		( 00-11 / 0us-750us , 250us )			*/
/*		PnE7A.Bit2,3 : 过电压报警检测滤波器				( 00-11 / 0us-750us , 250us)			*/
/*		PnE7A.Bit4,5 : 再生动作开始滤波器				( 00-11 / 0us-750us , 250us )			*/
/*		PnE7A.Bit6,7 : 再生动作结束滤波器				( 00-11 / 0us-750us , 250us )			*/
/*--------------------------------------------------------------------------------------------------*/
 void	IprmcalVdetfilSwitch( void )
{
USHORT	swbuf;
    swbuf = Prm.vdefilsw;
/*--------------------------------------------------------------------------------------------------*/
/*		各种过滤器设置							                                                */
/*--------------------------------------------------------------------------------------------------*/

    Iprm.VdcdetAlmFilter	= swbuf & 0x0007;			/* 主电路检测异常报警滤波器		*/
    Iprm.OvdetAlmFilter		= ( swbuf >> 4 ) & 0x0007;	/* 过电压报警检测滤波器			*/
    Iprm.RegStartFilter		= ( swbuf >> 8 ) & 0x0007;	/* 再生动作开始滤波器					*/
    Iprm.RegStopFilter		= ( swbuf >> 12 ) & 0x0007;	/* 再生动作结束滤波器					*/
    return;

}


/**********************************************************************************************/
/* Function_Name: IprmcalTorqueLevel                                                           */
/* Description  : 最大转矩值
        	概要：*/
/**********************************************************************************************/
void	IprmcalTorqueLevel( void )
{
    Iprm.TrefonLevel = MlibScalKxgain( 0x01000000, 10, Bprm.PerMaxTrq, NULL, -24 );
    return;
}
  
  
  
/**********************************************************************************************/
/* Function_Name: APL_IprmVarInit                                                             */
/* Description  : 功能码参数初始化
        	概要：功能码参数初始化获取,主要是针对重新上电的功能码进行相关的处理*/
/**********************************************************************************************/
void IprmVarInit(void)
{
    IprmcalServoCycle();		//伺服控制周期的计算
    IprmcalTuningLessSW();   	// 免调整开关
    IprmcalBitParamE1C( );      // PnE1C 初始化     
    IprmcalBitParam79E( );      // Pn79E 初始化     
 	IprmcalBitParam000( );		// Pn000 初始化	 
    IprmcalBitParam002( );
    IprmcalBitParam004( );			// Pn004 初始化
    IprmcalBitParam005( );			// Pn005 初始化
    IprmcalBitParam006( );          // Pn006 初始化
	IprmcalBitParam007( );			// Pn007 初始化
		 
  
	IprmcalBitParam00A( );			// Pn00A 初始化
    IprmcalBitParam00B( );          // Pn00B 初始化
          
    IprmcalBitParam020( );   	    // Pn020 初始化        
    IprmcalBitParam040( );
    IprmcalBitParam041( );
    IprmcalBitParam045( );
    IprmcalBitParam10B( );    		// Pn130 初始化      
    IprmcalBitParam200( );          // Pn200 初始化 
    IprmcalBitParam220( );          // Pn220 初始化
    IprmcalBitParam271( );          // Pn271 初始化
    IprmcalBitParam272( );          // Pn272 初始化
    IprmcalBitParam273( );          // Pn273 初始化          
    IprmcalBitParam300( );          // Pn300 初始化
    IprmcalBitParam400( );          // Pn400 初始化
    IprmcalBitParam78F( );          // Pn78F 初始化
    IprmcalBitParam795( );          // Pn795 初始化           
    IprmcalBitParamF1F( );			// PnF1E 初始化
    IprmcalSystemSwitch( );         // 系统开关 
     
    IprmcalElectronicGear( );		// 电子齿轮比计算
    IprmcalUnitTransFacter( );      // 基本参数初始化(Attention:需要在电子齿轮比之后) 
    IprmcalVdetfilSwitch( );		// 母线滤波处理
    PcalVelRippleComp( );			// 电流纹波补偿

    IprmcalFullClosedEnc( );        // 全闭环编码器初始化
    KpxInitFullClosedEncoder( );    // TODO 全闭环控制参数初始化

    //CompParaInitFromEEP();          // TODO 全闭环编码器补偿参数初始化

    //KTH78_Init( );                  // TODO 昆泰芯编码器初始化
    IprmcalMotorPhaseInit( );		// 电机初始相位的获取
    IprmcalVibrationDetect();       // 振动检测 
    IprmcalPcmdOvrSpd();            // 程序JOG最大速度值 
    IprmcalPrgJog();                // 程序JOG 相关变量赋值 
    IprmcalPcmdOvrSpd();            // 零速箝位参数计算 
    IprmcalEasyFft();               // Easy FFT 相关变量赋值初始化 
    IprmcalMfcTypeSel();            // 模型追踪类型 
    IprmcalRegenePowerGain();       // 再生制动保护初始化  
    IprmAbsPosSoftLimit( );         // 绝对位置软限位 
    IprmcalMotorOverrun( );         // 飞车故障相关参数计算 
    IprmcalOverLoadLevelAmpMot( );  // 电机&驱动器过载阈值计算
    IprmcalCurrentLoadGain();       // 累积负载率监控系数初始化  
    IprmcalTorqueLevel();           // 最大转矩 
#if ( SVFSEL_BLSH_COMMON_PROC )
    IprmcalMaxBlshCompPulse();   	// 齿隙补偿初始化     
#endif
    IprmMotorLessTestMode();        // 无电机测试模式变量初始化 
 }
 
/****************************************************************************************************/
/*                               The End of the file                                                */
/****************************************************************************************************/
