/*
 * User00_Main.h
 *
 *  Created on: 2022年7月9日
 *      Author: zhuxc
 */

#ifndef User00_Main_H
#define User00_Main_H


#include "Lib00_Main.h"
#include "User06_ErrorDef.h"
#include "User08_FunMngr.h"
#include "User09_Mondef.h"
#include "User10_MonMngr.h"
#include "User11_RegMngr.h"
#include "User12_FunOpeRegDef.h"
#include "User13_DataTraceMngr.h"
#include "User14_DataTraceDef.h"
#include "User15_UartifMbus.h"
#include "User16_USBifMbus.h"
#include "User17_CommMngr.h"
#include "User18_MeModbus.h"
#include "User21_AlmLatchMonitor.h"
#include "UserC_PosCmdSource.h"
#include "UserC_InnerSourceTrig.h"
/*--------------------------------------------------------------------------------------------------*/
/*                                      CanOpen 头文件                                             */
/*--------------------------------------------------------------------------------------------------*/
#include "Can00_Main.h"

/*--------------------------------------------------------------------------------------------------*/
/*                                      辅助功能 头文件                                                */
/*--------------------------------------------------------------------------------------------------*/
#include "Fn_Main.h"
/*--------------------------------------------------------------------------------------------------*/
/*                                      位置环头文件                                              */
/*--------------------------------------------------------------------------------------------------*/
#include "Pos00_Main.h"
#include "Pr00_Main.h"
/*--------------------------------------------------------------------------------------------------*/
/*                                      速度环头文件                                              */
/*--------------------------------------------------------------------------------------------------*/
#include "Spd00_Main.h"

/*--------------------------------------------------------------------------------------------------*/
/*                                      电流环头文件                                              */
/*--------------------------------------------------------------------------------------------------*/
#include "Cur00_Main.h"

/*--------------------------------------------------------------------------------------------------*/
/*                                      EtherCAT 头文件                                                */
/*--------------------------------------------------------------------------------------------------*/
#include "EtherCAT_Main.h"
/*--------------------------------------------------------------------------------------------------*/
/*                                      特殊头文件                                                   */
/*--------------------------------------------------------------------------------------------------*/

#include "UserD_Task.h"
/*--------------------------------------------------------------------------------------------------*/

#define ARM_Sub_Version   700

typedef struct
{
    USHORT McuVer;          // ARM 软件版本
    USHORT FpgaVer;         // FPGA 软件版本
    USHORT FpgaSubVer;      // FPGA 副版本
    USHORT OrderID;         // 定制版本机型
    USHORT Author;
    ULONG  SnNum;
}SYSTEMVERSION;
extern SYSTEMVERSION SystemVar;



/****************************************************************************************************/
/*                                                                                                  */
/*      Kernel Service Parameter Definition                                                         */
/*                                                                                                  */
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*      Kernel Service Parameters Definition                                                        */
/*--------------------------------------------------------------------------------------------------*/
typedef struct {
    struct {                            // Bit signal
    USHORT    StandardType        :1;   // 标准型
    USHORT    CanOpenNet          :1;   // CanOpen 机型
    USHORT    EtherCATNet         :1;   // EtherCAT机型
    USHORT    MotorLessTestMode   :1;   // 无电机测试模式标志,由Pn00C.0初始化
/*--------------------------------------------------------------------------------------------------*/
    USHORT    DIDOScanEn          :1;   // IO 端子扫描开关
    USHORT    MotB_UpDateFlg      :1;   // 电机B参数更新
    USHORT    AxisNum             :2;   // 轴数

    USHORT    FencUse             :1;     /* 是否使用全闭环，支持(PnE0B.0)&使用(Pn002.3)&连接           */
    USHORT    FencUseFlag         :1;     /* 全闭环使用标志位                                         */
    USHORT    FencType            :1;     /* 是否支持全闭环  PnE0B.0 */

    USHORT    Spare               :6;   // Spare
    } f;
/*--------------------------------------------------------------------------------------------------*/
    USHORT  AmpType;                    // 驱动器类型设置(旋转/直线型)
/*--------------------------------------------------------------------------------------------------*/
    USHORT  PnPrmTblEntNum;             // 参数表个数
/*--------------------------------------------------------------------------------------------------*/
} KPRMDAT;
/*--------------------------------------------------------------------------------------------------*/
/*      Extern Variables Definition                                                                 */
/*--------------------------------------------------------------------------------------------------*/
extern  KPRMDAT Kprm;                   /* Kernel Service Parameters                                */



#endif
