/****************************************************************************************************/
/*																									*/
/*																									*/
/*		User15_UartifMbus.h                         											*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#ifndef __User15_UartifMbus_H__
#define __User15_UartifMbus_H__


/****************************************************************************************************/
#define UartModbusEn 1                      /* 0:串口用来发送虚拟示波器数据                         */
                                            /* 1:串口用来运行Modbus 协议                            */
/****************************************************************************************************/
//===================================================================================================
//		Modbus通信指令定义
//===================================================================================================
#define	MBUS_RCV_MAXSIZEB		256			// MODBUS消息接收最大尺寸（以字节为单位）
#define	MBUS_TRN_MAXSIZEB		256			// MODBUS消息发送最大尺寸（以字节为单位）
//--------------------------------------------------------------------------------------------------
//		Modbus标准命令码
//--------------------------------------------------------------------------------------------------
#define MODBUS_REG_RD			0x03		// 读N个字
#define MODBUS_REG_WR			0x06		// 写一个字
#define	MODBUS_LOOPBACK			0x08		// loopback 测试
#define MODBUS_PREG_WR			0x10		// 写N个字
#define MODBUS_DCREG_RD			0x0D		// 不是标准的MODBUS，非连续读
#define MODBUS_DCREG_WR			0x0E		// 不是标准的MODBUS，非连续写
#define MODBUS_MEM_RD			0x50		// 寄存器读
#define MODBUS_MEM_WR			0x51		// 寄存器写


//--------------------------------------------------------------------------------------------------
//      数据接收和发送步骤
//--------------------------------------------------------------------------------------------------
#define SQSTEP_INITIAL           0
#define SQSTEP_STARTRX           1
#define SQSTEP_WAITRX            2
#define SQSTEP_RXCMPLT           3
#define SQSTEP_WAITSTX           4
#define SQSTEP_WAITSTX2          5
#define SQSTEP_STARTTX           6
#define SQSTEP_WAITETX           7
#define SQSTEP_CHECK             8

//--------------------------------------------------------------------------------------------------
//      发送消息指令,在等待发送消息步骤时由Round设置应答/不应答
//--------------------------------------------------------------------------------------------------
#define SIFREQ_STARTTX          0x01        // 应答
#define SIFREQ_NOANSWER         0x02        // 不应答

//-------------------------------------------------------------------------------------------------
//      消息解析状态(判断消息是否接收完成)
//-------------------------------------------------------------------------------------------------
#define MSG_ERROR               0x00        // 消息异常
#define LENGTH_FIX              0x01        // 接收消息数据长度已确定
#define LENGTH_NOFIX            0x02        // 接收消息数据长度未确定

//--------------------------------------------------------------------------------------------------
//		IF数据结构体定义
//--------------------------------------------------------------------------------------------------
typedef	struct {
//--------------------------------------------------------------------------------------------------
//		Buffer
//--------------------------------------------------------------------------------------------------
	USHORT	RxBuf[258];						// 接收数据Buffer
	USHORT	TxBuf[258];						// 发送数据Buffer
//--------------------------------------------------------------------------------------------------
//		串行通信IF内部处理用
//--------------------------------------------------------------------------------------------------
	USHORT	SqStep;							// 消息处理时序步骤
	USHORT	ReqStx;							// 发送消息指令,在等待发送消息步骤时由Round设置应答/不应答
//--------------------------------------------------------------------------------------------------
	USHORT	RxDbcSv;						// 接收DMA指向的Buffer值
	USHORT	RxDbcRv;						// 接收DMA当前计数值
	USHORT* RxBufpx;						// 接收数据缓冲区的指针
	USHORT* TxBufpx;						// 发送数据缓冲区的指针
//--------------------------------------------------------------------------------------------------
	USHORT	MbusTrnLength;					// Modbus应答的数据长度（以字节为单位）
	USHORT	RcvbLength;						// MEMOBUS消息分析数据：需要收到消息的长度
	USHORT	AxisNumber;						// 本站地址
	USHORT  FrameEndCnt;                    // 帧结束计数器
	USHORT  FrameEndValue;                  // 帧结束值
	USHORT  TransReMain;                    // 剩余发送数据
	USHORT  TransSum;                       // 发送数量
//--------------------------------------------------------------------------------------------------
	USHORT	WaitCnt;
//--------------------------------------------------------------------------------------------------
} SIF;
//--------------------------------------------------------------------------------------------------
extern SIF  Sif;					// 串行通信IF变量

/*--------------------------------------------------------------------------------------------------*/
typedef struct{
    USHORT	FuncCode;			// 命令码：03、06、08、10
    USHORT	PacketSize;			// MSG消息总长度(0表示长度可变)
    USHORT	DataLenConfPos;		// 当MSG消息总长度不固定时，指定传输数据个数RegNum的位置
    USHORT	Multiplier;			// 字节倍数，即传输的字节数是传输数据个数的几倍
    USHORT	FixDataSize;		// 可变长度之外的需传输的固定个数(字节为单位)
}MODBUSHEAD;
/*--------------------------------------------------------------------------------------------------*/
#define	MCOM_MAX_REGIST	256			/* 命令码查找表最大个数                                         */

extern void	InitSerialMsg( void );
extern UCHAR DpxGetSifMbusRcvACK( USHORT *RcvbLength );
extern UCHAR	DpxSetSifMbusTrnsStart(USHORT MsgLength,USHORT MsgType	);
extern UCHAR	DpxSetSifAxisNumber( UCHAR	axno );
extern USHORT	*DriComGetRcvBufferAdr( UCHAR Channel );
extern USHORT	*DriComGetTrnsBufferAdr( UCHAR Channel );
extern USHORT	DriComGetTrnsBufferSize( UCHAR Channel );
extern USHORT	DriComGetRcvBufferSize( UCHAR Channel );

extern ULONG LpxSifMbusChkMyMsg( void );


#endif
