/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                   */
/*											2017 ~													*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		User14_DataTraceDef.c : 数据采集管 	    												    */
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		1. 数字跟踪定义表格																	        */
/*																									*/
/*		2. 位跟踪定义表																                */
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "Main.h"



READDUMMY ReadDummy;




/****************************************************************************************************/
/*																									*/
/*		虚拟示波器数据采集通道     																	    */
/*																									*/
/****************************************************************************************************/
const	TVXDEF	TrcVarTbl[] = {
/*   Sel  Type  SftL SftR  VarAdr																	*/
/*--------------------------------------------------------------------------------------------------*/
  { 0x00, 0x00,   0,   0,  NULL						},
  { 0x01, 0x00,   0,  10,  &BoutV.SpdReffinal       },  /* 速度指令                           【OK】*/
  { 0x02, 0x00,   0,  10,  &TrcVarX.MotSpdSmp		},  /* 电机反馈速度                        【OK】*/
  { 0x03, 0x00,   0,  10,  &BoutV.AmonTrqRef		},	/* 转矩指令         				   【OK】*/
  { 0x04, 0x00,   0,  10,  &TrcVarX.dPosCmdSmp		},  /* 位置指令速度						  【OK】*/
  { 0x05, 0x00,   0,  10,  &TrcVarX.dPosRefSmp		},  /* 位置回路前指令速度				  【OK】*/
  { 0x06, 0x00,   1,   0,  &PosMngV.dPcmdEgear		},  /* 位置指令差分△                      【OK】*/
  { 0x07, 0x00,   1,   0,  &BoutV.dPosFbki			},  /* 位置反馈差分△					  【OK】*/
  { 0x08, 0x00,   0,   0,  &BoutV.AmonPosErra		},  /* 位置偏差                           【OK】*/
  { 0x09, 0x00,   0,   0,  &CoutV.UnCrntDet		    },	/* 电流反馈有效值         				  【TODO】*/
  { 0x10, 0x00,   0,  10,  &BoutV.SpdFFCx			},  /* 速度前馈                           【OK】*/
  { 0x11, 0x00,   0,  10,  &BoutV.TrqFFCx			},  /* 转矩前馈                           【OK】*/
  { 0x12, 0x00,   0,  10,  &BoutV.AmonDisTrq		},  /* 摩擦转矩补偿                       【OK】*/
  { 0x13, 0x00,   0,  10,  &BoutV.AmonResVib		},  /* A 型振动补偿                       【OK】*/
  { 0x15, 0x00,   0,  10,  &BoutV.TrcCompTrqRef		},  /* 转矩指令(干扰前)							*/
  { 0x16, 0x00,   0,  0,   &CoutRrst.UnPfbkCntr		},  /* 编码器反馈值(编码器单位)					*/
  { 0x17, 0x00,   0,  0,   &CoutRrst.UnPfbkCntr2	},  /* 编码器反馈值(用户单位)			  【OK】*/
  { 0x18, 0x00,   0,  0,   &RoutV.ABSEncSValue      },  /* 编码器单圈反馈值                   【OK】*/
  { 0x19, 0x00,   0,  0,   &RoutV.ABSEncMValue      },  /* 编码器多圈反馈值                   【OK】*/
  { 0x1A, 0x00,   0,  0,   &CoutRrst.UnPcmdCntr     },  /* 脉冲指令数                         【OK】*/
  { 0x20, 0x00,   0,  0,   &TlObs.TLOberver         },  /* 负载转矩观测值(滤波前)             【OK】*/
  { 0x21, 0x00,   0,  0,   &TlObs.TlFilo            },  /* 负载转矩观测值(滤波后)             【OK】*/
  { 0x22, 0x00,   0,  0,   &AinK.MixUserErr         },  /* 混合误差(滤波后)                 【OK】*/
  { 0x23, 0x00,   0,  0,   &FencV.FencAbsPos        },  /* 减速机端绝对位置                 【OK】*/
  { 0x24, 0x00,   0,  0,   &FencV.FencMPos          },  /* 减速机编码器多圈                 【OK】*/
  { 0x25, 0x00,   0,  0,   &AinK.Ctrl_Word          },  /* 控制字【6040】                     【OK】*/
  { 0x26, 0x00,   0,  0,   &AinK.Stus_Word          },  /* 状态字【6041】                     【OK】*/
  { 0x27, 0x00,   0,  0,   &AinK.Targe_Pos          },  /* 位置指令【607A】                   【OK】*/
  { 0x28, 0x00,   0,  0,   &AinK.Pulse_PosFB        },  /* 位置指令【6064】                   【OK】*/
  { 0x29, 0x00,   0,  0,   &AinK.Actual_VelRPM        },  /* 电机速度【606C】                   【OK】*/
  { 0x2A, 0x00,   0,  0,   &AinK.Profile_VelRPM        },  /* 轮廓速度【6081】                   【OK】*/
  { 0x2B, 0x00,   0,  0,   &AinK.InterPos_CMD        },  /* 插补位置【60C1】                   【OK】*/
  { 0x2C, 0x00,   0,  0,   &AinK.Pos_CMDVal        },  /* 电机位置指【60FC】                   【OK】*/
  { 0x2D, 0x00,   0,  0,   &AinK.Target_Vel        },  /* 目标速度【60FF】                   【OK】*/
  { 0x50, 0x00,   0,  10,  &BoutV.AmonActGain		},  /* 当前增益                           【OK】*/
  { 0x51, 0x00,   0,   0,  &BinK.TrcDcVolt			},  /* 母线电压                           【OK】*/
  { 0x52, 0x00,   0,   0,  &SpdCtrl.V.TrqFedFor		},  /* 速度前馈值                         【OK】*/
  { 0x53, 0x00,   0,   0,  &CoutV.UnCrntRef			},  /* 累计负载率                               */
  { 0x54, 0x00,   0,   0,  &CoutV.TrcRgPower		},  /* 再生负载率                               */
  { 0x55, 0x00,   1,   0,  &BinK.dMotPos			},  /* 电机位置差分△							*/
  { 0x57, 0x00,   0,   0,  &CoutV.UnMotPhase		},  /* 电角度                             【OK】*/
  { 0x58, 0x00,   0,   0,  &AinK.IdRefMon1			},  /* d轴指令                            【OK】*/
  { 0x59, 0x00,   0,   0,  &AinK.IqRefMon1			},  /* q轴指令                            【OK】*/
  { 0x5A, 0x00,   0,   0,  &AinK.IdFbMon			},  /* d轴反馈                            【OK】*/
  { 0x5B, 0x00,   0,   0,  &AinK.IqFbMon			},  /* q轴反馈                            【OK】*/
  { 0x5C, 0x00,   0,   0,  &AinK.CurrentU	        },  /* U相电流                            【OK】*/
  { 0x5D, 0x00,   0,   0,  &AinK.CurrentV	        },  /* V相电流                            【OK】*/
  { 0x5E, 0x00,   0,   0,  &AinK.CurrentW	        },  /* W相电流                            【OK】*/
  /*------------------------------------------------------------------------------------------------*/
  { 0x60, 0x00,   0,  0,  &AinK.Monitor1		    },  /* 反馈速度1                          【OK】*/
  { 0x61, 0x00,   0,  0,  &AinK.Monitor2		    },  /* 反馈速度2                          【OK】*/
  { 0x62, 0x00,   0,  0,  &AinK.Monitor3		    },  /* 反馈速度1                          【OK】*/
  { 0x63, 0x00,   0,  0,  &AinK.Monitor4		    },  /* 反馈速度2                          【OK】*/
  { 0x64, 0x00,   0,  0,  &AinK.Monitor5		    },  /* 1:1 监控                           【OK】*/
};
/*--------------------------------------------------------------------------------------------------*/
const	USHORT	TrcVarTblEntNum = sizeof(TrcVarTbl)/sizeof(TrcVarTbl[0]);
/*--------------------------------------------------------------------------------------------------*/



/****************************************************************************************************/
/*																									*/
/*		IO信号采集定义            																	*/
/*																									*/
/****************************************************************************************************/
const	TBXDEF	TrcBitTbl[] = {
/*   Sel   BitNo    VarAdr																            */
/*--------------------------------------------------------------------------------------------------*/
  { 0x00,  0,       NULL				},
  { 0x01,  31,      &CoutV.f.Sv		    },      /* 1 伺服使能                                   */
  { 0x02,  9,       &CoutV.f.Sv			},      /* 2 正向限位                                       */
  { 0x03,  10,      &CoutV.f.Sv			},      /* 3 负向限位                                       */
  { 0x04,  4,		&CinV.f.Seq			},      /* 4 警报复位                                       */
  { 0x05,  2,		&BinV.f.Ctrl		},      /* 5 PI-P控制                                       */
  { 0x06,  2,		&BinV.f.Sv          },      /* 6 转矩限制选择                                   */
  { 0x07,  7,		&CinV.f.Sv          },      /* 7 绝对值多圈位置信息DI/DO输出选择                */
  { 0x08,  4,		&CinV.f.Sv			},      /* 8 速度指令方向                                   */
  { 0x09,  5,		&CinV.f.Sv			},      /* 9 内部速度指令选择A                              */
  { 0x0A,  6,		&CinV.f.Sv			},      /* 10 内部速度指令选择B                             */
  { 0x0B,  2,		&CinV.f.Sv			},      /* 11 控制模式选择                                  */
  { 0x0C,  3,		&CinV.f.Sv			},      /* 12 零速钳位                                      */
  { 0x0D,  0,	    &BinV.f.Sv			},      /* 13 脉冲禁止                                      */
  { 0x0E,  4,	    &BinV.f.Sv			},      /* 14 增益切换                                      */
  { 0x0F,  11,	    &CinV.f.Sv          },      /* 15 转矩指令方向                                  */
  { 0x10,  6,	    &BinV.f.Sv			},      /* 16 指令脉冲输入倍率                              */
  { 0x11,  7,	    &BinV.f.Sv			},      /* 17 脉冲偏差清除                                  */
  { 0x12,  14,		&CinV.f.Sv			},      /* 18 转矩指令选择A                                 */
  { 0x13,  15,		&CinV.f.Sv			},      /* 19 转矩指令选择B                                 */
  { 0x14,  16,		&CinV.f.Sv			},      /* 20 转矩触发                                      */
  { 0x16,  22,		&CinV.f.Sv			},      /* 22 全闭环时位置反馈信号源选择                    */
  { 0x17,  13,		&SysBitDef1.f       },      /* 23 自举标志                                      */
  /*------------------------------------------------------------------------------------------------*/
  { 0x20,  0,		&Pr_DICtrgV.f       },      /* 32 内部位置触发                                  */
  { 0x21,  0,		&Pr_DICtrgV.DI.f    },      /* 33 内部位置 Pos0                                 */
  { 0x22,  1,		&Pr_DICtrgV.DI.f    },      /* 34 内部位置 Pos1                                 */
  { 0x23,  2,		&Pr_DICtrgV.DI.f    },      /* 35 内部位置 Pos2                                 */
  { 0x24,  3,		&Pr_DICtrgV.DI.f    },      /* 36 内部位置 Pos3                                 */
  { 0x25,  13,		&BinV.f.Sv			},      /* 37 原点使能开关                                  */
  { 0x26,  14,		&BinV.f.Sv			},      /* 38 原点开关                                      */
  /*------------------------------------------------------------------------------------------------*/
  { 0x30,  6,		&SysBitDef.f        },      /* 48 再生制动                                      */
  { 0x31,  5,		&SysBitDef.f        },      /* 49 继电器控制                                    */
  { 0x32,  6,		&CoutV.f.Sv        },       /* 50 DB控制                                        */
  /*------------------------------------------------------------------------------------------------*/
  { 0x40,  9,		&CoutV.f.Seq		},      /* 64 伺服准备就绪                                  */
  { 0x41,  2,		&BoutV.f.Ctrl		},      /* 65 定位完成                                      */
  { 0x42,  4,		&CoutV.f.Ctrl		},      /* 66 速度一致                                      */
  { 0x43,  3,		&CoutV.f.Ctrl		},      /* 67 电机旋转                                      */
  { 0x44,  6,		&BoutV.f.Ctrl		},      /* 68 转矩限制中                                    */
  { 0x45,  5,		&BoutV.f.Ctrl		},      /* 69 速度限制中                                    */
  { 0x46,  7,	    &CoutV.f.Seq		},      /* 70 制动器           [OK]                         */
  { 0x47,  0,		&Alm.f.WrnFlag      },      /* 71 警告输出                                      */
  { 0x48,  1,		&BoutV.f.Sv			},      /* 72 位置接近                                      */
  { 0x49,  5,		&BoutV.f.Sv			},      /* 73 指令脉冲输入倍率切换输出                      */
  { 0x4A,  0,		&Alm.f.AlmFlag		},      /* 74 警报输出        [OK]                          */
  { 0x4B,  9,		&BoutV.f.Ctrl       },      /* 75 目标转矩到达                                  */
  /*------------------------------------------------------------------------------------------------*/  
  { 0x50,  1,		&DIDOVar.DigitStatusMon.f },/* 80 X1                                            */
  { 0x51,  2,		&DIDOVar.DigitStatusMon.f },/* 80 X2                                            */
  { 0x52,  3,		&DIDOVar.DigitStatusMon.f },/* 80 X3                                            */
  { 0x53,  4,		&DIDOVar.DigitStatusMon.f },/* 80 X4                                            */
  { 0x54,  5,		&DIDOVar.DigitStatusMon.f },/* 80 X5                                            */
  { 0x55,  6,		&DIDOVar.DigitStatusMon.f },/* 80 X6                                            */
  { 0x56,  7,		&DIDOVar.DigitStatusMon.f },/* 80 X7                                            */
  { 0x57,  8,		&DIDOVar.DigitStatusMon.f },/* 80 X8                                            */
  
};
/*--------------------------------------------------------------------------------------------------*/
const	USHORT	TrcBitTblEntNum = sizeof(TrcBitTbl)/sizeof(TrcBitTbl[0]);
/*--------------------------------------------------------------------------------------------------*/

/****************************************************************************************************/
/*                               The End of the file                                                */
/****************************************************************************************************/
