/*************** (C) COPYRIGHT 2024  Veichi Technology Co., Ltd*********************************
* File Name 		 : User15_UartifMbus.c
* Version			 : V0.1
* Date				 : 2024
* Description		 : 串口通讯处理部分
***********************************************************************************************/
#include "Main.h"

SIF  Sif;							// 串行通信IF变量

//--------------------------------------------------------------------------------------------------
//		Error Code Definition
//--------------------------------------------------------------------------------------------------
#define	SIFERR_RXTMOVR		0x01			// 传文内接收时间转换
#define	SIFERR_XMTMOVR		0x02			// 完成确认接收时间转换
#define	SIFERR_SEQERRA		0x03			// 收发顺序错误A
#define	SIFERR_SEQERRB		0x04			// 收发顺序错误B
#define	SIFERR_RMSGERR		0x05			// 接收信息错误
#define	SIFERR_USERERR		0x10			// 用户错误(无应答)	
#define	SIFERR_OTHERERR		0xFF			// 其它错误	


//--------------------------------------------------------------------------------------------------

/**********************************************************************************************/
/* Function_Name: InitSerialMsg         */ 
/* Description  : UART串行通信协议初始化处理
                  调用：上电初始化调用一次（读取EEPROM后）
                  输入：
                  输出： 	*/
/**********************************************************************************************/
void	InitSerialMsg( void )
{

/*--------------------------------------------------------------------------------------------------*/
/*		串口通信数据初始化                                                                          */
        MlibResetLONGMemory( &Sif, sizeof( Sif ) / 2 );	/* Reset All Data to Zero                   */
/*--------------------------------------------------------------------------------------------------*/
/*      轴号设置：设置SCI和USB中的设备地址变量，实际没有用，后面设备号直接用的Para参数              */
        DpiComSetAxisNumber( COM0_UART, (UCHAR) (Prm.Address & 0x00FF) );
/*--------------------------------------------------------------------------------------------------*/
/*      串口通讯收发接口和modbus协议接口对接函数                                                    */
        LpxInitMsgInterface();
            
/*--------------------------------------------------------------------------------------------------*/
        SrlMsg.AccsLvl = 3;
            
		return;
}

/**********************************************************************************************/
/* Function_Name: DpxGetUsbMbusRcvAdr         */ 
/* Description  : Usb下MEMOBUS消息接收缓冲器地址提取
                  调用：获取通信端口接收buffer地址指针-函数调用
                  输入：
                  输出： 	*/
/**********************************************************************************************/
uint16_t *DpxGetUsbMbusRcvAdr( void )
{
//		return( Usbif.OutBuf );
    return( UsbRecBuf.ReciveBuf );  // 接收数据缓冲区
}

/**********************************************************************************************/
/* Function_Name: DriComGetRcvBufferAdr         */ 
/* Description  : 获取通信端口接收buffer地址指针
                  调用：USB/串口通讯收发接口和modbus协议接口对接函数中调用
                  输入：Channel：COM0_UART或COM1_USB
                  输出： 	*/
/**********************************************************************************************/
USHORT	*DriComGetRcvBufferAdr( UCHAR Channel )
{
USHORT	*bufadr = 0;
		switch( Channel )
        {
            //--------------------------------------------------------------------------------------
            //		UART端口
            //--------------------------------------------------------------------------------------
			case COM0_UART:
					bufadr = Sif.RxBuf;
				break;
            //--------------------------------------------------------------------------------------
            //		USB端口
            //--------------------------------------------------------------------------------------
            case COM1_USB:
                    bufadr = (USHORT *)DpxGetUsbMbusRcvAdr();
                break;
            //--------------------------------------------------------------------------------------
            //		
            //--------------------------------------------------------------------------------------
			default:
				bufadr = 0;
				break;
		}
		return( bufadr );
}

/**********************************************************************************************/
/* Function_Name: DpxGetUsbMbusTrnsAdr         */ 
/* Description  : Usb下MEMOBUS消息发送缓冲器地址提取
                  调用：获取通信端口发送buffer地址指针-函数调用
                  输入：
                  输出： 	*/
/**********************************************************************************************/
USHORT	*DpxGetUsbMbusTrnsAdr( void )
{
#ifdef CPU1
		return( Usbif.InBuf );
#endif

}

/**********************************************************************************************/
/* Function_Name: DriComGetTrnsBufferAdr         */ 
/* Description  : 获取通信端口发送buffer地址指针
                  调用：USB/串口通讯收发接口和modbus协议接口对接函数中调用
                  输入：Channel：COM0_UART或COM1_USB
                  输出： 	*/
/**********************************************************************************************/
USHORT	*DriComGetTrnsBufferAdr( UCHAR Channel )
{
USHORT	*bufadr = 0;
		switch( Channel )
        {
            //--------------------------------------------------------------------------------------
            //		UART端口
            //--------------------------------------------------------------------------------------
			case COM0_UART:
					bufadr = Sif.TxBuf;
				break;
            //--------------------------------------------------------------------------------------
            //		USB端口
            //--------------------------------------------------------------------------------------
			case COM1_USB:
					bufadr = DpxGetUsbMbusTrnsAdr();
				break;
            //--------------------------------------------------------------------------------------
            //		
            //--------------------------------------------------------------------------------------
			default:
				bufadr = 0;
				break;
		}
		return( bufadr );
}

/**********************************************************************************************/
/* Function_Name: DriComGetRcvBufferSize         */ 
/* Description  : 获取通信端口接收buffer大小
                  调用：USB/串口通讯收发接口和modbus协议接口对接函数中调用
                  输入：Channel：COM0_UART或COM1_USB
                  输出： 	*/
/**********************************************************************************************/
USHORT	DriComGetRcvBufferSize( UCHAR Channel )
{

USHORT	bufsize = 0;

		switch( Channel )
        {
            //--------------------------------------------------------------------------------------
            //		UART端口
            //--------------------------------------------------------------------------------------
			case COM0_UART:
					bufsize = (USHORT)MBUS_RCV_MAXSIZEB;
				break;
            //--------------------------------------------------------------------------------------
            //		USB端口
            //--------------------------------------------------------------------------------------
			case COM1_USB:
					bufsize = (USHORT)MBUS_RCV_MAXSIZEB;
				break;
            //--------------------------------------------------------------------------------------
            //		
            //--------------------------------------------------------------------------------------
			default:
				bufsize = 0;
				break;
		}
		return( bufsize );
}

/**********************************************************************************************/
/* Function_Name: DriComGetTrnsBufferSize         */ 
/* Description  : 获取通信端口发送buffer大小
                  调用：USB/串口通讯收发接口和modbus协议接口对接函数中调用
                  输入：Channel：COM0_UART或COM1_USB
                  输出： 	*/
/**********************************************************************************************/
USHORT	DriComGetTrnsBufferSize( UCHAR Channel )
{

USHORT	bufsize = 0;

		switch( Channel )
        {
            //--------------------------------------------------------------------------------------
            //		UART端口
            //--------------------------------------------------------------------------------------
			case COM0_UART:
				bufsize = (USHORT)MBUS_TRN_MAXSIZEB;
				break;
            //--------------------------------------------------------------------------------------
            //		USB端口
            //--------------------------------------------------------------------------------------
			case COM1_USB:
                bufsize = (USHORT)MBUS_TRN_MAXSIZEB;
				break;
            //--------------------------------------------------------------------------------------
            //		
            //--------------------------------------------------------------------------------------
			default:
				bufsize = 0;
				break;
		}
        /*------------------------------------------------------------------------------------------*/
		return( bufsize );
}

/**********************************************************************************************/
/* Function_Name: DpxSetSifAxisNumber         */ 
/* Description  : 串口轴号设置
                  调用：USB/串口通讯轴号设置-函数
                  输入：轴号（设备地址）
                  输出： 	*/
/**********************************************************************************************/
UCHAR	DpxSetSifAxisNumber( UCHAR	axno )
{
UCHAR	rc;
    Sif.AxisNumber = axno;							// 设置端口站地址
    rc = COMDEV_OK;									// 正常应答
    return( rc );
}

/**********************************************************************************************/
/* Function_Name: DpxSetSifMbusTrnsStart         */ 
/* Description  : Modbus开始应答指令(通知通信时序中开始发送数据)(Round用)
                  调用：USB/串口通讯开始应答指令-函数调用
                  输入：应答长度(Byte)、应答类型(应答/不应答)
                  输出： 	*/
/**********************************************************************************************/
UCHAR	DpxSetSifMbusTrnsStart(
		USHORT	MsgLength,								// 应答长度
		USHORT	MsgType	)								// 应答类型
{
UCHAR	rc = COMDEV_UNDEF;
/*--------------------------------------------------------------------------------------------------*/
/*		消息处理时序：SQSTEP_WAITSTX状态时进行应答处理     				    						*/
/*--------------------------------------------------------------------------------------------------*/
		if( Sif.SqStep == SQSTEP_WAITSTX )
		{
            /*--------------------------------------------------------------------------------------*/
            /*	    已经字节长度合法性检查：错误返回帧数据长度为5，也是满足条件的		    		*/
            /*--------------------------------------------------------------------------------------*/
			if(( MsgLength > (USHORT)MBUS_TRN_MAXSIZEB ) || ( MsgLength < 5 ) )
			{
                //---------------------------------------------------------------------------------
                //		发送信息类型检查
                //---------------------------------------------------------------------------------
			    Sif.ReqStx  = SIFREQ_NOANSWER;          // 禁止发送请求
			    Sif.SqStep = SQSTEP_WAITSTX2;           // 进入到下一个等待阶段
				rc = COMDEV_NGSIZE;
			}
			else
			{
                /*----------------------------------------------------------------------------------*/
                /*                      															*/
                /*----------------------------------------------------------------------------------*/
				Sif.MbusTrnLength = MsgLength;
                /*----------------------------------------------------------------------------------*/
                /*		发送信息类型检查         													*/
                /*----------------------------------------------------------------------------------*/
				switch( MsgType )
				{
					case RESMT_COMPLETE :				// 消息处理完毕,开始应答
						Sif.ReqStx  = SIFREQ_STARTTX;	// 启动发送请求设定
						rc = COMDEV_OK;					
						break;
					case RESMT_NORESPONSE :				// 消息异常,无需应答
						Sif.ReqStx  = SIFREQ_NOANSWER;	// 禁止发送请求
						rc = COMDEV_OK;					
						break;
					default :
						rc = COMDEV_UNDEF;				// 消息类型异常(未定义)
						break;
				}
				Sif.SqStep = SQSTEP_WAITSTX2;			// 进入到下一个等待阶段
			}
		}
		else
		{
			rc = COMDEV_NGTIME;                         // 未到达发送时机
		}

		return( rc );
}

/**********************************************************************************************/
/* Function_Name: LpxSifMbusChkMyMsg         */ 
/* Description  : 判断消息是否发给本站     
                  调用：串行通讯实时监控-函数中调用
                  输入：
                  输出： 	*/
/**********************************************************************************************/
ULONG LpxSifMbusChkMyMsg( void )
{
        //------------------------------------------------------------------------------------------
        //		消息地址为广播地址"0"或者为本站地址
        //------------------------------------------------------------------------------------------
		if(( Sif.RxBuf[0] == 0x00 )||( Sif.RxBuf[0] == Sif.AxisNumber ))
		{
			return( TRUE );
		}
		else
		{
			return( FALSE );
		}
}

/**********************************************************************************************/
/* Function_Name: DpxGetSifMbusRcvACK         */ 
/* Description  : 判断Modbus消息是否接收完毕，并获取消息长度(Round用,判断是否开始处理消息) 
                  调用：判断通信端口是否接收数据完毕-函数中调用
                  输入：
                  输出： 	*/
/**********************************************************************************************/
UCHAR	DpxGetSifMbusRcvACK( USHORT *RcvbLength )
{
UCHAR	rc = FALSE;

		if( Sif.SqStep == SQSTEP_WAITSTX )
		{
			*RcvbLength = Sif.RcvbLength;			// 返回消息长度(字节数)
			rc = COM_ACK;							// 消息接收完成
		}
		else
		{
			rc = ALL_NAK;							// 消息未接收完成
		}
		return( rc );
}


/****************************************************************************************************/
/*                               The End of the file                                                */
/****************************************************************************************************/
