/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                   */
/*											2017 ~													*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		User17_CommMngr.c : 通讯处理部分公共部分												    */
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "Main.h"

MSGIF	SrlMsg;
RMNGV   RmngV = {0,0};

/****************************************************************************************************/
/*																									*/
/*		 Message ＩＦ初期化処理																		*/
/*																									*/
/****************************************************************************************************/
void	LpxInitMsgInterface( void )
{

/*--------------------------------------------------------------------------------------------------*/
/*		 Serial  Message ＩＦ初期化																	*/
/*--------------------------------------------------------------------------------------------------*/
  
    MlibResetSHORTMemory( &SrlMsg, sizeof(SrlMsg) );           /* 相关变量清零                     */
    
    SrlMsg.CmdBuf  = DriComGetRcvBufferAdr(COM0_UART);	        /* 指令 Message バッファ			*/
    SrlMsg.ResBuf  = DriComGetTrnsBufferAdr(COM0_UART);	        /* 応答 Message バッファ			*/
    SrlMsg.RcvBufSize = DriComGetRcvBufferSize(COM0_UART);      /* 受信バッファサイズ				*/
    SrlMsg.SndBufSize = DriComGetTrnsBufferSize(COM0_UART);     /* 送信バッファサイズ				*/
    SrlMsg.StxFunc = NULL;									    /* 応答 Message 送信開始ＡＰＩ関数	*/
    SrlMsg.ResFunc = RpxSmsgFuncExecResponse;				    /* Ｆｎ実行結果応答 Message 処理関数*/
    SrlMsg.LstErrRno = 0xFFFF;								    /* 前回異常レジスタ番号				*/
    SrlMsg.ErrRno  = 0xFFFF;								    /* 異常レジスタ番号					*/
    SrlMsg.ComPortType = COM0_UART;							    /* 通信チャネルタイプ設定			*/
    return;
}



/****************************************************************************************************/
/*																									*/
/*		自局アドレス設定																			*/
/*		                    																	    */
/*--------------------------------------------------------------------------------------------------*/
/*		Notes: Invalid channel returns COMDEV_NONPORT.                                              */
/****************************************************************************************************/
UCHAR	DpiComSetAxisNumber( UCHAR Channel, UCHAR AxisNumber )
{

UCHAR	rc = COMDEV_NONPORT;
		switch( Channel )
        {
            /*--------------------------------------------------------------------------------------*/
            /*		UART port  												                        */
            /*--------------------------------------------------------------------------------------*/
			case COM0_UART:
					rc = DpxSetSifAxisNumber( AxisNumber );
				break;
            /*--------------------------------------------------------------------------------------*/
            /*		引数異常時																		*/
            /*--------------------------------------------------------------------------------------*/
			default:
				rc = COMDEV_NONPORT;
				break;
		}
		return( rc );

}
//===================================================================================================
//		判断通信端口是否接收数据完毕(判断是否开始处理消息)
//===================================================================================================
UCHAR	DriComGetRcvComplete( UCHAR Channel, USHORT *RcvbLength )
{

UCHAR	rc = ALL_NAK;

    switch( Channel )
    {
        //------------------------------------------------------------------------------------------
        //		UART端口
        //------------------------------------------------------------------------------------------
        case COM0_UART:
            rc = DpxGetSifMbusRcvACK( RcvbLength );
            break;
        //------------------------------------------------------------------------------------------
        //		USB端口
        //------------------------------------------------------------------------------------------
        case COM1_USB:
            rc = DpxGetUsbMbusRcvACK( RcvbLength );
            break;
        //------------------------------------------------------------------------------------------
        //		端口异常时
        //------------------------------------------------------------------------------------------
        default:
            rc = COMDEV_NONPORT;
            break;
    }
    return( rc );
}

//===================================================================================================
//		开始应答指令(通知通信时序中开始发送数据)
//===================================================================================================
UCHAR	DriComSetTrnsStart( UCHAR Channel, USHORT TrnsbLength, USHORT MsgType )
{

UCHAR	rc;

		switch( Channel )
        {
            //--------------------------------------------------------------------------------------
            //		UART端口
            //--------------------------------------------------------------------------------------
            case COM0_UART:
                rc = DpxSetSifMbusTrnsStart( TrnsbLength, MsgType );
                break;
            //--------------------------------------------------------------------------------------
            //		USB端口
            //--------------------------------------------------------------------------------------
			case COM1_USB:
				rc = DpxSetUsbMbusTrnsStart( TrnsbLength, MsgType );
				break;
            //------------------------------------------------------------------------------------------
            //		端口异常时
            //------------------------------------------------------------------------------------------
			default:
				rc = COMDEV_NONPORT;
				break;
		}
		return( rc );
}

/****************************************************************************************************/
/*																									*/
/*		SigmaMessage 終了処理																		*/
/*																									*/
/****************************************************************************************************/
void	RpxSmsgFinishProcedure( HMSGIF Hmsg )
{
		/* 操作レジスタ書込み権強制解放処理	*/
		RpxFreeOpeRegWriteHandle(Hmsg);
		return;
}


/****************************************************************************************************/
/*																									*/
/*		 串口消息管理Serial  Message Ma ge   														*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 :  Serial  Messag鐨勎受信を監視し、各 Serial  Message 処理(LcdOp,SigmaMsg,etc)			*/
/*			鐨刧行制御を行う。																		*/
/*																									*/
/****************************************************************************************************/
void	SerialMsgManager( void )
{
UCHAR	AckStatus;
/*--------------------------------------------------------------------------------------------------*/
/*		 Message 串口接收信息完成																	*/
/*--------------------------------------------------------------------------------------------------*/
    AckStatus = DriComGetRcvComplete( COM0_UART, &SrlMsg.RcvLen );	/* 接收状态查询:来源&长度	    */

    if ( AckStatus == COM_ACK )
    {
        /*------------------------------------------------------------------------------------------*/
        /*	受信 Message 正常																		*/
        /*------------------------------------------------------------------------------------------*/
        if( RpxSmsgCheckRecvMessage( &SrlMsg ) == OK )				/* CRC-16 Check result 		    */
        {
            KpiRstLongTimer( &SrlMsg.ComTimeLong );                 /* 正常收到数据时,计时器需要清零*/
            RmngV.SerComMode = SMSGCOM;
            RpiSetAccsLvl( &Access, SrlMsg.AccsLvl );
            OpeReg.CommType = 1;
            RpxSmsgMainProcedure( &SrlMsg );		                /* Sigma Message 处理			*/
        }
        /*------------------------------------------------------------------------------------------*/
        /*	受信 Message 異常																	    */
        /*------------------------------------------------------------------------------------------*/
        else
        {	/* 校验不合的→接收的是无用的信息,无需回应	*/
            DriComSetTrnsStart( COM0_UART, SrlMsg.RcvLen, RESMT_NORESPONSE );
        }
    }
    else
    {
        switch( RmngV.SerComMode )
        {
            case SMSGCOM:                                          /* 串口有接入                    */
				 if( KpiGetLongTimer( &SrlMsg.ComTimeLong ) > 20000 )
				 {
					RpxSmsgFinishProcedure( &SrlMsg );             /* 串口断开时,自动退出处理       */
					DriComSetTrnsStart( COM0_UART, SrlMsg.RcvLen, RESMT_NORESPONSE );
					RmngV.SerComMode = NOCOM;                      /* 没有串口在使用                */
					RpiSetAccsLvl( &Access, PopMsg.AccsLvl );
					//RpxPnlOpInit();
				 }
				 break;
			default:
				 break;
        }    
    
    }
/*--------------------------------------------------------------------------------------------------*/
    return;
}


/****************************************************************************************************/
/*                               The End of the file                                                */
/****************************************************************************************************/
