/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                   */
/*											2017 ~													*/
/****************************************************************************************************/
/*文件名:UserD_Task.c              	                                                                */
/*创建时间:2019.08.28                                                                               */
/*版本说明:V1.0                                                                                     */
/*功能描述: 特殊功能调度                                                                            */
/****************************************************************************************************/
#include "Main.h"


/****************************************************************************************************/
/*Function_Name:UserD_Init                                                                          */
/*Description  :初始化,只执行一次         //20191012,xuezs新增内容                                   */
/****************************************************************************************************/ 
void UserD_Init( void )
{
    /*----------------------------------------------------------------------------------------------*/
    /* 初始化时强制为无效  【软件内部默认10000时,不进行原点回归(为0时原点回归)】                    */
    /*----------------------------------------------------------------------------------------------*/
    Prm.PrCommSet = 10000;                                     /* 强制无效                          */
    return;
}

/****************************************************************************************************/
/*Function_Name:UserD_TaskA                                                                         */
/*Description  :62.5us 执行一次 【中断】                                                            */
/****************************************************************************************************/
void UserD_TaskA( void )
{
    return;
}

/****************************************************************************************************/
/*Function_Name:UserD_TaskB                                                                         */
/*Description  :125us 执行一次 【中断】                                                             */
/****************************************************************************************************/
void UserD_TaskB( void )
{
    if( OrgStr.ExternOrgEnFlg )
    {
        F_OrgFunction();          //20191012,xuezs
    }
    return;
}

USHORT PowerOnDelyCnt = 0;
USHORT EnccodeStep = 0;
//-----------------------------------------------------------------------
void EncodeOrgSet( void )
{

    switch( EnccodeStep )
    {
        /*------------------------------------------------------------------------------------------*/
        case 0:
        break;
        /*------------------------------------------------------------------------------------------*/
        case 1:
            (void)RpiFunPrmNvmemUpdate( &pndef_orgSposL );                  /* 32位数据一次写入     */
            EnccodeStep ++;
        break;
        case 20:
            (void)RpiFunPrmNvmemUpdate( &pndef_orgMpos );                   /* 16位数据一次写入     */
            EnccodeStep ++;
        break;
        case 40:
            if( CAN_EXFUNC1_0_EN )      //原点回归状态EEPROM写入功能
            {
                if(Iprm.f.MulTSingT == 0)   //多圈绝对值编码器适用
                {
                    (void)RpiFunPrmNvmemUpdate( &pndef_orgstatus );         /* 原点回归状态一次写入     */
                    EnccodeStep ++;
                }
                else
                    EnccodeStep = 0;
            }
            else
                EnccodeStep = 0;
		break;
        case 60:
            EnccodeStep = 0;
        break;
        /*------------------------------------------------------------------------------------------*/
        default:
            EnccodeStep ++;
        break;
    }
}
/****************************************************************************************************/
/*Function_Name:UserD_TaskC                                                                         */
/*Description  :2ms 执行一次 【中断】                                                               */
/****************************************************************************************************/
void UserD_TaskC( void )
{
ULONG tmp;
    if( PowerOnDelyCnt < 500 )
    {
        PowerOnDelyCnt ++;
    }
    else
    {
        /*------------------------------------------------------------------------------------------*/
        /*  原点回归功能仅适用于标准型,总线型原点回归在相对应的文件中单独处理                       */
        /*------------------------------------------------------------------------------------------*/
        if( Kprm.f.StandardType ==1 && CoutK.f.PowerOn == 1 )
        {
            if( (Prm.orgmode & 0x00B0) == 0x00B0 )
            {
                if( (Prm.orgmode & 0x000F) == 0x0004 )
                {
                    Prm.orgmode = Prm.orgmode & 0xFFF0;
                    if ( Kprm.f.FencUseFlag )
                    {
                        /*------------------------------------------------------------------------------*/
                        tmp = FencV.FencAbsPos;
                         Prm.orgSposL = (USHORT)(tmp & 0x0000FFFF);
                         Prm.orgSposH = (USHORT)((tmp >> 16) & 0xFFFF);
                         Prm.orgMpos = FencV.FencMPos;

                    }
                    else
                    {
                        /*------------------------------------------------------------------------------*/
                        tmp = RoutV.ABSEncSValue;
                        /*------------------------------------------------------------------------------*/
                        Prm.orgSposL = (USHORT)tmp;                             /* 单圈值L              */
                        Prm.orgSposH = (USHORT)(tmp >> 16);                     /* 单圈值H              */
                        Prm.orgMpos = RoutV.ABSEncMValue;
                    }
                    
                    Pr_DICtrgV.PosCmdSum = 0;                             /*找到原点后，点位的绝对位置置0 */
                    Pr_DICtrgV.PosFbkDelt = CoutRrst.UnPfbkCntr2;         /*原点回归结束时的反馈脉冲（用户单位）*/
                    EnccodeStep = 1;
                    if( CAN_EXFUNC1_0_EN )
                    {
                        Prm.orgstatus = 1;
                    }
                }
            }
            else
            {
                OrgDiCheck();           //原点信号检测                                         
                OrgEnCheck();           //原点回归触发判断
            }
           
        }
        OrgOutput();            //原点回归状态输出
    }
    return;
}

/****************************************************************************************************/
/*Function_Name:UserD_TaskR                                                                         */
/*Description  :2ms 执行一次 【普通循环】                                                           */
/****************************************************************************************************/
void UserD_TaskR( void )
{
    CanOpen_2msLoop();      //20191012,xuezs
    return;
}

