/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                     */
/*											2017 ~													*/
/****************************************************************************************************/
/*文件名:Cur02_CurCmd.c              	                                                                */
/*创建时间:2017.06.14                                                                                 */
/*版本说明:V1.0                                                                                       */
/*功能描述: 电流指令的计算处理                                                                             */
/****************************************************************************************************/
#include "Main.h"


volatile USHORT TimeCnt = 0;
/****************************************************************************************************/
/*Function_Name:KpiInputTrqRef                                                                 		*/
/*Description  :转矩指令			                                                                    */
/****************************************************************************************************/
LONG KpiInputTrqRef(void)
{
LONG TorqCmd;
UCHAR TorqSel;

    //---------------------------------------------------------------------------------------------
    //  CanOpen 机型
    //---------------------------------------------------------------------------------------------
    if( Kprm.f.CanOpenNet == 1 )
    {
        TorqCmd = KpiCanOpenInputTrqRef();                          /* 0.1%                         */
        TorqCmd *= 10;                                              /* 0.01%                        */
    }
    else
    {
        switch( Prm.b_prm400 & 0x000F)
        {
            case 0:     // 内部数字给定
                TorqCmd = 10L * (SHORT)Prm.intrqcmd1;
                break;
            case 7:
#ifdef INNER_INPUT_FUNC
                TorqCmd = InnerInputCal(&CurSig);
#endif
                break;
            case 3:     // 端子多段选择
                TorqSel = ((UCHAR)CinV.f.Sv.TorqB << 1) | CinV.f.Sv.TorqA;
                switch( TorqSel & 0x03 )
                {
                    case 0:
                        TorqCmd = 10L * (SHORT)Prm.intrqcmd1;
                        break;
                    case 1:
                        TorqCmd = 10L * (SHORT)Prm.intrqcmd2;
                        break;
                    case 2:
                        TorqCmd = 10L * (SHORT)Prm.intrqcmd3;
                        break;
                    case 3:
                        TorqCmd = 10L * (SHORT)Prm.intrqcmd4;
                        break;
                    default:
                        TorqCmd = 0;
                        break;
                }
                break;
            /*------------------------------------------------------------------------------------------*/
            /* 5:异常值情况																				*/
            /*------------------------------------------------------------------------------------------*/
            default:
                TorqCmd = 0;
                KpiSetParamError( &pndef_b_prm400 );
                break;
        }
    }

    /*----------------------------------------------------------------------------------------------*/
    /*                  转矩指令方向调整( 外部端子 + 内部寄存器 )                                            */
    /*----------------------------------------------------------------------------------------------*/
    if( CinV.f.Sv.TorqD )                                       /* 外部端子改变转矩指令方向               */
    {
        TorqCmd = -TorqCmd;
    }
    if( (Prm.trqcmddirtype & 0x0001) == 0x0001 )                /* 内部寄存器改变转矩指令方向              */
    {
        TorqCmd = -TorqCmd;
    }
    /*----------------------------------------------------------------------------------------------*/
    if( TorqCmd >= 0 )
    {
        CinV.f.Sv.TDIR = 0;
    }
    else
    {
        CinV.f.Sv.TDIR = 1;
    }
    
	/*----------------------------------------------------------------------------------------------*/
    /*  将转矩指令0.01% 转换成 2^24处理                                                                   */
    /*----------------------------------------------------------------------------------------------*/
    TorqCmd = KpiTorqueLevelCal( TorqCmd, 0 );
	return TorqCmd; 
}




/*--------------------------------------------------------------------------------------------------*/
/*                                          End of The File                                         */
/*--------------------------------------------------------------------------------------------------*/


