/****************************************************************************************************/
/*																									*/
/*                           Copyright (C) ××× Electric Corporation                                 */
/*                                  版权所有 · All right Reserved                                   */
/*											2017 ~													*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		User18_MeModbus.c : 协议部分												                */
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "Main.h"

MBUSMNGV	MbusMngV;



/****************************************************************************************************/
/*																									*/
/*		SigmaMemobus Error Code Definition															*/
/*																									*/
/****************************************************************************************************/

#define	SMBUS_RESSIZ_ERR	    5				    /* 异常应答消息长度								*/

/*--------------------------------------------------------------------------------------------------*/
#define	SMBUS_EC_FNCDERR		(0x01 | 0x200)		/* 函数代码异常									*/
#define	SMBUS_EC_REGNOERR		(0x02 | 0x200)		/* 寄存器号异常   								*/
#define	SMBUS_EC_DANUMERR		(0x03 | 0x200)		/* 個数不良異常									*/
/*--------------------------------------------------------------------------------------------------*/
#define	SMBUS_SEC_REGNOERR		(0x30 | 0x200)		/* 功能码不存在              				    */
#define	SMBUS_SEC_ACCSERR		(0x31 | 0x200)		/* 访问权限限制的错误							*/
#define	SMBUS_SEC_DALMTERR		(0x32 | 0x200)		/* 设定值范围溢出  							    */
#define	SMBUS_SEC_DAMTHERR		(0x33 | 0x200)		/* 数据匹配错误       							*/
#define	SMBUS_SEC_CONDERR		(0x34 | 0x200)		/* 条件 误 									    */
#define	SMBUS_SEC_INTLOCKERR	(0x35 | 0x200)		/* 处理冲突(同时有好几个操作处理中)				*/
/*--------------------------------------------------------------------------------------------------*/

LONG	MemobusRegNumberError( LONG RegNo, LONG Number, USHORT *RdBuf, HMSGIF Hmsg );
void	MemobusRespTrnsStart( HMSGIF Hmsg, USHORT Size, USHORT Status );
void	MemobusSendErrorResponse( HMSGIF Hmsg, ULONG ErrCode );
/****************************************************************************************************/
/*																									*/
/*		寄存器函数表             																	*/
/*** 得到最高4位，确定参数地址范围，得到寄存器函数表Index ***/
/*																									*/
/****************************************************************************************************/

#define	RFTBLIDX( RegNo )		((RegNo>>12) & 0x0F)		/* Get RegFuncTbl Index					*/

/*--------------------------------------------------------------------------------------------------*/
typedef	LONG	(*REGFUN)( LONG RegNo, LONG Number, USHORT *RdBuf, HMSGIF Hmsg );
typedef	struct	{
	REGFUN	ReadRegister;			/* Read  Register Function										*/
	REGFUN	WriteRegister;			/* Write Register Function										*/
	UCHAR	MblkWchk;				/* Multi-Block Write Check										*/
	UCHAR	Spare;					/* Spare														*/
} REGFUNTBL;
/*--------------------------------------------------------------------------------------------------*/

/*** 寄存器函数表 ***/
const	REGFUNTBL	RegFuncTbl[15] = {
/*	ReadRegister			WriteRegister			Mblk  Spare										*/
/*--------------------------------------------------------------------------------------------------*/
 {	RpxReadPrmRegister,		RpxWritePrmRegister,	0x00, 0x00, },	/* 0 : Parameter Normal		Pn参数组	*/
 {	RpxReadPrmRegister,		RpxWritePrmRegister,	0x00, 0x00, },	/* 1 : Parameter Temp       Pn参数组    */
 {	RpxReadOpeRegister,		RpxWriteOpeRegister,	0x01, 0x00, },	/* 2 : Operation Register	操作寄存器组	*/
 {	RpxReadEngRegister,		RpxWriteEngRegister,	0x00, 0x00, },	/* 3 : 工程参数写入Eeeprom   工程寄存器组 	*/
 /*-------------------------------------------------------------------------------------------------*/
 {	RpxReadTraceRegister,	RpxWriteTraceRegister,	0x00, 0x00, },	/* 4 : DataTrace Register	跟踪寄存器组	*/
 {	RpxReadTraceRegister,	RpxWriteTraceRegister,	0x00, 0x00, },	/* 5 : DataTrace Register	跟踪寄存器组	*/
 {	RpxReadTraceRegister,	RpxWriteTraceRegister,	0x00, 0x00, },	/* 6 : DataTrace Register	跟踪寄存器组	*/
 {	RpxReadTraceRegister,	RpxWriteTraceRegister,	0x00, 0x00, },	/* 7 : DataTrace Register	跟踪寄存器组	*/
 /*-------------------------------------------------------------------------------------------------*/
 {	MemobusRegNumberError,	MemobusRegNumberError,	0x00, 0x00, },	/* 8 : Reserved					*/
 {	MemobusRegNumberError,	MemobusRegNumberError,	0x00, 0x00, },	/* 9 : Reserved					*/
 {	MemobusRegNumberError,	MemobusRegNumberError,	0x00, 0x00, },	/* A : Reserved					*/
 {	MemobusRegNumberError,	MemobusRegNumberError,	0x00, 0x00, },	/* B : Reserved					*/
 /*-------------------------------------------------------------------------------------------------*/
 {	MemobusRegNumberError,	MemobusRegNumberError,	0x00, 0x00, },	/* C : TypeInfo  Register	机型信息组，只读	*/
 {	MemobusRegNumberError,	MemobusRegNumberError,	0x00, 0x00, },	/* D : Reserved		            */
 {	RpxReadMonRegister,		MemobusRegNumberError,	0x00, 0x00, },	/* E : Monitor				Un参数组，只读	*/
// {	RpxReadPrmRegister,		RpxWriteSPrmRegister,	0x00, 0x00, },	/* F : Parameter Special		*/
};





/**********************************************************************************************/
/* Function_Name: MemobusRegNumberError         */
/* Description  : 寄存器读写接口函数:寄存器编号异常
                  调用：暂未调用
                  输入：
                  输出：   */
/**********************************************************************************************/
LONG	MemobusRegNumberError( LONG RegNo, LONG Number, USHORT *RdBuf, HMSGIF Hmsg )
{
		Hmsg->ErrRno = (USHORT)RegNo;				/* 异常寄存器编号						  */
		return ( SMBUS_SEC_REGNOERR );				/* 寄存器号码异常						  */
}


/**********************************************************************************************/
/* Function_Name: RpxSmsgFuncExecResponse         */
/* Description  : 辅助功能执行结果响应处理
                  调用：辅助功能执行结果响应-函数中调用
                  输入：
                  输出：   */
/**********************************************************************************************/
void	RpxSmsgFuncExecResponse( HMSGIF Hmsg )
{
    USHORT	*CmdBufW = (USHORT *)(Hmsg->CmdBuf);  // 获取接收缓存指针
    USHORT	*ResBufW = (USHORT *)(Hmsg->ResBuf);  // 获取发送缓存指针
    USHORT	TrnsLen;

        /*** 若协议执行状态不为完成或继续，返回错误帧 ***/
		if ( (Hmsg->FunSts != REGIF_COMPLETE) && (Hmsg->FunSts != REGIF_CONTINUE) )
		{
			MemobusSendErrorResponse( Hmsg, Hmsg->FunSts );
			return;
		}
        /*** 若协议执行状态为完成或继续，正常返回接收数据帧 ***/
		ResBufW[0] = CmdBufW[0];
		ResBufW[1] = CmdBufW[1];
		ResBufW[2] = CmdBufW[2];
		TrnsLen = 8;

		MlibSetCRC16( Hmsg->ResBuf, TrnsLen );  // 进行CRC计算
		MemobusRespTrnsStart( Hmsg, TrnsLen, RESMT_COMPLETE );   // 响应数据传输设置
		return;
}

/**********************************************************************************************/
/* Function_Name: MemobusSendErrorResponse         */
/* Description  : modbus异常应答回复处理
                  调用：检测到通讯异常，调用此函数应答
                  输入：
                  输出：   */
/**********************************************************************************************/
void	MemobusSendErrorResponse( HMSGIF Hmsg, ULONG ErrCode )
{
UCHAR	*CmdBuf = (UCHAR *)(Hmsg->CmdBuf);
UCHAR	*ResBuf = (UCHAR *)(Hmsg->ResBuf);
USHORT	MbusErrCode;

/*--------------------------------------------------------------------------------------------------*/
/*		 生成异常响应数据 */
/*--------------------------------------------------------------------------------------------------*/
		switch ( (USHORT)ErrCode )
		{
            /*--------------------------------------------------------------------------------------*/
			case	REGIF_CMDERR	:			/* 取的功能码地址异常(不存在)			        */
				MbusErrCode = SMBUS_EC_FNCDERR;
				break;
			/*--------------------------------------------------------------------------------------*/	
			case	REGIF_REGNOERR	:			/* 寄存器编号/地址异常                   			    */
				MbusErrCode = SMBUS_SEC_ACCSERR;
				break;
			/*--------------------------------------------------------------------------------------*/	
			case	REGIF_DALMTERR	:			/* 数据异常 						        */
				MbusErrCode = SMBUS_SEC_DALMTERR;
				break;
			/*--------------------------------------------------------------------------------------*/	
			case	REGIF_DACALERR	:			/* 数据异常(计算异常) 							        */
			case	REGIF_DAMTHERR	:			/* 数据完整性异常								        */
				MbusErrCode = SMBUS_SEC_DAMTHERR;
				break;
			/*--------------------------------------------------------------------------------------*/	
			case	REGIF_DAMTHERR2	:			/* 数据完整性异常 								        */
				MbusErrCode = SMBUS_SEC_CONDERR;
				break;
			/*--------------------------------------------------------------------------------------*/	
			case	REGIF_DANUMERR	:			/* 数据个数异常   								        */
				MbusErrCode = SMBUS_EC_DANUMERR;
				break;
			/*--------------------------------------------------------------------------------------*/	
			case	REGIF_FOPEERR1	:
			case	REGIF_FOPEERR2	:			/* 不可处理(由其他信道产生操作模式占用)			        */
			case	REGIF_FOPEERR3	:
				MbusErrCode = SMBUS_SEC_INTLOCKERR;
				break;
			/*--------------------------------------------------------------------------------------*/	
			default	:
				MbusErrCode = (USHORT)ErrCode;
				break;
            /*--------------------------------------------------------------------------------------*/
		}

/*--------------------------------------------------------------------------------------------------*/
/*		 生成异常响应数据 */
/*--------------------------------------------------------------------------------------------------*/
		ResBuf[0] = CmdBuf[0];						/* AxisAddr										*/
		ResBuf[1] = CmdBuf[1] | 0x80;				/* Function Code								*/
		ResBuf[2] = (UCHAR)(MbusErrCode & 0xFF);	/* Error Code									*/
/*--------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------*/
/*		CRC计算，异常应答信息长度5																					    */
/*--------------------------------------------------------------------------------------------------*/
		MlibSetCRC16( Hmsg->ResBuf, SMBUS_RESSIZ_ERR );

/*--------------------------------------------------------------------------------------------------*/
/*		应答数据发送指令																			    */
/*--------------------------------------------------------------------------------------------------*/
		MemobusRespTrnsStart( Hmsg, SMBUS_RESSIZ_ERR, RESMT_COMPLETE );
		return;
}


/**********************************************************************************************/
/* Function_Name: RpxSmsgCheckRecvMessage         */
/* Description  : 对接收到的信息进行CRC校验处理
                  调用：接收数据CRC检查时调用-串口/USB消息管理函数中调用
                  输入：
                  输出：   */
/**********************************************************************************************/
/*																									*/
/*	機 能 : 对接收到的信息进行校验处理。														                */
/*																									*/
/*			1) 接收消息的检查															                */
/*			2) 受信メョ殑ージのサムチェック															        */
/*																									*/
/*			注) 軸ア鐨勳スのチェックは、通信ドライバで行う。										                */
/*																									*/
/*																									*/
/****************************************************************************************************/
LONG	RpxSmsgCheckRecvMessage( HMSGIF Hmsg )
{
USHORT	*MsgBuf = (USHORT *)Hmsg->CmdBuf;
		return ( MlibChkCRC16( MsgBuf, Hmsg->RcvLen ) );

}

/**********************************************************************************************/
/* Function_Name: MemobusRespTrnsStart         */
/* Description  : 响应数据传输设置
                  调用：Modbus数据响应时调用
                  所有发送数据准备好后，都会进入这个函数执行状态改变，进而进入发送状态。
                  输入：
                  输出：   */
/**********************************************************************************************/
void	MemobusRespTrnsStart( HMSGIF Hmsg, USHORT Size, USHORT Status )
{
UCHAR	Channel;

        /*------------------------------------------------------------------------------------------*/
        /*		数据发送通道设置，串口或USB												            */
        /*------------------------------------------------------------------------------------------*/
		if ( Hmsg == &SrlMsg )
		{
			Channel = COM0_UART;
		}
        /*------------------------------------------------------------------------------------------*/
		else if ( Hmsg == &UsbMsg )
		{
			Channel = COM1_USB;
		}
        /*------------------------------------------------------------------------------------------*/
		else
		{
			return;
		}
        /*------------------------------------------------------------------------------------------*/
        /*		响应数据传输指令																	        */
        /*------------------------------------------------------------------------------------------*/
		DriComSetTrnsStart( Channel, Size, Status );

		return;
}

/**********************************************************************************************/
/* Function_Name: RpiWordSwap         */
/* Description  : 两个字节合成一个字
                  调用：根据需要调用
                  输入：高字节地址
                  输出：合成后的字  */
/**********************************************************************************************/
USHORT	RpiWordSwap( void *pStream  )
{
	return ( (USHORT)((*(UCHAR *)pStream << 8) + *((UCHAR *)pStream + 1)) );
}


/**********************************************************************************************/
/* Function_Name: MemobusLoopbackTest         */
/* Description  : modbus回送测试，并生成应答数据
                  调用：Modbus-0x08回送测试功能码下，执行
                  输入：
                  输出：   */
/**********************************************************************************************/
void	MemobusLoopbackTest( HMSGIF Hmsg, LONG FuncCodeIdx )
{
ULONG	i;
USHORT	*CmdBuf = (USHORT *)(Hmsg->CmdBuf);
USHORT	*ResBuf = (USHORT *)(Hmsg->ResBuf);

/*--------------------------------------------------------------------------------------------------*/
/*** 发送响应数据使用接收数据，进行回传测试 ***/
/*--------------------------------------------------------------------------------------------------*/
		for ( i = 0; i <  8 / 2; i++ )
		{
			ResBuf[i] = CmdBuf[i];
		}
/*--------------------------------------------------------------------------------------------------*/
/*		应答数据发送指令   																			        */
/*--------------------------------------------------------------------------------------------------*/
		MemobusRespTrnsStart( Hmsg, 8, RESMT_COMPLETE );
		return;
}


/****************************************************************************************************/
/*																									*/
/*		Memobus：ARM + FPGA 芯片型号处理       														    */
/*																									*/
/****************************************************************************************************/
void	ARM_Bord_Response( HMSGIF Hmsg )
{
UCHAR	*CmdBuf = (UCHAR *)(Hmsg->CmdBuf);
UCHAR	*ResBuf = (UCHAR *)(Hmsg->ResBuf);

/*--------------------------------------------------------------------------------------------------*/
/*		異常応答データ作成																			    */
/*--------------------------------------------------------------------------------------------------*/
		ResBuf[0] = CmdBuf[0];						/* AxisAddr										*/
		ResBuf[1] = 0x03;				            /* Function Code								*/
		ResBuf[2] = 0x02;
        ResBuf[3] = (Sif.AxisNumber >> 8) & 0xFF;
        ResBuf[4] = Sif.AxisNumber & 0xFF;
/*--------------------------------------------------------------------------------------------------*/
/*		ＣＲＣ設定																					    */
/*--------------------------------------------------------------------------------------------------*/
		MlibSetCRC16( Hmsg->ResBuf, 7 );

/*--------------------------------------------------------------------------------------------------*/
/*		応答データ送信指令																			    */
/*--------------------------------------------------------------------------------------------------*/
		MemobusRespTrnsStart( Hmsg, 7, RESMT_COMPLETE );
		return;
}

/**********************************************************************************************/
/* Function_Name: ARM_IC_Response         */
/* Description  : 读取IC信息-ARM+FPGA芯片型号，并生成应答数据
                  调用：modbus读取寄存器读取地址0xBFA0情况下，执行
                  这里用来返回arm和FPGA功能的类型号，用来作为机型硬件类型的判断
                  输入：
                  输出：   */
/**********************************************************************************************/
void	ARM_IC_Response( HMSGIF Hmsg )
{
UCHAR	*CmdBuf = (UCHAR *)(Hmsg->CmdBuf);
UCHAR	*ResBuf = (UCHAR *)(Hmsg->ResBuf);


/*--------------------------------------------------------------------------------------------------*/
/*		生成异常响应数据																			    */
/*--------------------------------------------------------------------------------------------------*/
		ResBuf[0] = CmdBuf[0];						/* AxisAddr										*/
		ResBuf[1] = CmdBuf[1];				        /* Function Code								*/
		ResBuf[2] = 0x02;
        ResBuf[3] = 0x26;       // ARM-----0x20: HDSC 4A0
                                //         0x21: ST H723
                                //         0x22: ST F745
                                // DSP-----0x23:28385D(SD100)
        						// 		   0x24:28385D(RB100)
        						// 		   0x25:28385D(RB300)
        						// 		   0x26:28385D(RB200)
        						// 		   0x27:28385D(SD200)
        ResBuf[4] = 0x30;       //  0x03: (A型机)

        if( Kprm.f.StandardType )
        {
            ResBuf[4] |= 0x01;      // 脉冲机型
        }
        else if( Kprm.f.CanOpenNet )
        {
            ResBuf[4] |= 0x02;      // CanOpen 机型
        }
        else if( Kprm.f.EtherCATNet)
        {
            ResBuf[4] |= 0x03;      // EtherCAT 机型
        }
        else
        {
            ResBuf[4] |= 0x04;      // PN 或其它机型
        }
/*--------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------*/
/*		CRC计算																					    */
/*--------------------------------------------------------------------------------------------------*/
		MlibSetCRC16( Hmsg->ResBuf, 7 );

/*--------------------------------------------------------------------------------------------------*/
/*		响应数据传输设置																			    */
/*--------------------------------------------------------------------------------------------------*/
		MemobusRespTrnsStart( Hmsg, 7, RESMT_COMPLETE );
		return;
}


/**********************************************************************************************/
/* Function_Name: MemobusReadRegister         */
/* Description  : Modbus读取处理
                  调用：Modbus协议处理函数中执行
                  输入：
                  输出：   */
/**********************************************************************************************/
#define	SMBUS_MIN_REGNUM	  1
void	MemobusReadRegister( HMSGIF Hmsg, LONG FuncCodeIdx )
{
LONG	rc;
USHORT	*ResBuf = (USHORT *)(Hmsg->ResBuf);
USHORT	*pResData;
USHORT	*CmdBufW = (USHORT *)(Hmsg->CmdBuf);
ULONG	RegNo;
USHORT	RegNum;
USHORT	RegBnum;
USHORT	TrnsLen;
USHORT	MaxRegNum;

/*--------------------------------------------------------------------------------------------------*/
/*** SndBufSize配置为256字节，减去固定长度部分6并保留裕量到10，除以2，就算出来最大寄存器个数 ***/
/*--------------------------------------------------------------------------------------------------*/
		MaxRegNum = (Hmsg->SndBufSize - 10) >> 1;

        /* 取功能码地址,两个字节合并成一个字 */
		RegNo = (ULONG)RpiWordSwap( (UCHAR *)&(Hmsg->CmdBuf[ 2 ]) );
        /* 读取寄存器的数量,单位为字,两个字节合并成一个字 */
		RegNum = RpiWordSwap( (UCHAR *)&(Hmsg->CmdBuf[ 4 ]) );  //寄存器个数
        
		RegBnum = 2 * RegNum;   /* 字节个数 */

		/*** 读取寄存器数量不在范围内，返回错误帧 ***/
		if ( (RegNum < SMBUS_MIN_REGNUM) || (RegNum > MaxRegNum) )
		{
			MemobusSendErrorResponse( Hmsg, SMBUS_EC_DANUMERR ); // 返回个数异常
			return;
		}
        
        
/*--------------------------------------------------------------------------------------------------*/
/*		The register read processing																*/
/*--------------------------------------------------------------------------------------------------*/
		pResData = &ResBuf[ 3 ];                    /*  取发送的缓存的地址指针,用来保存需要发送的数据           */

        /*------------------------------------------------------------------------------------------*/
        /* 特定功能应答处理                                                                             */
        /*------------------------------------------------------------------------------------------*/
        if( RegNo == 0xBFA0 )
        {
            ARM_IC_Response( Hmsg );  // 读取IC信息-ARM+FPGA芯片型号，并生成应答数据
            return;
        }
        else if( RegNo == 0xBFA0 && ResBuf[ 0 ] == 0x00)
        {
            ARM_Bord_Response( Hmsg );
        }
        else   /*** 执行读取函数部分 ***/
        {
            /*** 这里是通讯协议和功能码参数的的读取接口。这里的数据获取指针采用了16bit类型，
                    获得的数据是按照字的方式存储在数组中的：低地址字节是低8位，高地址字节是高8位。 ***/
            rc = RegFuncTbl[ RFTBLIDX(RegNo) ].ReadRegister( RegNo, RegNum, (USHORT *)pResData, Hmsg );        
        }        
        
/*--------------------------------------------------------------------------------------------------*/
/*		 寄存器读取异常检查 */
/*--------------------------------------------------------------------------------------------------*/
		if ( (rc != REGIF_COMPLETE) && (rc != REGIF_CONTINUE) )
		{
			MemobusSendErrorResponse( Hmsg, rc );
			return;
		}

        /*** 把查询到功能码(Word)拆分成字节 ***/
		ResBuf[0] = CmdBufW[0];					/*  轴号和功能码						    */
		ResBuf[1] = CmdBufW[1];                 /*  AxisAddr, FunctionCode                          */
        ResBuf[2] = (UCHAR)RegBnum;             // 计算返回字节个数

		TrnsLen = 5 + RegBnum;                  /*  发送字节长度                                       */
/*--------------------------------------------------------------------------------------------------*/
/*		CRC计算																					    */
/*--------------------------------------------------------------------------------------------------*/
		MlibSetCRC16( Hmsg->ResBuf, TrnsLen );
/*--------------------------------------------------------------------------------------------------*/
/*		响应数据传输设置																			    */
/*--------------------------------------------------------------------------------------------------*/
		MemobusRespTrnsStart( Hmsg, TrnsLen, RESMT_COMPLETE );

		return;
}

/**********************************************************************************************/
/* Function_Name: MemobusWriteRegister         */
/* Description  : Modbus写入处理
                  调用：Modbus协议处理函数中执行
                  输入：
                  输出：   */
/**********************************************************************************************/
void	MemobusWriteRegister( HMSGIF Hmsg, LONG FuncCodeIdx )
{
LONG	rc;
ULONG	i;
//USHORT	*CmdBuf = (USHORT *)(Hmsg->CmdBuf);
USHORT	*pCmdData;
USHORT	*CmdBufW = (USHORT *)(Hmsg->CmdBuf);
USHORT	*ResBufW = (USHORT *)(Hmsg->ResBuf);
ULONG	RegNo;      // 数据地址，并在RegFuncTbl[]中查找具体哪种寄存器写入
USHORT	RegNum;     // 写word个数
USHORT	RegBnum;    // 写byte个数 = 2*RegNum
USHORT	TrnsLen;
USHORT	DataTmp;

USHORT  DataBuf[128];

/*--------------------------------------------------------------------------------------------------*/
/*		取功能码地址,两个字节合并成一个字																				    */
/*--------------------------------------------------------------------------------------------------*/
		RegNo = (ULONG)RpiWordSwap( (UCHAR *)&(Hmsg->CmdBuf[ 2 ]) );

/*--------------------------------------------------------------------------------------------------*/
/*		不同写入指令处理																				    */
/*--------------------------------------------------------------------------------------------------*/
		if ( Hmsg->CmdBuf[ 1 ] == MODBUS_REG_WR )               /* 0x06指令:单个字写入                         */
		{
			RegNum = SMBUS_MIN_REGNUM;                          /* 写入字数                           */
			RegBnum = 2 * RegNum;                               /* 写入字节数                          */
			pCmdData = &DataBuf[ 0 ];                           // 写入数据的起始地址
		}
		else                                                    /* 0x10 指令:写入多个字                        */
		{                                                       /* 写入字数                         */
			RegNum = Hmsg->CmdBuf[ 5 ];
            if( Hmsg->CmdBuf[ 6 ] == 0 )                       // 字节数为0，代表258个字节
            {
                RegBnum = 258;
            }
            else
            {
                RegBnum = Hmsg->CmdBuf[ 6 ];                        /* 写入字节数                       */
            }
            pCmdData = &DataBuf[ 0 ];                           // 写入数据的起始地址
		}
/*--------------------------------------------------------------------------------------------------*/
/*** 写入字的个数合法性检查
    这里是最小写入1和(字节数、字数)对等的检查。没有对最长写入做限制，但是很显然，最长是258个字节。***/
/*--------------------------------------------------------------------------------------------------*/
        if ( (RegNum < SMBUS_MIN_REGNUM ) || (RegBnum != 2 * RegNum) )
		{
			MemobusSendErrorResponse( Hmsg, SMBUS_EC_DANUMERR );  //返回错误帧
			return;
		}
/*--------------------------------------------------------------------------------------------------*/
/*** 将功能码word：低地址字节是低8位，高地址字节是高8位；拆分成modbus协议字节：低地址字节是
    高8位，高地址字节是低8位。实现了高低字节对调，成功将协议字节顺序转换成word顺序。 ***/
/*--------------------------------------------------------------------------------------------------*/
		for ( i = 0; i < RegNum; i++ )
		{
            if( Hmsg->CmdBuf[ 1 ] == MODBUS_REG_WR)
            {
                DataTmp = ((Hmsg->CmdBuf[ 4 ]) << 8)  + Hmsg->CmdBuf[ 5 ];
            }
            else
            {
                DataTmp = ((Hmsg->CmdBuf[ 7 + 2* i ]) << 8)  + Hmsg->CmdBuf[ 8 + 2* i ];
            }
            *(USHORT*)(pCmdData + i) = DataTmp;
		}

		/*** Modbus通讯协议和功能码的写入接口 ***/
		rc = RegFuncTbl[ RFTBLIDX(RegNo) ].WriteRegister( RegNo, RegNum, (USHORT *)pCmdData, Hmsg );
/*--------------------------------------------------------------------------------------------------*/
/*		寄存器写入异常检查																*/
/*--------------------------------------------------------------------------------------------------*/        
		if ( (rc != REGIF_COMPLETE) && (rc != REGIF_CONTINUE) )
		{
			MemobusSendErrorResponse( Hmsg, rc );
			return;
		}
/*--------------------------------------------------------------------------------------------------*/
/*		数据写入处理完成后，恢复协议数组数据          																        */
/*--------------------------------------------------------------------------------------------------*/         
		for ( i = 0; i < RegNum; i++ )
		{
			*(USHORT*)(pCmdData + 2*i) = RpiWordSwap( (UCHAR *)(pCmdData + 2*i) );
		}
        
		/*** 继续情况下，直接返回，不用回复数据 ***/
		if( rc == REGIF_CONTINUE )
		{
			return;
		}

		ResBufW[0] = CmdBufW[0];
		ResBufW[1] = CmdBufW[1];
		ResBufW[2] = CmdBufW[2];
		ResBufW[3] = CmdBufW[3];
		ResBufW[4] = CmdBufW[4];
		ResBufW[5] = CmdBufW[5];
		TrnsLen = 8;                                // 06和10写入命令的应答数据均为8，前六个字节和接收数据一致。s
		MlibSetCRC16( Hmsg->ResBuf, TrnsLen );      // 计算CRC校验

		MemobusRespTrnsStart( Hmsg, TrnsLen, RESMT_COMPLETE );   // 响应数据传输设置
		return;
}



/**********************************************************************************************/
/* Function_Name: RpxSmsgMainProcedure         */
/* Description  : Modbus 协议处理
                  调用：Usb或串行通讯消息管理函数中调用
                  输入：
                  输出：   */
/**********************************************************************************************/
void	RpxSmsgMainProcedure( HMSGIF Hmsg )
{
        /*------------------------------------------------------------------------------------------*/
        /*		通讯处理用相关变量         														            */
        /*------------------------------------------------------------------------------------------*/
		Hmsg->FunSts  = 0;                              /* 辅助功能执行结果							    */
		Hmsg->LstErrRno = Hmsg->ErrRno;                 /* 上回异常代码      						    */
		Hmsg->ErrRno  = 0xFFFF;                         /* 异常代码    							    */
		MbusMngV.ErrReg = Hmsg->LstErrRno;              /* 寄存器参考用异常寄存器编号			        */
        
        /*------------------------------------------------------------------------------------------*/
        /*		Memobus 命令处理																	    */
        /*------------------------------------------------------------------------------------------*/
		switch( (UCHAR)Hmsg->CmdBuf[1] )
		{
            /*--------------------------------------------------------------------------------------*/
			case MODBUS_LOOPBACK:   /* 0x08 回送测试    */
				MemobusLoopbackTest(Hmsg, 0);
				break;
            /*--------------------------------------------------------------------------------------*/
			case MODBUS_REG_RD:     /* 0x03读N个字      */
			case 0x04:
				MemobusReadRegister(Hmsg, 24);
				break;
            /*--------------------------------------------------------------------------------------*/
			case MODBUS_REG_WR:     /* 0x06 写一个字    */
			case MODBUS_PREG_WR:    /* 0x10 写N个字     */
				MemobusWriteRegister(Hmsg, 25);
				break;
            /*--------------------------------------------------------------------------------------*/
            //case MODBUS_MEM_RD:     /* 0x50 寄存器读 */     待完善 2017.08.10
				//MemobusReadMemory(Hmsg, 25);
			//	break;
            /*--------------------------------------------------------------------------------------*/
			default:
				MemobusSendErrorResponse( Hmsg, SMBUS_EC_FNCDERR );  // 返回错误帧
            /*--------------------------------------------------------------------------------------*/
		}
		return;
}


/****************************************************************************************************/
/*                               The End of the file                                                */
/****************************************************************************************************/
