/*
 * EtherCAT20_PortCheck.h
 *
 *  Created on: 2021年01月22日
 *      Author: zhuxc
 */

#ifndef EtherCAT20_PortCheck_H
#define EtherCAT20_PortCheck_H





/****************************************************************************************************/
/*                                          变量定义                                                */
/****************************************************************************************************/
typedef struct
{
    USHORT Un045;                                           /* 端口0 无效帧计数                        */
    USHORT Un046;                                           /* 端口0 接收错误计数                       */
    USHORT Un047;                                           /* 端口1 无效帧计数                        */
    USHORT Un048;                                           /* 端口1 接收错误计数                       */
    /*----------------------------------------------------------------------------------------------*/
    USHORT Un049;                                           /* 端口0 转发错误计数                       */
    USHORT Un04A;                                           /* 端口1 转发错误计数                       */
    /*----------------------------------------------------------------------------------------------*/
    USHORT Un04B;                                           /* 数据帧处理单元错误计数                     */
    USHORT Un04C;                                           /* PDI 错误计数计数                        */
    /*----------------------------------------------------------------------------------------------*/
    USHORT Un04D;                                           /* 端口0链接丢失计数                        */
    USHORT Un04E;                                           /* 端口0链接丢失计数                        */
    /*----------------------------------------------------------------------------------------------*/
    USHORT Step;                                            /* 处理步骤                               */
}DATALINK_VAL;

extern DATALINK_VAL DataLinkV;
extern void DataLink_Init( void );
extern void DataLink_Deal( void );

#endif
